#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SK_Env_EndAWire_000_B_PostAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SK_Env_EndAWire_000_B_PostAnim.ABP_SK_Env_EndAWire_000_B_PostAnim_C
// 0x07E0 (0x0B50 - 0x0370)
class UABP_SK_Env_EndAWire_000_B_PostAnim_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0390(0x0680)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0A10(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0A30(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0A50(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0B08(0x0020)()
	class AWindDirectionalSource*                 WindDirectionalScource;                            // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WindForce;                                         // 0x0B30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintBeginPlay();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_SK_Env_EndAWire_000_B_PostAnim(int32 EntryPoint);
	void SetupWindDirectionSource();
	void UpdateWindForce();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_SK_Env_EndAWire_000_B_PostAnim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_SK_Env_EndAWire_000_B_PostAnim_C")
	}
	static class UABP_SK_Env_EndAWire_000_B_PostAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SK_Env_EndAWire_000_B_PostAnim_C>();
	}
};
DUMPER7_ASSERTS_UABP_SK_Env_EndAWire_000_B_PostAnim_C;

}

