#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Pl_Hina_050

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimPlus_structs.hpp"
#include "ABP_Pl_Hina_050_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Pl_Hina_050.ABP_Pl_Hina_050_C
// 0x0F30 (0x12A0 - 0x0370)
class UABP_Pl_Hina_050_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Pl_Hina_050::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0390(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x03D8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x0420(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0430(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0478(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0540(0x0010)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x0550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x05A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x05C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x05F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0668(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x06B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x06E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x07A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x07D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x07F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0870(0x0028)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_6;            // 0x0898(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0968(0x0020)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_5;            // 0x0988(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0A58(0x0020)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_4;            // 0x0A78(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0B48(0x0020)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_3;            // 0x0B68(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0C38(0x0020)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_2;            // 0x0C58(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0D28(0x0020)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_1;            // 0x0D48(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0E18(0x0020)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer;              // 0x0E38(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0F08(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0F28(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0FF0(0x00F0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x10E0(0x0158)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1238(0x0020)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x1258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UNocePlayerAnimInstance*                NocePlayerAnimInstance;                            // 0x1260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanEnterDamage;                                    // 0x1268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1269[0x3];                                     // 0x1269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           LocomotionStateTag;                                // 0x126C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          MeshToCopyValid;                                   // 0x1274(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1275[0x3];                                     // 0x1275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CutSceneBlendValue;                                // 0x1278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          CanEnterInteract;                                  // 0x1280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Leave_Interact;                                // 0x1281(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_In_Low_Stamina;                                 // 0x1282(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LowHealth;                                         // 0x1283(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BattleFacialAnimID;                                // 0x1284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnyToDead;                                         // 0x1288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SMDeadToSMRespawn;                                 // 0x1289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128A[0x2];                                     // 0x128A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Health_State_Tag;                                  // 0x128C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageAnimID;                                      // 0x1294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetCanEnterIdleVar(bool CanEnterIdleVar, int32 IdleVarInt);
	void Initialize();
	void GetOnSlope(bool* IsOnSlope);
	void ExecuteUbergraph_ABP_Pl_Hina_050(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pl_Hina_050_AnimGraphNode_TransitionResult_FD1CB6D2458F33A2490C429123A1EAC3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pl_Hina_050_AnimGraphNode_TransitionResult_F7181048457822C24A83E8875A752881();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pl_Hina_050_AnimGraphNode_TransitionResult_EE577C1448710CE779794FA7A1795E99();
	void BPI_PlayerAnim_SetDefaultSlotBlending(double Blending);
	void BPI_PlayerAnim_SetCutsceneBlending(double Blending);
	void BPI_PlayerAnim_SetCanLeaveJogEnd(bool NewParam);
	void BPI_PlayerAnim_SetCanEnterJogEnd(bool NewValue);
	void BPI_PlayerAnim_GetInCutscene(bool* InCutscene);
	void BPI_DebugIdleVarInt(int32 DebugIdleVarInt);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimNotify_EnterDeath();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pl_Hina_050_AnimGraphNode_TransitionResult_ED763CCB482E0DDF59D633B6D9231327();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pl_Hina_050_AnimGraphNode_TransitionResult_C199D9A949AB69CD5E0330B647FB73A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pl_Hina_050_AnimGraphNode_TransitionResult_5168EE794A67D857C8EEDC9AD788BF15();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pl_Hina_050_AnimGraphNode_TransitionResult_30B2AFFD4DCFE0D81A3CCA9BB88C3354();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pl_Hina_050_AnimGraphNode_TransitionResult_1DBC8EC7451E0B1FEA2BCCB2098A3D7C();
	void BPI_SetLadderHeadLayer(bool UseLadderHeadLayer);
	void BPI_PlayerAnim_UpdateSlopeAngle();
	void BPI_PlayerAnim_SetInSeamless(bool NewValue);
	void BPI_PlayerAnim_SetInCutscene(bool NewValue);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Pl_Hina_050_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Pl_Hina_050_C")
	}
	static class UABP_Pl_Hina_050_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Pl_Hina_050_C>();
	}
};
DUMPER7_ASSERTS_UABP_Pl_Hina_050_C;

}

