#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SK_Env_Base_NoteBook_000_A

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SK_Env_Base_NoteBook_000_A.ABP_SK_Env_Base_NoteBook_000_A_C
// 0x0090 (0x0400 - 0x0370)
class UABP_SK_Env_Base_NoteBook_000_A_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03A8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x03F0(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_SK_Env_Base_NoteBook_000_A(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_SK_Env_Base_NoteBook_000_A_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_SK_Env_Base_NoteBook_000_A_C")
	}
	static class UABP_SK_Env_Base_NoteBook_000_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SK_Env_Base_NoteBook_000_A_C>();
	}
};
DUMPER7_ASSERTS_UABP_SK_Env_Base_NoteBook_000_A_C;

}

