#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NpcBase

#include "Basic.hpp"

#include "GameNoce_classes.hpp"
#include "ABP_NpcBase_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimPlus_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NpcBase.ABP_NpcBase_C
// 0x11F0 (0x1890 - 0x06A0)
class UABP_NpcBase_C : public UNoceEnemyAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_NpcBase::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                  // 0x06A8(0x0024)(HasGetValueTypeHash)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06D0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06D8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0700(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0728(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0750(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0778(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x07A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x07C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x07F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0818(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0840(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0868(0x0028)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_3;            // 0x0890(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0960(0x0020)()
	struct FAnimPlusAnimNode_BlendSpacePlayer     AnimPlusAnimGraphNode_BlendSpacePlayer_4;          // 0x0980(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0A50(0x0020)()
	struct FAnimPlusAnimNode_BlendSpacePlayer     AnimPlusAnimGraphNode_BlendSpacePlayer_3;          // 0x0A70(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0B40(0x0020)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_2;            // 0x0B60(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0C30(0x0048)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer_1;            // 0x0C78(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0D48(0x0020)()
	struct FAnimPlusAnimNode_SequencePlayer       AnimPlusAnimGraphNode_SequencePlayer;              // 0x0D68(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0E38(0x0020)()
	struct FAnimPlusAnimNode_BlendSpacePlayer     AnimPlusAnimGraphNode_BlendSpacePlayer_2;          // 0x0E58(0x00D0)()
	struct FAnimPlusAnimNode_BlendSpacePlayer     AnimPlusAnimGraphNode_BlendSpacePlayer_1;          // 0x0F28(0x00D0)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend;                       // 0x0FF8(0x0050)()
	struct FAnimPlusAnimNode_BlendSpacePlayer     AnimPlusAnimGraphNode_BlendSpacePlayer;            // 0x1048(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1118(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1138(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1200(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1220(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1230(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1250(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1318(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1360(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x13E0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1408(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1450(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1498(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x14E0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1508(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x15D0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1650(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1678(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1740(0x0048)()
	class ANoceCharacter*                         MyCharacter;                                       // 0x1788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_Interp;                                      // 0x1790(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1794[0x4];                                     // 0x1794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MoveSpeed;                                         // 0x1798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkStartYaw;                                      // 0x17A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateMovementYaw;                                 // 0x17A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateMoveSpeed;                                   // 0x17A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17AA[0x6];                                     // 0x17AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            WalkSpeedCurve;                                    // 0x17B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PrevWalkSpeedSample;                               // 0x17B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnYaw;                                           // 0x17C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCanTurn;                                         // 0x17C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C9[0x7];                                     // 0x17C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              TurnFinished;                                      // 0x17D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        FootIKInterpSpeed_Current;                         // 0x17E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOnSlope;                                         // 0x17E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E9[0x7];                                     // 0x17E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IKInterpSpeedSlope_Idle;                           // 0x17F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKInterpSpeedSlope_Moving;                         // 0x17F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKInterpSpeedDefault_Idle;                         // 0x1800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKInterpSpeedDefault_Moving;                       // 0x1808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SlopeBlendSpaceInterpSpeed;                        // 0x1810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSlopeAngle;                                     // 0x1818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SlopeAngle;                                        // 0x1820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetSlopWalkUpRatio;                             // 0x1828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetNormalWalkRatio;                             // 0x1830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetSlopeWalkDownRatio;                          // 0x1838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentSlopeWalkUpRatio;                           // 0x1840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentNormalWalkRatio;                            // 0x1848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentSlopeWalkDownRatio;                         // 0x1850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableRun;                                         // 0x1858(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1859[0x7];                                     // 0x1859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OriginalMaxWalkSpeed;                              // 0x1860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SlopeWalkMultiplier;                               // 0x1868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SlopeRunMultiplier;                                // 0x1870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanEnterIdleVar;                                   // 0x1878(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1879[0x7];                                     // 0x1879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IdleVarTimer;                                      // 0x1880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IdleVarIndex;                                      // 0x1888(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldMove;                                        // 0x188C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterSetDefaultSlotBlending(float InValue);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_EnteredWalkStart();
	void AnimNotify_EnterIdle();
	void AnimNotify_EnterTrasitToTurn();
	void AnimNotify_EnterWalkEnd();
	void AnimNotify_FullyBlendedWalk();
	void AnimNotify_LeftWalk();
	void AnimNotify_TurnToIdle();
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CheckOnSlope(double InDeltaSeconds);
	void CheckShouldMove();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NpcBase_AnimGraphNode_BlendListByBool_EFF40E1041E53D1E548F898BB8B7CA33();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NpcBase_AnimGraphNode_TransitionResult_1C9231C24EB173B047DD64A83BA26FF6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NpcBase_AnimGraphNode_TransitionResult_44937D3C44B79F1748D546B60184AB4D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NpcBase_AnimGraphNode_TransitionResult_87571F784E7A74C4CA39C68E21B28778();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NpcBase_AnimGraphNode_TransitionResult_8A37E84C4D3B582B6F55869D8A3C117E();
	void ExecuteUbergraph_ABP_NpcBase(int32 EntryPoint);
	void GetAngleBetweenVectors(const struct FVector& Vector1, const struct FVector& Vector2, double* Angle);
	float GetSlopeBlendRatio();
	void HandleBlendSlopeRatio(double InDeltaSeconds);
	void HandleIKInterpolateSpeed();
	void On_Idle_State_Update(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void On_Idle_Var_State_Entry(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void Set_Max_Walk_Speed(bool InEnableRun, double InMaxMoveSpeed);
	void UpdateMaxWalkSpeed();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_NpcBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_NpcBase_C")
	}
	static class UABP_NpcBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_NpcBase_C>();
	}
};
DUMPER7_ASSERTS_UABP_NpcBase_C;

}

