#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimPlus

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AnimPlus.AnimPlusBankComponent.GetAnimBlendSpaceFromBank
// 0x0018 (0x0018 - 0x0000)
struct AnimPlusBankComponent_GetAnimBlendSpaceFromBank final
{
public:
	int32                                         InBankID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InTagInfo;                                         // 0x0004(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAnimID;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankComponent_GetAnimBlendSpaceFromBank;

// Function AnimPlus.AnimPlusBankComponent.GetAnimMontageFromBank
// 0x0018 (0x0018 - 0x0000)
struct AnimPlusBankComponent_GetAnimMontageFromBank final
{
public:
	int32                                         InBankID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InTagInfo;                                         // 0x0004(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAnimID;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankComponent_GetAnimMontageFromBank;

// Function AnimPlus.AnimPlusBankComponent.GetAnimSequenceFromBank
// 0x0018 (0x0018 - 0x0000)
struct AnimPlusBankComponent_GetAnimSequenceFromBank final
{
public:
	int32                                         InBankID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InTagInfo;                                         // 0x0004(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAnimID;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankComponent_GetAnimSequenceFromBank;

// Function AnimPlus.AnimPlusBankComponent.GetCurrentAnimBank
// 0x0008 (0x0008 - 0x0000)
struct AnimPlusBankComponent_GetCurrentAnimBank final
{
public:
	class UAnimPlusBankDataTable*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankComponent_GetCurrentAnimBank;

// Function AnimPlus.AnimPlusBankComponent.SetCurrentAnimBank
// 0x0008 (0x0008 - 0x0000)
struct AnimPlusBankComponent_SetCurrentAnimBank final
{
public:
	class UAnimPlusBankDataTable*                 InAnimBank;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankComponent_SetCurrentAnimBank;

// Function AnimPlus.AnimPlusBankComponent.SetExtraAnimBank
// 0x0008 (0x0008 - 0x0000)
struct AnimPlusBankComponent_SetExtraAnimBank final
{
public:
	class UAnimPlusBankDataTable*                 InAnimBank;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankComponent_SetExtraAnimBank;

// Function AnimPlus.AnimPlusBankRegisterComponent.GetAnimBankData
// 0x0010 (0x0010 - 0x0000)
struct AnimPlusBankRegisterComponent_GetAnimBankData final
{
public:
	class FName                                   AnimBankKey;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimPlusBankDataTable*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankRegisterComponent_GetAnimBankData;

// Function AnimPlus.AnimPlusBankRegisterComponent.GetFirstAnimBankData
// 0x0008 (0x0008 - 0x0000)
struct AnimPlusBankRegisterComponent_GetFirstAnimBankData final
{
public:
	class UAnimPlusBankDataTable*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankRegisterComponent_GetFirstAnimBankData;

// Function AnimPlus.AnimPlusBankRegisterComponent.HasAnimationBankData
// 0x0001 (0x0001 - 0x0000)
struct AnimPlusBankRegisterComponent_HasAnimationBankData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankRegisterComponent_HasAnimationBankData;

// Function AnimPlus.AnimPlusBankRegisterComponent.RegisterAnimBank
// 0x0008 (0x0008 - 0x0000)
struct AnimPlusBankRegisterComponent_RegisterAnimBank final
{
public:
	class FName                                   AnimBankKey;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankRegisterComponent_RegisterAnimBank;

// Function AnimPlus.AnimPlusBankRegisterComponent.RegisterAnimBankToTarget
// 0x0008 (0x0008 - 0x0000)
struct AnimPlusBankRegisterComponent_RegisterAnimBankToTarget final
{
public:
	class UAnimPlusBankComponent*                 AnimPlusBankComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankRegisterComponent_RegisterAnimBankToTarget;

// Function AnimPlus.AnimPlusBankRegisterComponent.RegisterExtraAnimBanck
// 0x0008 (0x0008 - 0x0000)
struct AnimPlusBankRegisterComponent_RegisterExtraAnimBanck final
{
public:
	class FName                                   AnimBankKey;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankRegisterComponent_RegisterExtraAnimBanck;

// Function AnimPlus.AnimPlusBankRegisterComponent.SetExtraAnimBankName
// 0x0008 (0x0008 - 0x0000)
struct AnimPlusBankRegisterComponent_SetExtraAnimBankName final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusBankRegisterComponent_SetExtraAnimBankName;

// Function AnimPlus.AnimPlusFunctionLibrary.GetAnimPlusBankCurrentConditoinTag
// 0x0010 (0x0010 - 0x0000)
struct AnimPlusFunctionLibrary_GetAnimPlusBankCurrentConditoinTag final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusFunctionLibrary_GetAnimPlusBankCurrentConditoinTag;

// Function AnimPlus.AnimPlusFunctionLibrary.SetAnimPlusBankCurrentConditoinTag
// 0x0010 (0x0010 - 0x0000)
struct AnimPlusFunctionLibrary_SetAnimPlusBankCurrentConditoinTag final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InTag;                                             // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimPlusFunctionLibrary_SetAnimPlusBankCurrentConditoinTag;

}

