#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AISpawnerWithProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AISpawnerWithProgress.BP_AISpawnerWithProgress_C
// 0x0070 (0x03B8 - 0x0348)
class ABP_AISpawnerWithProgress_C final : public ANocePlayerTriggerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNoceAISpawnerEvent>            Events;                                            // 0x0360(0x0010)(Edit, BlueprintVisible)
	TArray<class ABP_AISpawnerBase_C*>            TargetSpawner;                                     // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FGameplayTag                           Condition;                                         // 0x0380(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedExactMatch;                                    // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SetTagOnSpawnedKilled;                             // 0x038C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AdditionalTagOnSpawnedKilled;                      // 0x0394(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         DieCount;                                          // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillCountToSetTag;                                 // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InitSpawnCount;                                    // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpawnInterval;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentExecuteCount;                               // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RequestTriggerInitSpawnEvent;                      // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          JobDone;                                           // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitLoadingScreen;                                 // 0x03B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GuaranteedExecution;                               // 0x03B7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DrawGizmoHint();
	void ExecuteEventOnSpawner(class ABP_AISpawnerBase_C* InSpawner, bool* Success);
	void ExecuteOneSpawnerEventOnSpawner(const struct FNoceAISpawnerEvent& InEvent, class ABP_AISpawnerBase_C* InSpawner, bool* Value);
	void ExecuteUbergraph_BP_AISpawnerWithProgress(int32 EntryPoint);
	void OnConditionChanged_BP();
	void OnSpawnIntervalTimer();
	void ReceiveBeginPlay();
	void ReceiveSpawnedAIDied();
	void ReceiveTick(float DeltaSeconds);
	void RegisterSpawndAIOnDiedEvent();
	void TriggerInitSpawnEvent(bool* Success);
	void UnregisterSpawndAIOnDiedEvent();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AISpawnerWithProgress_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AISpawnerWithProgress_C")
	}
	static class ABP_AISpawnerWithProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AISpawnerWithProgress_C>();
	}
};
DUMPER7_ASSERTS_ABP_AISpawnerWithProgress_C;

}

