#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AISpawnerBase

#include "Basic.hpp"

#include "BP_AISpawnerEscapeSetting_S_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_SpawnCommand_S_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "BP_AISpawnerPatrolSetting_S_structs.hpp"
#include "S_SpawnerLookAtSetting_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AISpawnerBase.BP_AISpawnerBase_C
// 0x01D0 (0x05E8 - 0x0418)
class ABP_AISpawnerBase_C : public ANoceAISpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    RootBillboard;                                     // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TargetName;                                        // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        TargetFacing;                                      // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnActionLevelMask;                              // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnRoundMask;                                    // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnEndingBranch;                                 // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreSaveLoad;                                    // 0x044C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysSpawnAtSpawnerLocation;                      // 0x044D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InstantSpawn;                                      // 0x044E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44F[0x1];                                      // 0x044F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAISpawnerGameplayTagTrigger           TagTrigger;                                        // 0x0450(0x0018)(Edit, BlueprintVisible, NoDestructor)
	class UClass*                                 SpawnTarget;                                       // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnThinkOff;                                     // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           SpawnMontage;                                      // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 SpawnMovementMode;                                 // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAISpawnerPerceptionOverride>   PerceptionOverride;                                // 0x0488(0x0010)(Edit, BlueprintVisible)
	struct FAISpawnerAlertOverride                AlertOverride;                                     // 0x0498(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FBP_SpawnCommand_S                     SpawnCommands;                                     // 0x04A0(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FS_SpawnerLookAtSetting                SpawnLookAtSetting;                                // 0x04B8(0x0028)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FBP_AISpawnerPatrolSetting_S           PatrolSetting;                                     // 0x04E0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FBP_AISpawnerEscapeSetting_S           EscapeSetting;                                     // 0x0538(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UClass*>                         StartupGameplayEffect;                             // 0x0548(0x0010)(Edit, BlueprintVisible)
	bool                                          EnableAIOnDamaged;                                 // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCineChar;                                        // 0x0559(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A[0x6];                                      // 0x055A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CineCharTags;                                      // 0x0560(0x0010)(Edit, BlueprintVisible)
	struct FNoceCineActorSeqStopData              CineStopSetting;                                   // 0x0570(0x0005)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSpawnedTargetDied;                               // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          EnableSwitchMesh;                                  // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SpecifiedTypeName;                                 // 0x058C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ForbiddenTypeNames;                                // 0x0598(0x0010)(Edit, BlueprintVisible)
	bool                                          ForceIncludeInBattleBGM;                           // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PreloadDistSquared;                                // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ResultCharMesh;                                    // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        PreloadedCharMesh;                                 // 0x05C0(0x0010)(Edit, BlueprintVisible, Transient)
	class FName                                   SavedCharMeshType;                                 // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MayDisplayDebugFlag;                               // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           PreloadMeshTimerHandle;                            // 0x05E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnRecordLoaded();
	void BPI_AISPawner_DeleteSpawnedCharacter(class AActor* SpecifyActor);
	bool CanSpawnAtThisDifficultyLevel();
	void CheckInPreloadCharMeshRange();
	void EnableThink(bool Enable);
	void EndAllAICommands(bool SetBrainToActive);
	void EndCurrAICommand();
	void ExecuteUbergraph_BP_AISpawnerBase(int32 EntryPoint);
	void GetLatestSpawnedCharacter(class ANoceCharacter** Char);
	TSubclassOf<class AActor> GetSpawnTargetClass();
	struct FTransform GetSpawnTransform();
	void HasSpawnedActors(bool* Value);
	void HasTagTrigger(bool* Ret);
	void InitSpawnedChar(class AActor* SpawnedActor);
	bool IsIgnoreSaveLoad();
	bool IsInstantSpawnType();
	void OnGameProgressChanged(const struct FGameplayTag& NewTag);
	void OnLoaded_2C8B8BD244DEA92C8733FC8118E76E4E(class UObject* Loaded);
	void OnLoaded_8DDC68CF458D98D081D82888CC541F87(class UObject* Loaded);
	void OnLoaded_B45EB33D42CAF9F8754CE38C7685DEE0(class UObject* Loaded);
	void OnLoaded_E601D2564B67B91CF4C1AD8B6D09AD24(class UObject* Loaded);
	void OnSpawn_BP(class AActor* SpawnedActor);
	void OnSpawnedEnemyDied();
	void OverridePerception(TArray<struct FAISpawnerPerceptionOverride>& Overrides);
	void PreLoadCharMesh();
	void PreSelectCharMeshType(class FName* MeshTypeName);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SelectCharMeshType(class ANoceCharacter* Char, class FName* MeshTypeName);
	void SetAICommands(TArray<struct FNoceAICommand>& Commands, ENoceAICommandExecType CommandExecType, bool SetBrainToActiveWhenFin);
	void SetupAIController(class ANoceAIController* AIController);
	void SetupChar(class ANoceCharacter* Char);
	void SetupEscapePoint(class ANoceCharacter* NoceCharacter);
	void SetupPatrolPoint(class ANoceCharacter* NoceCharacter);
	void SetupSpawnCommand(class ANoceAIController* AIController);
	void TeleportSpawnedChar();
	void TickUninitializeActor();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AISpawnerBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AISpawnerBase_C")
	}
	static class ABP_AISpawnerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AISpawnerBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_AISpawnerBase_C;

}

