#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AutoSave_PlayerTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "BP_PlayerTrigger_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AutoSave_PlayerTrigger.BP_AutoSave_PlayerTrigger_C
// 0x0060 (0x0408 - 0x03A8)
class ABP_AutoSave_PlayerTrigger_C final : public ABP_PlayerTrigger_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AutoSave_PlayerTrigger_C;        // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    PlayerStartLocation;                               // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FNoceLocationInfoDataDowHandle         LocationName;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, NoDestructor)
	double                                        CoolDownTime;                                      // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           World_Trigger_Setting;                             // 0x03E8(0x0010)(Edit, BlueprintVisible)
	double                                        AllowTriggerSeconds;                               // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSaveSuccess;                                     // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnRecordLoaded();
	void Completed_C953A5474C68BAA0C25C6FB30647F502(class USaveGame* SaveGame, bool bSuccess);
	void DoOnBeginOverlap(class AActor* InPawn);
	void ExecuteUbergraph_BP_AutoSave_PlayerTrigger(int32 EntryPoint);
	void HandleAutoSave();
	bool IsTriggerAvailable();
	void UpdateAllowTriggerTime();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AutoSave_PlayerTrigger_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AutoSave_PlayerTrigger_C")
	}
	static class ABP_AutoSave_PlayerTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AutoSave_PlayerTrigger_C>();
	}
};
DUMPER7_ASSERTS_ABP_AutoSave_PlayerTrigger_C;

}

