#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AddRemoveMapIconAction

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Action_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AddRemoveMapIconAction.BP_AddRemoveMapIconAction_C
// 0x0058 (0x00A8 - 0x0050)
class UBP_AddRemoveMapIconAction_C final : public UBP_Action_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AddRemoveMapIconAction_C;        // 0x0050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ENoceDynamicMapIconType                       MapIcon;                                           // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAdd;                                             // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ENoceDynamicMapIconType>               AdditionalAddMapIcons;                             // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<ENoceDynamicMapIconType>               AdditionalRemoveMapIcons;                          // 0x0070(0x0010)(Edit, BlueprintVisible)
	ENoceDynamicMapIconChapterType                ChapterType;                                       // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDynamicMapIconIndexType                  IndexType;                                         // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ENoceDynamicMapIconIndexType>          AdditionalAddIndexTypes;                           // 0x0088(0x0010)(Edit, BlueprintVisible)
	TArray<ENoceDynamicMapIconIndexType>          AdditionalRemoveIndexTypes;                        // 0x0098(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_AddRemoveMapIconAction(int32 EntryPoint);
	void PerformAction();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AddRemoveMapIconAction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AddRemoveMapIconAction_C")
	}
	static class UBP_AddRemoveMapIconAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AddRemoveMapIconAction_C>();
	}
};
DUMPER7_ASSERTS_UBP_AddRemoveMapIconAction_C;

}

