#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AICommandHandler

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AICommandHandler.BP_AICommandHandler_C
// 0x0080 (0x0120 - 0x00A0)
class UBP_AICommandHandler_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FNoceAICommand>                 CommandList;                                       // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   BrainStatusKey;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrCommandKey;                                    // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANoceAIController*                      MyAIController;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Curr_Command_Idx;                                  // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceAICommandPlayAnimInfo             PlayAnimInfo;                                      // 0x00D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	ENoceAICommandExecType                        CommandExecType;                                   // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitingCmdEndsTrigger;                             // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              CommandDoneEvent;                                  // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          SetBrainToActiveWhenFin;                           // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EndAllCommands();
	void EndCurrWaitingCommand();
	void ExecuteUbergraph_BP_AICommandHandler(int32 EntryPoint);
	void GetCurrCommand(struct FNoceAICommand* Command);
	void OnCommandDone(bool EndLoop);
	void PlayDialog(const struct FNoceAICommandDialogInfo& NoceAICommandDialogInfo);
	void ReceiveBeginPlay();
	void SetAICommands(TArray<struct FNoceAICommand>& Commands, ENoceAICommandExecType CommandExecType_0, bool SetBrainToActiveWhenFin_0);
	void SetupCommand(int32 CommandIdx);
	void StartRunCommands();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AICommandHandler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AICommandHandler_C")
	}
	static class UBP_AICommandHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AICommandHandler_C>();
	}
};
DUMPER7_ASSERTS_UBP_AICommandHandler_C;

}

