#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AISpawnerEventTrigger

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "BP_PlayerTrigger_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AISpawnerEventTrigger.BP_AISpawnerEventTrigger_C
// 0x0038 (0x03E0 - 0x03A8)
class ABP_AISpawnerEventTrigger_C final : public ABP_PlayerTrigger_Base_C
{
public:
	class UBP_ConditionHandler_C*                 BP_ConditionHandler;                               // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TrigBox;                                           // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AISpawnerBase_C*>            TargetSpawner;                                     // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FNoceAISpawnerEvent>            Events;                                            // 0x03D0(0x0010)(Edit, BlueprintVisible)

public:
	void DoOnBeginOverlap(class AActor* InPawn);
	void DrawGizmoHint();
	class FString GetDebugTriggerInfo();
	class FString GetDebugTriggerTitle();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AISpawnerEventTrigger_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AISpawnerEventTrigger_C")
	}
	static class ABP_AISpawnerEventTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AISpawnerEventTrigger_C>();
	}
};
DUMPER7_ASSERTS_ABP_AISpawnerEventTrigger_C;

}

