#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmbientSound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ImpactSoundSetting_S_structs.hpp"
#include "NeoAudio_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AmbientSound.BP_AmbientSound_C
// 0x0040 (0x0738 - 0x06F8)
class ABP_AmbientSound_C final : public ANeoAudioAmbientSound
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNeoAudioSoundComponent*                NeoAudioSound;                                     // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBP_ImpactSoundSetting_S>       SoundSettings;                                     // 0x0710(0x0010)(Edit, BlueprintVisible)
	double                                        DistToSource;                                      // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Strength;                                          // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ImpactCoolDownFinsihed;                            // 0x0730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DebugDraw();
	void ExecuteUbergraph_BP_AmbientSound(int32 EntryPoint);
	void GetImpactSound(double Strength_0, struct FNeoAudioTriggerIdHandle* SoundID);
	void OnReceiveImpact(double DistToSource_0, double Strength_0);
	void ReceiveBeginPlay();
	void SetCoolDownFinished();
	void TurnOff();
	void TurnOn();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AmbientSound_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AmbientSound_C")
	}
	static class ABP_AmbientSound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AmbientSound_C>();
	}
};
DUMPER7_ASSERTS_ABP_AmbientSound_C;

}

