#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AsyncAutoSave_State_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProgressStateWithEndTag_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AsyncAutoSave_State_Base.BP_AsyncAutoSave_State_Base_C
// 0x0018 (0x0118 - 0x0100)
class UBP_AsyncAutoSave_State_Base_C : public UBP_ProgressStateWithEndTag_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   LocationInfoRowName;                               // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartSaving;                                       // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          StateFinished;                                     // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsSaveSuccess;                                     // 0x0112(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateUpdate(float DeltaSeconds);
	void OnStateBegin();
	void OnActionEndWhenSkipped();
	void GetTeleportActor(TSoftObjectPtr<class AActor>* TeleportActor);
	void ExecuteUbergraph_BP_AsyncAutoSave_State_Base(int32 EntryPoint);
	void ConstructionScript();
	void Completed_7F4B2C0C4F11F4F7F93493BA2DCDD21D(class USaveGame* SaveGame, bool bSuccess);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AsyncAutoSave_State_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AsyncAutoSave_State_Base_C")
	}
	static class UBP_AsyncAutoSave_State_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AsyncAutoSave_State_Base_C>();
	}
};
DUMPER7_ASSERTS_UBP_AsyncAutoSave_State_Base_C;

}

