#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AttackInitiativeSetting

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BP_AttackInitiativeSetting.BP_AttackInitiativeSetting
// 0x0040 (0x0040 - 0x0000)
struct FBP_AttackInitiativeSetting final
{
public:
	struct FGameplayTag                           ProgressTag_11_4A7B373B4E745478E8E7BAB569D54D03;   // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAttackCount_4_DAEBD26B45B1980A129823A74C3E04E5; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BaseRCD_9_BF6F96AA44C7470FBE39C29388F6D99C;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AdditiveRandomRCD_12_FA3D541548717F7A3F67C1A690410DEE; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseGCD_14_3C7CB53D4A77D15C20B8DD87CB17B8B6;       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AddtiveRandomGCD_16_6D46587F4F8D5FEA9123EEB50EC9E8F1; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RandomRecoverSlot_19_5B4B81334033EB242566A3984F6FEA01; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_AttackInitiativeSetting;

}

