#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ch14MassRemoveMapIcon_State

#include "Basic.hpp"

#include "SMSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_Ch14MassRemoveMapIcon_State.BP_Ch14MassRemoveMapIcon_State_C.ExecuteUbergraph_BP_Ch14MassRemoveMapIcon_State
// 0x0010 (0x0010 - 0x0000)
struct BP_Ch14MassRemoveMapIcon_State_C_ExecuteUbergraph_BP_Ch14MassRemoveMapIcon_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerState*                       CallFunc_GetNocePlayerState_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Ch14MassRemoveMapIcon_State_C_ExecuteUbergraph_BP_Ch14MassRemoveMapIcon_State;

// Function BP_Ch14MassRemoveMapIcon_State.BP_Ch14MassRemoveMapIcon_State_C.ConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_Ch14MassRemoveMapIcon_State_C_ConstructionScript final
{
public:
	ESMExecutionEnvironment                       CallFunc_WithExecutionEnvironment_ExecutionEnvironment; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Ch14MassRemoveMapIcon_State_C_ConstructionScript;

}

