#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dev_TeleportPoint

#include "Basic.hpp"

#include "GameNoce_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "NoceBase_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dev_TeleportPoint.BP_Dev_TeleportPoint_C
// 0x00D8 (0x03E0 - 0x0308)
class ABP_Dev_TeleportPoint_C : public ANoceTeleportTarget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   PointCategory;                                     // 0x0338(0x0010)(Edit, BlueprintVisible)
	class FText                                   PointName;                                         // 0x0348(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnStreamingCompleted;                              // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         SteppingStoneDuration;                             // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AssociatedProgress;                                // 0x036C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool Success)>  OnTeleportComplete_0;                              // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTagContainer                  AssociatedProgressContainer;                       // 0x0388(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldModifyGravity;                               // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           WorldTriggerSetting;                               // 0x03B0(0x0010)(Edit, BlueprintVisible)
	bool                                          KeepWorldTriggerAfterTeleport;                     // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   AssociatedProgressTags;                            // 0x03C8(0x0010)(Edit, BlueprintVisible)
	ENoceFadeType                                 Fade_Type;                                         // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ShouldSpawnHere(const struct FGameplayTag& InitialTag, bool* Result);
	void RequestWorldTrigger();
	void ReceiveBeginPlay();
	void PrepareForSpawn(const struct FGameplayTag& InitialTag, bool WithSaveData);
	void PreActualTeleport();
	void OnStartTeleport();
	void OnEndTeleport();
	TArray<class FName> GetWorldTriggerGateway();
	class FString GetPointName();
	void ExecuteUbergraph_BP_Dev_TeleportPoint(int32 EntryPoint);
	void EnableSteppingStone(bool InEnable);
	void EnablePlayerInput(bool InEnable);
	void EnablePlayerCharacterGravity(bool InEnable);
	void DoGreyboxFilterIfExist();
	void DisablePlayerInteractUpdate(bool Disable);
	void CheckForGround(const struct FVector& CheckLocation, bool* HasHit);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Dev_TeleportPoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Dev_TeleportPoint_C")
	}
	static class ABP_Dev_TeleportPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dev_TeleportPoint_C>();
	}
};
DUMPER7_ASSERTS_ABP_Dev_TeleportPoint_C;

}

