#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dev_EasyRouteNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerTrigger_Base_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dev_EasyRouteNode.BP_Dev_EasyRouteNode_C
// 0x0048 (0x03F0 - 0x03A8)
class ABP_Dev_EasyRouteNode_C final : public ABP_PlayerTrigger_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Dev_EasyRouteNode_C;             // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ScreenIndicatorComponent_C*         BP_ScreenIndicatorComponent;                       // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_Dev_EasyRouteNode_C*                NextTrigger;                                       // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurrent;                                         // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnEndEasyRoute;                                    // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FColor                                 DebugColor;                                        // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StartEasyRoute();
	void SetNodeAndChildrenHidden(bool InHidden);
	void OnBoxBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void InitializeEasyRoute();
	class FString GetDebugTriggerTitle();
	class FString GetDebugTriggerInfo();
	struct FColor GetDebugActiveColor();
	void ExecuteUbergraph_BP_Dev_EasyRouteNode(int32 EntryPoint);
	void EndEasyRoute();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Dev_EasyRouteNode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Dev_EasyRouteNode_C")
	}
	static class ABP_Dev_EasyRouteNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dev_EasyRouteNode_C>();
	}
};
DUMPER7_ASSERTS_ABP_Dev_EasyRouteNode_C;

}

