#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DelayAction

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DelayAction.BP_DelayAction_C.DebugGetActionInfo
// 0x0040 (0x0040 - 0x0000)
struct BP_DelayAction_C_DebugGetActionInfo final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DelayAction_C_DebugGetActionInfo;

// Function BP_DelayAction.BP_DelayAction_C.ExecuteUbergraph_BP_DelayAction
// 0x0008 (0x0008 - 0x0000)
struct BP_DelayAction_C_ExecuteUbergraph_BP_DelayAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DelayAction_C_ExecuteUbergraph_BP_DelayAction;

}

