#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dev_EasyRouteMaster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_NoceActor_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Dev_EasyRouteMaster.BP_Dev_EasyRouteMaster_C
// 0x0038 (0x02E0 - 0x02A8)
class ABP_Dev_EasyRouteMaster_C final : public ABP_NoceActor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Dev_EasyRouteMaster_C;           // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNoceShowByProgressComponent*           NoceShowByProgress;                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          StartAtBegin;                                      // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Dev_EasyRouteNode_C*>        Nodes;                                             // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CurrentPivot;                                      // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StartCondition;                                    // 0x02D4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          EasyRouteEnabled;                                  // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StopEasyNode(int32 Index_0);
	void StartEasyRoute();
	void StartEasyNode(int32 Index_0);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnGameProgressChanged(const struct FGameplayTag& NewTag);
	void OnEasyNodeEnd();
	struct FVector GetCurrentPivot(bool* IsValid);
	void ExecuteUbergraph_BP_Dev_EasyRouteMaster(int32 EntryPoint);
	void CollectNodes();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Dev_EasyRouteMaster_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Dev_EasyRouteMaster_C")
	}
	static class ABP_Dev_EasyRouteMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Dev_EasyRouteMaster_C>();
	}
};
DUMPER7_ASSERTS_ABP_Dev_EasyRouteMaster_C;

}

