#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvImpactSoundObj_Base

#include "Basic.hpp"

#include "BP_ImpactSoundSetting_S_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_EnvImpactSoundObj_Base.BP_EnvImpactSoundObj_Base_C.DebugDraw
// 0x0058 (0x0058 - 0x0000)
struct BP_EnvImpactSoundObj_Base_C_DebugDraw final
{
public:
	class UBP_GameSyncSystem_C*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EnvImpactSoundObj_Base_C_DebugDraw;

// Function BP_EnvImpactSoundObj_Base.BP_EnvImpactSoundObj_Base_C.GetImpactSound
// 0x0048 (0x0048 - 0x0000)
struct BP_EnvImpactSoundObj_Base_C_GetImpactSound final
{
public:
	double                                        Strength_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               SoundID;                                           // 0x0008(0x0008)(Parm, OutParm, NoDestructor)
	double                                        MaxStrength;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               RetSoundID;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBP_ImpactSoundSetting_S               CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EnvImpactSoundObj_Base_C_GetImpactSound;

// Function BP_EnvImpactSoundObj_Base.BP_EnvImpactSoundObj_Base_C.OnReceiveImpact
// 0x0020 (0x0020 - 0x0000)
struct BP_EnvImpactSoundObj_Base_C_OnReceiveImpact final
{
public:
	double                                        DistToSource_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Strength_0;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               CallFunc_GetImpactSound_SoundID;                   // 0x0010(0x0008)(NoDestructor)
	class UObject*                                CallFunc_SendSoundTrigger_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EnvImpactSoundObj_Base_C_OnReceiveImpact;

}

