#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvImpactSoundObj_Base

#include "Basic.hpp"

#include "BP_ImpactSoundSetting_S_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnvImpactSoundObj_Base.BP_EnvImpactSoundObj_Base_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_EnvImpactSoundObj_Base_C final : public AActor
{
public:
	class UNeoAudioSoundComponent*                NeoAudioSound;                                     // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        DistToSource;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Strength;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBP_ImpactSoundSetting_S>       SoundSettings;                                     // 0x02B8(0x0010)(Edit, BlueprintVisible)

public:
	void DebugDraw();
	void GetImpactSound(double Strength_0, struct FNeoAudioTriggerIdHandle* SoundID);
	void OnReceiveImpact(double DistToSource_0, double Strength_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EnvImpactSoundObj_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EnvImpactSoundObj_Base_C")
	}
	static class ABP_EnvImpactSoundObj_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnvImpactSoundObj_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_EnvImpactSoundObj_Base_C;

}

