#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fade_State

#include "Basic.hpp"

#include "NoceBase_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_ProgressStateWithEndTag_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Fade_State.BP_Fade_State_C
// 0x0018 (0x0118 - 0x0100)
class UBP_Fade_State_C final : public UBP_ProgressStateWithEndTag_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsFadeOut;                                         // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeDuration;                                      // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceFadeType                                 Fade_Type;                                         // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDone;                                            // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateUpdate(float DeltaSeconds);
	void OnStateBegin();
	void ExecuteUbergraph_BP_Fade_State(int32 EntryPoint);
	void ConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Fade_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Fade_State_C")
	}
	static class UBP_Fade_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Fade_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Fade_State_C;

}

