#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_Em_Tsukumo_WaterDropPP_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FX_Em_Tsukumo_WaterDropPP_000.BP_FX_Em_Tsukumo_WaterDropPP_000_C
// 0x0058 (0x02E8 - 0x0290)
class ABP_FX_Em_Tsukumo_WaterDropPP_000_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Intensity_E66E67F6464C8EC95B37E7AB0D20F32F; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_LerpMapAB_E66E67F6464C8EC95B37E7AB0D20F32F; // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_E66E67F6464C8EC95B37E7AB0D20F32F; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PPMaterial;                                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  Post_Process;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendables                    Weighted_Blendables;                               // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Intensity;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FX_Em_Tsukumo_WaterDropPP_000(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FX_Em_Tsukumo_WaterDropPP_000_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FX_Em_Tsukumo_WaterDropPP_000_C")
	}
	static class ABP_FX_Em_Tsukumo_WaterDropPP_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FX_Em_Tsukumo_WaterDropPP_000_C>();
	}
};
DUMPER7_ASSERTS_ABP_FX_Em_Tsukumo_WaterDropPP_000_C;

}

