#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ForbitSubtitleByLanguage_State

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ForbitSubtitleByLanguage_State.BP_ForbitSubtitleByLanguage_State_C.ExecuteUbergraph_BP_ForbitSubtitleByLanguage_State
// 0x0040 (0x0040 - 0x0000)
struct BP_ForbitSubtitleByLanguage_State_C_ExecuteUbergraph_BP_ForbitSubtitleByLanguage_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceSubtitleSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ForbitSubtitleByLanguage_State_C_ExecuteUbergraph_BP_ForbitSubtitleByLanguage_State;

}

