#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GetConsumable_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProgressStateWithEndTag_Base_classes.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_GetConsumable_State.BP_GetConsumable_State_C
// 0x0018 (0x0118 - 0x0100)
class UBP_GetConsumable_State_C final : public UBP_ProgressStateWithEndTag_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   ConsumableItemName;                                // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowGetNewItemUI;                                  // 0x0114(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlaySystemHintVO;                                  // 0x0115(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateBegin();
	void ExecuteUbergraph_BP_GetConsumable_State(int32 EntryPoint);
	void ConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GetConsumable_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GetConsumable_State_C")
	}
	static class UBP_GetConsumable_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GetConsumable_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_GetConsumable_State_C;

}

