#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameSyncSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NoceBase_structs.hpp"
#include "NeoAudio_structs.hpp"
#include "NeoAudio_classes.hpp"
#include "GameNoce_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameSyncSystem.BP_GameSyncSystem_C
// 0x0180 (0x01D0 - 0x0050)
class UBP_GameSyncSystem_C final : public UNeoAudioGameSyncSystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   StatesToRest;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Initialized_BP;                                    // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkAudioEvent*>                  PreloadAkEvent;                                    // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ANocePlayerCharacter*                   PlayerChar;                                        // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        CombatBGMTime;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CombatBGMTimer;                                    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BGMCombatState;                                    // 0x0098(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerGameplayTagEventBinded;                      // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnemyInSight;                                      // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EnemyLeftState;                                    // 0x00A4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInEvent;                                         // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkAudioEvent*>                  SoundBank;                                         // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SendEngageStinger;                                 // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanSendEngageStinger;                              // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceLanguageType                             AudioCulture;                                      // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawEnvImapctSound;                                // 0x00C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNeoAudioPostEventParam                UnmuteCSSFX;                                       // 0x00C8(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FNeoAudioPostEventParam                BGMFadeOutEvent;                                   // 0x0138(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UObject>>         PreloadAssetArray;                                 // 0x01A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        CachedAssetObjecs;                                 // 0x01B8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	struct FGameplayTag                           WeakStateTag;                                      // 0x01C8(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddControllerSpeakerOutput();
	void AddMotionOutput();
	void BindGameStateEvent();
	bool Deinitialize_BP();
	void DialogEndCallback(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void ExecuteUbergraph_BP_GameSyncSystem(int32 EntryPoint);
	void InitControllerAudioSetting();
	bool Initialize_BP();
	void InitializeStates();
	void IssueAttack();
	void OnControllerConnectionChanged(bool IsConnected, int32 UserId, ENoceInputDeviceType DeviceType);
	void OnDisplayLoadingScreen();
	void OnPlayerGameplayTagUpdated(const struct FGameplayTag& Tag, bool TagExists);
	void OnProgressTagUpdated(const struct FGameplayTag& NewTag);
	void OnRemoveLoadingScreen();
	void OnWindUpdate(float WindSpeed, int32 AudioLevel);
	struct FNeoAudioPostDialogResult PostDialogEvent(class UActorComponent* Component, const struct FNeoAudioTriggerIdHandle& TriggerId);
	bool PostInitialize_BP();
	void PreLoadGameplayAsset();
	void ResetStates();
	void SetAudioProfile(uint8 Culture);
	void SetCulture(int32 Culture);
	void SetCultureDone(bool Succeeded);
	void SetGameFlowState(const struct FGameplayTag& NewGameFlowState, bool StackCurrState, bool UseStackState);
	void SetLevelProgressState(const struct FGameplayTag& NewLevelProgressState);
	void SetPlayerWeakState(const struct FGameplayTag& StateValue);
	void SetRound();
	void SetRTPC(const struct FGameplayTag& RTPC, double Value, bool BypassInternalValueInterpolation);
	void SetRTPC_Cached(const struct FGameplayTag& RTPC, double Value, bool BypassInternalValueInterpolation);
	void SetState(const struct FGameplayTag& StateValue);
	void SetWindLevel(double WindLevel);
	bool Tick_BP(float DeltaTime);
	void UnloadGameplayAsset();
	void UpdateFogWallDist();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GameSyncSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GameSyncSystem_C")
	}
	static class UBP_GameSyncSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GameSyncSystem_C>();
	}
};
DUMPER7_ASSERTS_UBP_GameSyncSystem_C;

}

