#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Greybox_SavePoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Greybox_SavePoint.BP_Greybox_SavePoint_C.ChangeEmissive
// 0x000C (0x000C - 0x0000)
struct BP_Greybox_SavePoint_C_ChangeEmissive final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Intensity;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Greybox_SavePoint_C_ChangeEmissive;

// Function BP_Greybox_SavePoint.BP_Greybox_SavePoint_C.ExecuteUbergraph_BP_Greybox_SavePoint
// 0x0004 (0x0004 - 0x0000)
struct BP_Greybox_SavePoint_C_ExecuteUbergraph_BP_Greybox_SavePoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Greybox_SavePoint_C_ExecuteUbergraph_BP_Greybox_SavePoint;

}

