#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Greybox_SavePoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_FlotIcon_Basic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Greybox_SavePoint.BP_Greybox_SavePoint_C
// 0x0040 (0x02F0 - 0x02B0)
class ABP_Greybox_SavePoint_C final : public ABP_FlotIcon_Basic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Greybox_SavePoint_C;             // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube4;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube3;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube2;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube1;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             New_Sprite_0;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          SWITCH;                                            // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeEmissive(bool Show);
	void ExecuteUbergraph_BP_Greybox_SavePoint(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Greybox_SavePoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Greybox_SavePoint_C")
	}
	static class ABP_Greybox_SavePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Greybox_SavePoint_C>();
	}
};
DUMPER7_ASSERTS_ABP_Greybox_SavePoint_C;

}

