#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GatewayTrigger_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerTrigger_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GatewayTrigger_Base.BP_GatewayTrigger_Base_C
// 0x0028 (0x03D0 - 0x03A8)
class ABP_GatewayTrigger_Base_C : public ABP_PlayerTrigger_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GatewayTrigger_Base_C;           // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   B;                                                 // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   A;                                                 // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void CheckSide(class AActor* TargetActor, bool* Result);
	void DoOnEndOverlap(class AActor* InPawn);
	void ExecuteUbergraph_BP_GatewayTrigger_Base(int32 EntryPoint);
	bool IsNocePlayer(class UObject* A_0);
	void OnGoThroughGateway(bool FromAToB);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GatewayTrigger_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GatewayTrigger_Base_C")
	}
	static class ABP_GatewayTrigger_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GatewayTrigger_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_GatewayTrigger_Base_C;

}

