#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GimmickBase_FSM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SMSystem_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass BP_GimmickBase_FSM.BP_GimmickBase_FSM_C
// 0x0908 (0x1000 - 0x06F8)
#pragma pack(push, 0x1)
class alignas(0x10) UBP_GimmickBase_FSM_C : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANocePlayerCharacter*                   Operator;                                          // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ANocePlayerController*                  OperatorController;                                // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           Target_Camera_Actor;                               // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Camera_Blend_Time;                                 // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCameraBlendIn;                                  // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CommonGuideToken;                                  // 0x0724(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANoceInteractableBase*                  GimmickBase;                                       // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CancelPressed;                                     // 0x0730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              ConfirmPressed;                                    // 0x0740(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(ENoceUIInputAction InInput)> UINavigatePressed;                    // 0x0750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_GimmickInput_C*                    InputWidget;                                       // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CachedLeftAxisForward;                             // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CachedLeftAxisRight;                               // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ENoceUIInputAction>                    NavigateOn;                                        // 0x0778(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              DebugCompletePressed;                              // 0x0788(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnInterruptByDamage;                               // 0x0798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsNavigateCoolingDown;                             // 0x07A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NavigateCooldown;                                  // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NavigateRepeatTime;                                // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NavigateTimerHandle;                               // 0x07C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           BlendingCamera;                                    // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TotalBlendDuration;                                // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentBlendDuration;                              // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurrentBlendingIn;                               // 0x07E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              UIAction1Pressed;                                  // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              UIAction2Pressed;                                  // 0x07F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<ENoceUIInputAction>                    KeyOn;                                             // 0x0808(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              UIPageUpPressed;                                   // 0x0818(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              UIPageDownPressed;                                 // 0x0828(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              DebugUtilityPressed;                               // 0x0838(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 FadeRequestInfo;                                   // 0x0848(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        CachedRightAxisForward;                            // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CachedRightAxisRight;                              // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double WheelDelta)> MouseWheelMoved;                               // 0x0868(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCameraComponent*                       PlayerCameraComponent;                             // 0x0878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   PlayerCameraPostProcessSetting;                    // 0x0880(0x06F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSoftClassPath                         PauseMenuRef;                                      // 0x0F70(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UNocePauseWidget*                       PauseMenuInst;                                     // 0x0F90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           EnableLightTimer;                                  // 0x0F98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsManuallyDisableEventMode;                        // 0x0FA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA1[0x7];                                      // 0x0FA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              UITabLeftPressed;                                  // 0x0FA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              UITabRightPressed;                                 // 0x0FB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FName>                           NotebookActionForGamepad;                          // 0x0FC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           NotebookActionForKeyboard;                         // 0x0FD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsManuallySetInputMode;                            // 0x0FE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerDeadHandled;                                 // 0x0FE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FEA[0x6];                                      // 0x0FEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FadeOutTimer;                                      // 0x0FF0(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BlendCameraToPlayer(float BlendTime);
	void BlendInCamera();
	void BlendOutCamera();
	void BPI_GimmickBase_IsManuallyDisableEventMode(bool IsManually);
	void BPI_GimmickBase_IsManuallySetInputMode(bool IsManually);
	void CancelNavigateRepeatTimer();
	void ClearAnalogCache();
	void DelayEnableCameraLight();
	void EnableCameraLights(bool InEnable);
	void EnablePlayerInput(bool IsEnableAction, bool IsEnableAxis, bool IsEnableUIAction);
	void EndInputWidget();
	void ExecuteUbergraph_BP_GimmickBase_FSM(int32 EntryPoint);
	void FinalizeGimmick();
	void ForceEndOnPlayerDie();
	void GetAnalogValueForward(double* OutAxisForward);
	void GetAnalogValueRight(double* CachedAxisRight);
	void GetAnalogValueXY(double* OutAnalogX, double* OutAnalogY);
	void GetUseInputWidget(bool* UseInput);
	void HandleNotebookClose();
	void HideInputGuide();
	void HidePlayerPawn(bool InHide, bool InAdjustInput);
	void InterruptListener();
	void IsInputActionOn(ENoceUIInputAction InInputAction, bool* IsOn);
	void KeyToInputAction(const struct FKey& InKey, bool IsKeyUp, ENoceUIInputAction* OutInputAction, bool* IsValidInput);
	void On_Key_Down(const struct FKey& InKey);
	void OnAnalogValueChanged(const struct FAnalogInputEvent& InAnalogEvent);
	void OnBlendOutFinish();
	void OnCameraBlendIn();
	void OnFadeOutFinishOnBlendIn();
	void OnFadeOutFinishOnBlendOut();
	void OnKeyUp(const struct FKey& InKey);
	void OnMouseWheel(double WheelDelta);
	void OnNavigateCooldownTimeup();
	void OnNavigateRepeat();
	void OnPlayerInputUIAction(ENoceUIInputAction InInputUIAction, bool InPressed);
	void OpenNotebook();
	void PrepareGimmick();
	void ReceiveOperatorTriggerDamaged(float InHealthDamage, float InMaxSanityDamage);
	void RequestFadeIn(double duration);
	void RequestFadeOut(float TimeSecond);
	void RequestUnregisterInterruptListener();
	void ResetNavigateRepeatTimer();
	void ResumePlayerPawn();
	void ResumePlayerPawnNextTick();
	void ShowInputGuide(class FName InGuideRowName);
	void StartInputWidget();
	void StartNavigateCooldown();
	void Tick(float DeltaTime);
	void UnRegisterInterruptListener();
	void UpdateBlendingCamera(double Delta);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GimmickBase_FSM_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GimmickBase_FSM_C")
	}
	static class UBP_GimmickBase_FSM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GimmickBase_FSM_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UBP_GimmickBase_FSM_C;

}

