#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameplayTagTriggerHandle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NeoAudio_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameplayTagTriggerHandle.BP_GameplayTagTriggerHandle_C
// 0x0020 (0x0308 - 0x02E8)
class ABP_GameplayTagTriggerHandle_C final : public ANeoAudioGameplayTagTrigger
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EventBinded;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BindEventTimerHandle;                              // 0x0300(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindGameplayTagChangedEvent();
	void ExecuteUbergraph_BP_GameplayTagTriggerHandle(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GameplayTagTriggerHandle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GameplayTagTriggerHandle_C")
	}
	static class ABP_GameplayTagTriggerHandle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameplayTagTriggerHandle_C>();
	}
};
DUMPER7_ASSERTS_ABP_GameplayTagTriggerHandle_C;

}

