#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameFlowInGame_State

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_GameFlowInGame_State.BP_GameFlowInGame_State_C.ConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_GameFlowInGame_State_C_ConstructionScript final
{
public:
	ESMExecutionEnvironment                       CallFunc_WithExecutionEnvironment_ExecutionEnvironment; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_GameFlowInGame_State_C_ConstructionScript;

// Function BP_GameFlowInGame_State.BP_GameFlowInGame_State_C.ExecuteUbergraph_BP_GameFlowInGame_State
// 0x0020 (0x0020 - 0x0000)
struct BP_GameFlowInGame_State_C_ExecuteUbergraph_BP_GameFlowInGame_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               K2Node_MakeStruct_NeoAudioTriggerIdHandle;         // 0x0004(0x0008)(NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioSystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayUISound_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_GameFlowInGame_State_C_ExecuteUbergraph_BP_GameFlowInGame_State;

// Function BP_GameFlowInGame_State.BP_GameFlowInGame_State_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_GameFlowInGame_State_C_OnStateUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_GameFlowInGame_State_C_OnStateUpdate;

}

