#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InGame_FSM

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "SMSystem_classes.hpp"
#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass BP_InGame_FSM.BP_InGame_FSM_C
// 0x3350 (0x3A48 - 0x06F8)
class UBP_InGame_FSM_C final : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_16; // 0x0700(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_15; // 0x0890(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_14; // 0x0A20(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_13; // 0x0BB0(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_12; // 0x0D40(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_11; // 0x0ED0(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_10; // 0x1060(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_9; // 0x11F0(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_8; // 0x1380(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_7; // 0x1510(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_6; // 0x16A0(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_5; // 0x1830(0x0190)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_9; // 0x19C0(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_8; // 0x1B48(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_7; // 0x1CD0(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_6; // 0x1E58(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_5; // 0x1FE0(0x0188)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_4; // 0x2168(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_3; // 0x22F8(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_2; // 0x2488(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_1; // 0x2618(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop; // 0x27A8(0x0190)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_4; // 0x2938(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_3; // 0x2AC0(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_2; // 0x2C48(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_1; // 0x2DD0(0x0188)()
	struct FSMConduit                             SMGraphK2Node_ConduitResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop; // 0x2F58(0x0190)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop; // 0x30E8(0x0188)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_1; // 0x3270(0x02C8)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop; // 0x3538(0x02C8)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_7; // 0x3800(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_6; // 0x3848(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_5; // 0x3890(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_4; // 0x38D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_3; // 0x3920(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_2; // 0x3968(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop_1; // 0x39B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_LD_Prop; // 0x39F8(0x0048)()
	ENocePauseType                                PauseType;                                         // 0x3A40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InGame_FSM(int32 EntryPoint);
	void SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_5C329E6B9F408B7F31DD868FABFFAF62();
	void SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_5C329E6B9F408B7F31DD868FABFFAF62_1();
	void SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_5C329E6B9F408B7F31DD868FABFFAF62_2();
	void SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_5C329E6B9F408B7F31DD868FABFFAF62_3();
	void SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_6AB85A8093124BC8613B958319CFAA5F();
	void SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_8C5DEF07ED565B6E3B93DF399F35238D();
	void SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_B75B98086DFFB51126BD28FB035E2B92();
	void SMGraphK2Node_GraphPropertyNode_51EB348A4E41EF4FEE4EC9A243A9B08E_E845CDC7D6C5FAD367740C15C263CDEE();
	void SMGraphK2Node_StateEndNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Others_A1A9644142077E1EA4EF179D810964FA();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Equipment_73A9904F4B060EF7F9CFFBBF42529CB1();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_EventPauseMenu_505635D2429BF23AFE29208634F18786();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_GameOver_6188C4A84651864C98E96093880561B1();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_InEvent_ACD8D275417223874E6A608C0A96611F();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_InGame_865AB74C4CC83CD89D7F0FA24A19F2BC();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Map_98A0064740FA0B19A8B5DEBEF89E4C56();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Notebook_09FAC9D6495F064A50061A8B97EFE561();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Others_A1A9644142077E1EA4EF179D810964FA();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_PauseMenu_8093F4404BB5B6AAB5E83E9C80FAE76C();
	void SMGraphK2Node_StateEntryNode_51EB348A4E41EF4FEE4EC9A243A9B08E_WaitGameInitialized_BADA133B45C5F88A47CF7B83F18C7F23();
	void SMGraphK2Node_TransitionEnteredNode_51EB348A4E41EF4FEE4EC9A243A9B08E_InGame_to_PauseStateMachine_1FE3DD9045E0CDA7ED2A92B73AE627A9();
	void SMGraphK2Node_TransitionEnteredNode_51EB348A4E41EF4FEE4EC9A243A9B08E_InGame_to_PauseStateMachine_5482A8FD48E59CA60FB406B8F0D06823();
	void SMGraphK2Node_TransitionEnteredNode_51EB348A4E41EF4FEE4EC9A243A9B08E_InGame_to_PauseStateMachine_C80F8B0C406A1F77D12ED18FB12B7A35();
	void SMGraphK2Node_TransitionEnteredNode_51EB348A4E41EF4FEE4EC9A243A9B08E_InGame_to_PauseStateMachine_E9412DDA44ACA8D21C9A5BBA4F90916A();
	void SMGraphK2Node_TransitionEnteredNode_51EB348A4E41EF4FEE4EC9A243A9B08E_InGame_to_PauseStateMachine_FF667CA54DD8AA516E25F38ED1AD2D8B();
	void SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Conduit_to_Equipment_50EAD98243C38C4B3A9B1BBBB78B965B();
	void SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Conduit_to_Map_8F57A63849AF51D6994377844765BA08();
	void SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Conduit_to_Notebook_2F2DFA9A46EC25ED1E36909C7CA9C58D();
	void SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Conduit_to_Others_F47B9A6746C49876CE9385A5AAFA4B8E();
	void SMGraphK2Node_TransitionResultNode_51EB348A4E41EF4FEE4EC9A243A9B08E_Conduit_to_PauseMenu_43DB537246E43CD6A179199B18F9E8ED();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InGame_FSM_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InGame_FSM_C")
	}
	static class UBP_InGame_FSM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InGame_FSM_C>();
	}
};
DUMPER7_ASSERTS_UBP_InGame_FSM_C;

}

