#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InnerWordsInteract

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InnerWordsInteract.BP_InnerWordsInteract_C.CanInteractWithPawnBP
// 0x0010 (0x0010 - 0x0000)
struct BP_InnerWordsInteract_C_CanInteractWithPawnBP final
{
public:
	class AActor*                                 InteractorPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteractWithPawnBP_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InnerWordsInteract_C_CanInteractWithPawnBP;

// Function BP_InnerWordsInteract.BP_InnerWordsInteract_C.ExecuteInstantFeedback
// 0x0010 (0x0010 - 0x0000)
struct BP_InnerWordsInteract_C_ExecuteInstantFeedback final
{
public:
	class AActor*                                 InteractPawn;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteInstantFeedback_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InnerWordsInteract_C_ExecuteInstantFeedback;

// Function BP_InnerWordsInteract.BP_InnerWordsInteract_C.ExecuteUbergraph_BP_InnerWordsInteract
// 0x0018 (0x0018 - 0x0000)
struct BP_InnerWordsInteract_C_ExecuteUbergraph_BP_InnerWordsInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNoceDialogSubsystem*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyDialog_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InnerWordsInteract_C_ExecuteUbergraph_BP_InnerWordsInteract;

// Function BP_InnerWordsInteract.BP_InnerWordsInteract_C.IsInteractionForbitBP
// 0x0018 (0x0018 - 0x0000)
struct BP_InnerWordsInteract_C_IsInteractionForbitBP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceDialogSubsystem*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyDialog_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InnerWordsInteract_C_IsInteractionForbitBP;

// Function BP_InnerWordsInteract.BP_InnerWordsInteract_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_InnerWordsInteract_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InnerWordsInteract_C_ReceiveTick;

}

