#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InspectTickConditionTrigger

#include "Basic.hpp"

#include "BP_TickConditionTrigger_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InspectTickConditionTrigger.BP_InspectTickConditionTrigger_C
// 0x00A8 (0x0470 - 0x03C8)
class ABP_InspectTickConditionTrigger_C final : public ABP_TickConditionTrigger_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_InspectTickConditionTrigger_C;   // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNeoAudioSoundComponent*                NeoAudioSound;                                     // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          EffectActor;                                       // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        CancelDuration;                                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InspectAlphaMinMax;                                // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SuccessDuration;                                   // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SuccessAlphaMinMax;                                // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AlphaName;                                         // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInCancelEffect;                                  // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CancelTimer;                                       // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectAlpha;                                       // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CachedEffectAlpha;                                 // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInSuccessEffect;                                 // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OverlapCount;                                      // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SuccessTimer;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               AudioInspecting;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FNeoAudioTriggerIdHandle               AudioStopInspecting;                               // 0x0450(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FNeoAudioTriggerIdHandle               AudioCancel;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FNeoAudioTriggerIdHandle               AudioSuccess;                                      // 0x0460(0x0008)(Edit, BlueprintVisible, NoDestructor)
	bool                                          IsPlayingInspectingAudio;                          // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateInspectEffect(bool IsActiviate);
	void BindOverlapEvent();
	void CanInspect(bool* CanInspect_0);
	void CanPlayCancelEffect(bool* CanPlay);
	void ExecuteUbergraph_BP_InspectTickConditionTrigger(int32 EntryPoint);
	void HandleOnDiscontinued();
	void HandlePlayCancelEffect();
	void OnShapeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnShapeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnSuccess();
	void PlayInspectingAudio(bool IsPlay);
	void PlaySuccessEffect();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ShowDebugInfo();
	void StopEffect();
	void UnbindOverlapEvent();
	void UpdateActorTick(bool IsEnableTick);
	void UpdateEffect();
	void UpdateEffectActivation();
	void UpdateEffectAlpha(double InDeltaTime);
	void UpdateEffectParameters();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InspectTickConditionTrigger_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InspectTickConditionTrigger_C")
	}
	static class ABP_InspectTickConditionTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InspectTickConditionTrigger_C>();
	}
};
DUMPER7_ASSERTS_ABP_InspectTickConditionTrigger_C;

}

