#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interact_Pickup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NeoAudio_structs.hpp"
#include "BP_InteractWithConditionBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interact_Pickup.BP_Interact_Pickup_C
// 0x0140 (0x06F8 - 0x05B8)
class ABP_Interact_Pickup_C : public ABP_InteractWithConditionBase_C
{
public:
	uint8                                         Pad_5B2[0x6];                                      // 0x05B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Interact_Pickup_C;               // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNocePlayerLookAtTargetComponent*       NocePlayerLookAtTarget;                            // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   PickupClass;                                       // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TriggerBox;                                        // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IconPosition;                                      // 0x05D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconPositionOffsetZ;                               // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PickupOnce;                                        // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnExecutePickup;                                   // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, AdvancedDisplay, BlueprintCallable)
	struct FNeoAudioPostEventParam                In_Audio_Post_Event_Param;                         // 0x0610(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          PickupThenHideMe;                                  // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnActionLevelMask;                              // 0x0684(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnRoundMask;                                    // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnEndingMask;                                   // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANocePickupBase*                        NocePickupBase;                                    // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractPawn;                                      // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         ReplaceWeaponUIPath;                               // 0x06A0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UNoceReplaceWeaponWidget*               ReplaceWeaponUI;                                   // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         ReplaceConsumableUIPath;                           // 0x06C8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UNoceReplaceConsumableWidget*           ReplaceConsumableUI;                               // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ConditionHandlerBlockPickup;                       // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReadyToDestroy;                                    // 0x06F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void BndEvt__BP_PickupBase_TriggerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_PickupBase_TriggerBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CanSpawn(bool* Spawnable);
	void CheckMe();
	bool ExecuteInstantFeedback(class AActor* InteractPawn_0);
	void ExecuteUbergraph_BP_Interact_Pickup(int32 EntryPoint);
	class FString GetDebugTriggerInfo();
	class FString GetDebugTriggerTitle();
	struct FVector GetHintLocationBP();
	void GetPickupClassID(class FName* PickupID);
	class FText GetPromptTextBP();
	void HandleConditionHandler();
	void HandleOnPickup();
	void HandlePickupFail();
	void HandlePickupSuccess();
	void HideMe();
	void IsAlreadyPickup(bool* Exist);
	void NeedShowReplaceConsumableUI(bool* OutValue);
	void NeedShowReplaceWeaponUI(bool* OutValue);
	void OnReplaceConsumableUIEnd(bool IsSuccess, class FName InConsumableID);
	void OnReplaceWeaponUIEnd(bool IsSuccess, bool IsEquippedWeapon, class FName InWeaponID);
	void PrepareToDestroy();
	void PrepareToSetupClass();
	void ReceiveBeginPlay();
	void ResizeTriggerbox(class UBoxComponent* InBox, class UBoxComponent* InHintBox);
	void ShowMe();
	void ShowReplaceConsumableUI();
	void ShowReplaceWeapon();
	void SwapPickupChild(TSubclassOf<class AActor> InClass);
	void TryDestroy();
	void UpdateIconPosition();
	void UpdatePickupClass();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Interact_Pickup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Interact_Pickup_C")
	}
	static class ABP_Interact_Pickup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interact_Pickup_C>();
	}
};
DUMPER7_ASSERTS_ABP_Interact_Pickup_C;

}

