#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LineOfSight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LineOfSight.BP_LineOfSight_C
// 0x0020 (0x02D0 - 0x02B0)
class ABP_LineOfSight_C final : public ANoceLineOfSightActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        SceneFadeOffset;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDrawSceneFade;                                // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceCheatManager*                      NoceCheatManager;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateSceneFadeMPC();
	void SetEnable(bool InValue);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_LineOfSight(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LineOfSight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LineOfSight_C")
	}
	static class ABP_LineOfSight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LineOfSight_C>();
	}
};
DUMPER7_ASSERTS_ABP_LineOfSight_C;

}

