#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LockCharComponent_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameNoce_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LockCharComponent_Base.BP_LockCharComponent_Base_C
// 0x0110 (0x06F0 - 0x05E0)
class UBP_LockCharComponent_Base_C final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<int32>                                 IndexList;                                         // 0x05E8(0x0010)(Edit, BlueprintVisible)
	TMap<ENoceRiddleLevel, int32>                 CorrectAnswers;                                    // 0x05F8(0x0050)(Edit, BlueprintVisible)
	int32                                         CorrectAnswer;                                     // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInstance>       MaterialInstance;                                  // 0x0650(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        BlendDuration;                                     // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotateValue;                                       // 0x0680(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BlendTimer;                                        // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendAlpha;                                        // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               TargetRotator;                                     // 0x06B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsShowDebugInfo;                                   // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FlickerSpeed;                                      // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FlickerTime;                                       // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFocus;                                           // 0x06E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanShowFocusEffect;                                // 0x06E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateRotation(double DeltaTime);
	void UpdateMaterial();
	void UpdateFlicker(double DeltaTime);
	void UpdateCurrentAnswer();
	void UpdateCorrectAnswers(const TMap<ENoceRiddleLevel, int32>& CorrectAnswers_0);
	void SubtractCurrentIndex();
	void ShowFocusEffect(bool ShowEffect);
	void ShowDebugInfo();
	void SetFocus(bool IsFocus_0);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_LockCharComponent_Base(int32 EntryPoint);
	void CheckAnswer(bool* IsCorrect);
	void AddCurrentIndex();
	void MoveToPrevious();
	void MoveToNext();
	void HandleOnRecordLoaded();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LockCharComponent_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LockCharComponent_Base_C")
	}
	static class UBP_LockCharComponent_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LockCharComponent_Base_C>();
	}
};
DUMPER7_ASSERTS_UBP_LockCharComponent_Base_C;

}

