#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MultiRummage_Base

#include "Basic.hpp"

#include "BP_Rummage_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MultiRummage_Base.BP_MultiRummage_Base_C
// 0x00C0 (0x1000 - 0x0F40)
class ABP_MultiRummage_Base_C : public ABP_Rummage_Base_C
{
public:
	uint8                                         Pad_F37[0x1];                                      // 0x0F37(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MultiRummage_Base_C;             // 0x0F38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UBP_RummageTargetComponent_C*>   ChildRummage;                                      // 0x0F40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UBP_RummageTargetComponent_C*           CurrentTarget;                                     // 0x0F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HasUsable;                                         // 0x0F58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOwnerHintLocation;                              // 0x0F59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5A[0x6];                                      // 0x0F5A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, bool>                             DrawerStatusMap;                                   // 0x0F60(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TMap<int32, bool>                             DrawerItemPickedUpMap;                             // 0x0FB0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)

public:
	void Audio_Set_Gimmick_State_False();
	void Audio_SetGimmickStateTrue();
	void CanCompeteGimmick(bool* Output);
	bool CanInteractWithPawnBP(class AActor* InteractorPawn);
	void ExecuteUbergraph_BP_MultiRummage_Base(int32 EntryPoint);
	void ExtraPerform();
	struct FVector GetHintLocationBP();
	void HandleSaveStatus();
	void OnDrawerItemPickedUp(class UBP_RummageTargetComponent_C* Source);
	void OnDrawerPickupSpawned(class ABP_Interact_Pickup_C* InItem);
	void OnExtraPerformEnd();
	void OnPerformTimeEnd(class UBP_RummageTargetComponent_C* Source);
	void PerformRummage();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetupPickups();
	void SpawnTargetStuff();
	void UpdateCurrent();
	void UpdateDrawerSaveData();
	void UpdateUsable();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MultiRummage_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MultiRummage_Base_C")
	}
	static class ABP_MultiRummage_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MultiRummage_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_MultiRummage_Base_C;

}

