#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MultiRummage_Cabinet_004

#include "Basic.hpp"

#include "BP_MultiRummage_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MultiRummage_Cabinet_004.BP_MultiRummage_Cabinet_004_C
// 0x0060 (0x1060 - 0x1000)
class ABP_MultiRummage_Cabinet_004_C final : public ABP_MultiRummage_Base_C
{
public:
	class UNocePlayerLookAtTargetComponent*       NocePlayerLookAtTarget1;                           // 0x1000(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerLookAtTargetComponent*       NocePlayerLookAtTarget;                            // 0x1008(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ECol;                                              // 0x1010(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Hint_c;                                            // 0x1018(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Hint_b;                                            // 0x1020(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ItemLocation_b;                                    // 0x1028(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ItemLocation_c;                                    // 0x1030(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_b;                                      // 0x1038(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RummageTargetComponent_C*           Rummage_Ab;                                        // 0x1040(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_c;                                      // 0x1048(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CabinetBody;                                       // 0x1050(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RummageTargetComponent_C*           Rummage_Ac;                                        // 0x1058(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MultiRummage_Cabinet_004_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MultiRummage_Cabinet_004_C")
	}
	static class ABP_MultiRummage_Cabinet_004_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MultiRummage_Cabinet_004_C>();
	}
};
DUMPER7_ASSERTS_ABP_MultiRummage_Cabinet_004_C;

}

