#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceSkyLightHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameNoce_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoceSkyLightHelper.BP_NoceSkyLightHelper_C
// 0x0098 (0x0138 - 0x00A0)
class UBP_NoceSkyLightHelper_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkyLightComponent*                     TargetSkyLight;                                    // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FNoceSkyLightSetting                   SkyLightData;                                      // 0x00B0(0x0068)(Edit, BlueprintVisible)
	struct FDataTableRowHandle                    SkyLightDataTableHandle;                           // 0x0118(0x0010)(Edit, BlueprintVisible, NoDestructor)
	double                                        DebugPriority;                                     // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LastDebugRowName;                                  // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyDataToComponent();
	void ExecuteUbergraph_BP_NoceSkyLightHelper(int32 EntryPoint);
	void GetDataFromComponent();
	void RecaptureSky();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TryGetComponent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoceSkyLightHelper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoceSkyLightHelper_C")
	}
	static class UBP_NoceSkyLightHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NoceSkyLightHelper_C>();
	}
};
DUMPER7_ASSERTS_UBP_NoceSkyLightHelper_C;

}

