#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceFootStepVFXComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoceFootStepVFXComponent.BP_NoceFootStepVFXComponent_C
// 0x0070 (0x0110 - 0x00A0)
class UBP_NoceFootStepVFXComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNoceFootStepVFXDataAsset*              FootStepVFXDataAsset;                              // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   QueryGameplayTags;                                 // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Owner;                                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNoceCheatManager*                      NoceCheatManager;                                  // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DebugDurationTime;                                 // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        LoadedObjects;                                     // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSoftObjectPath                        DebugAxisVFX;                                      // 0x00F0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AsyncLoadAssetObject(const struct FSoftObjectPath& InSoftObjectPath);
	void AsyncLoadedAssets();
	void ExecuteUbergraph_BP_NoceFootStepVFXComponent(int32 EntryPoint);
	void OnLoaded_A18A41DE4CBEA0EB6EF623B491495645(class UObject* Loaded);
	void PlayVFX(EPhysicalSurface InSurfaceType, const struct FVector& InHitLocation, const struct FVector& InHitNormal);
	void ReceiveBeginPlay();
	void ShowDebugVFX(const struct FVector& InLocation, const struct FRotator& InRotation);
	void SpawnVFX(EPhysicalSurface InPhysicalSurface, const struct FNoceFootStepVFXUnit& InUnit, const struct FVector& InHitLocation, const struct FVector& InHitNormal);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoceFootStepVFXComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoceFootStepVFXComponent_C")
	}
	static class UBP_NoceFootStepVFXComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NoceFootStepVFXComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_NoceFootStepVFXComponent_C;

}

