#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcBase_NoceNpcCharacter

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.CheckHideMeshWhenOverlapCamera
// 0x0170 (0x0170 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_CheckHideMeshWhenOverlapCamera final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPlayerCameraLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_SphereTraceComponent_HitLocation;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_SphereTraceComponent_HitNormal;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_SphereTraceComponent_BoneName;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SphereTraceComponent_OutHit;           // 0x0070(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SphereTraceComponent_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_CheckHideMeshWhenOverlapCamera;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.ExecuteUbergraph_BP_NpcBase_NoceNpcCharacter
// 0x03A0 (0x03A0 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_ExecuteUbergraph_BP_NpcBase_NoceNpcCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Duration;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Dilation;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Event_Anim;                                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsStrafe_1;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_FocusActor;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsStrafe;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_FocusLoc;                             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Modifier;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_BaseSpeed_1;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Offset;                               // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InEnable;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_AudioTriggerName;                     // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceAttackHitResult                   K2Node_Event_NoceHitResult;                        // 0x0088(0x0178)(NoDestructor, ContainsInstancedReference)
	ENoceWinceType                                K2Node_Event_WinceType;                            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceAIFaceToTargetInfo                K2Node_Event_Info;                                 // 0x0208(0x0028)(NoDestructor)
	class FName                                   K2Node_Event_PatternName_1;                        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_BaseSpeed;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANoceCharacter*                         K2Node_Event_LinkTarget;                           // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ExAbilityName;                        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PatternName;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Parameter;                            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_HopeNotMove;                          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_Event_In;                                   // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enable;                               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TurnTarget;                     // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02A0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindRelativeLookAtRotation_ReturnValue;   // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_NpcBase_C*                         K2Node_DynamicCast_AsABP_Npc_Base;                 // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       K2Node_Event_SplineComp;                           // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UABP_NpcBase_C*                         K2Node_DynamicCast_AsABP_Npc_Base_1;               // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANoceCharacter*                         K2Node_Event_Character;                            // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Significance;                         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_TurnYaw_ImplicitCast;           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_ExecuteUbergraph_BP_NpcBase_NoceNpcCharacter;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.GetCurrentWeapon
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_GetCurrentWeapon final
{
public:
	class ANoceWeapon*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_GetCurrentWeapon;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.Handle Optimization Mode
// 0x0050 (0x0050 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_Handle_Optimization_Mode final
{
public:
	bool                                          Start_Optimization;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DefaultGravity_ImplicitCast;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_GravityScale_ImplicitCast;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_Handle_Optimization_Mode;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.HandleHideMesh
// 0x0028 (0x0028 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_HandleHideMesh final
{
public:
	bool                                          InHide;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetHair_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetHead_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_HandleHideMesh;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_ApplySplineTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_ApplySplineTarget final
{
public:
	class USplineComponent*                       SplineComp;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_ApplySplineTarget;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_CanFollowSpline
// 0x0002 (0x0002 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_CanFollowSpline final
{
public:
	bool                                          FollowSpline;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_CanFollowSpline;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_CustomEvent final
{
public:
	class FName                                   PatternName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Parameter;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_CustomEvent;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_DebugBeahivourRemoveComp
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_DebugBeahivourRemoveComp final
{
public:
	class UActorComponent*                        In;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_DebugBeahivourRemoveComp;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEMBase_EnableMeshCollisionToPlayer
// 0x0001 (0x0001 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEMBase_EnableMeshCollisionToPlayer final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEMBase_EnableMeshCollisionToPlayer;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetCurBaseMovementSpeed
// 0x0010 (0x0010 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetCurBaseMovementSpeed final
{
public:
	double                                        BaseSpeed;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_BaseSpeed_ImplicitCast;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetCurBaseMovementSpeed;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetDefaultCapusleSetting
// 0x0068 (0x0068 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetDefaultCapusleSetting final
{
public:
	double                                        Radius;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HalfHeight;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<ECollisionChannel, ECollisionResponse>   Response;                                          // 0x0010(0x0050)(Parm, OutParm)
	ECollisionChannel                             ObjectType;                                        // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetDefaultCapusleSetting;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetDefaultSpawnMontage
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetDefaultSpawnMontage final
{
public:
	class UAnimMontage*                           SpawnMontage;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetDefaultSpawnMontage;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetIsCurrentOptimized
// 0x0001 (0x0001 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetIsCurrentOptimized final
{
public:
	bool                                          Bool;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetIsCurrentOptimized;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetIsStrafe
// 0x0001 (0x0001 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetIsStrafe final
{
public:
	bool                                          IsStrafe;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetIsStrafe;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetLocoTurnMontage
// 0x0010 (0x0010 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetLocoTurnMontage final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           outMTG;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetLocoTurnMontage;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetPivotTurnMontage
// 0x0030 (0x0030 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetPivotTurnMontage final
{
public:
	double                                        QuickTurnDegree;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LongTurnDegree;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLoc;                                         // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           TurnMontage;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetPivotTurnMontage;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetSplineTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetSplineTarget final
{
public:
	class USplineComponent*                       SplineComp;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetSplineTarget;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetStrafeDirectionMontage
// 0x0010 (0x0010 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetStrafeDirectionMontage final
{
public:
	ENoceHitReactionFourWayType                   Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetStrafeDirectionMontage;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_GetUsedNavData
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetUsedNavData final
{
public:
	class ARecastNavMesh*                         NavData;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_GetUsedNavData;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_HandleDialogWhenDamaged
// 0x0001 (0x0001 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_HandleDialogWhenDamaged final
{
public:
	ENoceWinceType                                WinceType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_HandleDialogWhenDamaged;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_HandleHitByFriend
// 0x0178 (0x0178 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_HandleHitByFriend final
{
public:
	struct FNoceAttackHitResult                   NoceHitResult;                                     // 0x0000(0x0178)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_HandleHitByFriend;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_HandleSpawnerTeleportEvent
// 0x0038 (0x0038 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_HandleSpawnerTeleportEvent final
{
public:
	struct FVector                                DestLocation;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DestRoration;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_HandleSpawnerTeleportEvent;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_IsInPlayerCamDirection
// 0x0001 (0x0001 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_IsInPlayerCamDirection final
{
public:
	bool                                          Bool;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_IsInPlayerCamDirection;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_IsPauseFollowSpline
// 0x0001 (0x0001 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_IsPauseFollowSpline final
{
public:
	bool                                          Pause;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_IsPauseFollowSpline;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_OverrideLocoBaseSpeed
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_OverrideLocoBaseSpeed final
{
public:
	double                                        BaseSpeed;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_OverrideLocoBaseSpeed;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_PlayMontageFromAnimBank
// 0x0010 (0x0010 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_PlayMontageFromAnimBank final
{
public:
	int32                                         BankID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MotionID;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        duration;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_PlayMontageFromAnimBank;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_RandomFient
// 0x0018 (0x0018 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_RandomFient final
{
public:
	double                                        duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Dilation;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Anim;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_RandomFient;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_SendAudioTrigger
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_SendAudioTrigger final
{
public:
	class FName                                   AudioTriggerName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_SendAudioTrigger;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_SetEnableLookAt
// 0x0048 (0x0048 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetEnableLookAt final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceAILookAtSetting                   LookAtSetting;                                     // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LookAtTarget;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetEnableLookAt;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_SetFaceToTargetInfo
// 0x0028 (0x0028 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetFaceToTargetInfo final
{
public:
	struct FNoceAIFaceToTargetInfo                Info;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetFaceToTargetInfo;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_SetFocusActor
// 0x0010 (0x0010 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetFocusActor final
{
public:
	bool                                          IsStrafe;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 FocusActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetFocusActor;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_SetFocusPoint
// 0x0020 (0x0020 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetFocusPoint final
{
public:
	bool                                          IsStrafe;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FocusLoc;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetFocusPoint;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_SetHopeNotMove
// 0x0001 (0x0001 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetHopeNotMove final
{
public:
	bool                                          HopeNotMove;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetHopeNotMove;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_SetMaxLookDistance
// 0x0018 (0x0018 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetMaxLookDistance final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxLookDistance;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetUseMaxLookDistance_InMaxDistance_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_SetMaxLookDistance;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_ShootProjectile
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_ShootProjectile final
{
public:
	class FName                                   PatternName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_ShootProjectile;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_TriggerLinkAbility
// 0x0010 (0x0010 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_TriggerLinkAbility final
{
public:
	class ANoceCharacter*                         LinkTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ExAbilityName;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_TriggerLinkAbility;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_UpdateBaseMovementSpeed
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_UpdateBaseMovementSpeed final
{
public:
	double                                        BaseSpeed;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_UpdateBaseMovementSpeed;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_UpdateLocomotionOffset
// 0x0018 (0x0018 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_UpdateLocomotionOffset final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_UpdateLocomotionOffset;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.IEmBase_UpdateModifiedMovementSpeed
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_IEmBase_UpdateModifiedMovementSpeed final
{
public:
	double                                        Modifier;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_IEmBase_UpdateModifiedMovementSpeed;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.OnPostSignificance
// 0x0010 (0x0010 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_OnPostSignificance final
{
public:
	class ANoceCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Significance;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_OnPostSignificance;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_ReceiveTick;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.SetupHideMeshWhenOverlapCamera
// 0x0040 (0x0040 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_SetupHideMeshWhenOverlapCamera final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      K2Node_DynamicCast_AsCapsule_Collision;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_SetupHideMeshWhenOverlapCamera;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.SwitchToRunSpeed
// 0x0001 (0x0001 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_SwitchToRunSpeed final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_SwitchToRunSpeed;

// Function BP_NpcBase_NoceNpcCharacter.BP_NpcBase_NoceNpcCharacter_C.TurnToTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcBase_NoceNpcCharacter_C_TurnToTarget final
{
public:
	class AActor*                                 TurnTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NpcBase_NoceNpcCharacter_C_TurnToTarget;

}

