#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NotebookWorld

#include "Basic.hpp"

#include "NeoAudio_structs.hpp"
#include "GameNoce_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NotebookWorld.BP_NotebookWorld_C
// 0x01B8 (0x0460 - 0x02A8)
class ABP_NotebookWorld_C final : public ASceneCapture2D
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Fill;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Key;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight_TipFill;                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioSoundComponent*                NeoAudioSound;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Notebook;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       LeftPageMaterials;                                 // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       RightPageMaterials;                                // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentIndex;                                      // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPreviousIndex;                              // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenPlayRate;                                      // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnPagePlayRate;                                  // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChangeCategoryPlayRate;                            // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceNotebookPage*                      LeftWidget;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceNotebookPage*                      RightWidget;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceNotebookPage*                      PreviousLeftWidget;                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceNotebookPage*                      PreviousRightWidget;                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayingAnimation;                                // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNoceUINotebookAnimCacheData>   CachedAnimationData;                               // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         FastPlayRate;                                      // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentPlayRate;                                   // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               Audio_OpenBook;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FNeoAudioTriggerIdHandle               Audio_TurnPages;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FName                                   BaseColorTexName;                                  // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RoughTexName;                                      // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UITextName;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NormalTexName;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           LeftFrontSockets;                                  // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           RightFrontSockets;                                 // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           LeftBackSockets;                                   // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           RightBackSockets;                                  // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceUINotebookPageTextureData> PageTextures;                                      // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         DefaultLeftPageIndex;                              // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultRightPageIndex;                             // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousLeftTextureIndex;                          // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_SK_Env_Base_NoteBook_000_A_C*      BookAnimInstance;                                  // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<ENoceNotebookBookmarkType, class ANoceNotebookBookmark*> Bookmarks;                         // 0x03F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ANoceNotebookBookmark*                  CurrentBookmark;                                   // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedBookmark;                                      // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceNotebookBookmarkType                     CurrentBookmarkType;                               // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceNotebookBookmarkSocketType               CurrentSocketType;                                 // 0x044A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTurnPage;                                        // 0x044B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 Index)>   UpdatePageText;                                    // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ChangeCategory(bool IsLeft);
	void Clear();
	void ClearAllTextures();
	void ClearBookmarks();
	void ClearTexture(bool IsLeft, bool IsPrevious);
	void ClearWidgets();
	void CreateAllMaterialInstances();
	void CreateBookmark(ENoceNotebookBookmarkType Type, class UStaticMesh* Mesh);
	void CreateMaterialInstance(class FName MaterialSlotName, bool IsLeft);
	void DrawSingleWidget(bool ForceDraw, class UNoceNotebookPage* Widget, class UTextureRenderTarget2D* RenderTarget);
	void DrawWidgetRT(bool ForceDraw);
	void ExecuteUbergraph_BP_NotebookWorld(int32 EntryPoint);
	void GetBookmark(ENoceNotebookBookmarkType Type, class ANoceNotebookBookmark** BookMark);
	void GetPageTextures(int32 Index_0, class UTexture2D** BaseColorTexture, class UTexture2D** RoughTexture, class UTexture2D** NormalTexture);
	void HandleNotify(class FName Name_0);
	bool IsPlayingAnimations();
	void OnBlendOut_357893554A0ED3A0991727839D1441FD(class FName NotifyName);
	void OnBlendOut_63F53CDC4A2801684B2497BAF934242A(class FName NotifyName);
	void OnBlendOut_D59901D642AA74B369ECA0B1E9BBE268(class FName NotifyName);
	void OnBookmarkDeactivated(class ANoceNotebookBookmark* DestroyedActor);
	void OnCompleted_357893554A0ED3A0991727839D1441FD(class FName NotifyName);
	void OnCompleted_63F53CDC4A2801684B2497BAF934242A(class FName NotifyName);
	void OnCompleted_D59901D642AA74B369ECA0B1E9BBE268(class FName NotifyName);
	void OnInterrupted_357893554A0ED3A0991727839D1441FD(class FName NotifyName);
	void OnInterrupted_63F53CDC4A2801684B2497BAF934242A(class FName NotifyName);
	void OnInterrupted_D59901D642AA74B369ECA0B1E9BBE268(class FName NotifyName);
	void OnNotifyBegin_357893554A0ED3A0991727839D1441FD(class FName NotifyName);
	void OnNotifyBegin_63F53CDC4A2801684B2497BAF934242A(class FName NotifyName);
	void OnNotifyBegin_D59901D642AA74B369ECA0B1E9BBE268(class FName NotifyName);
	void OnNotifyEnd_357893554A0ED3A0991727839D1441FD(class FName NotifyName);
	void OnNotifyEnd_63F53CDC4A2801684B2497BAF934242A(class FName NotifyName);
	void OnNotifyEnd_D59901D642AA74B369ECA0B1E9BBE268(class FName NotifyName);
	void Open();
	void PlayCachedAnimation();
	void PlayChangeCategory(bool IsLeft, float PlayRate);
	void PlayTurnPage(bool IsLeft, float PlayRate);
	void ReceiveBeginPlay();
	void SetAnimationPlayRate(float NewPlayRate);
	void SetPageText(int32 InIndex);
	void SetPageTextures(class UMaterialInstanceDynamic* Material, int32 BaseColorTexIndex);
	void SetupBookmarkSocket(class ANoceNotebookBookmark* BookMark, ENoceNotebookBookmarkSocketType SocketType);
	void SetVSMCacheEnable(bool Enable);
	void SetWidget(bool IsLeft, class UNoceNotebookPage* InWidget);
	void StopAnimations();
	void SwitchPreviousPages();
	void TurnPage(bool IsLeft);
	void UpdateBookmarks(ENoceNotebookBookmarkType BookmarkType, ENoceNotebookBookmarkSocketType SocketType);
	void UpdateBookmarksInternal(ENoceNotebookBookmarkType BookmarkType, ENoceNotebookBookmarkSocketType SocketType);
	void UpdateRenderTexture();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NotebookWorld_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NotebookWorld_C")
	}
	static class ABP_NotebookWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NotebookWorld_C>();
	}
};
DUMPER7_ASSERTS_ABP_NotebookWorld_C;

}

