#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceTutorialInstructor_CheckPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NoceTutorialInstructor_CheckPoint.BP_NoceTutorialInstructor_CheckPoint_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceTutorialInstructor_CheckPoint_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceTutorialInstructor_CheckPoint_C_ReceiveEndPlay;

// Function BP_NoceTutorialInstructor_CheckPoint.BP_NoceTutorialInstructor_CheckPoint_C.OnCheckPointSave
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceTutorialInstructor_CheckPoint_C_OnCheckPointSave final
{
public:
	bool                                          IsAutoSave;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceTutorialInstructor_CheckPoint_C_OnCheckPointSave;

// Function BP_NoceTutorialInstructor_CheckPoint.BP_NoceTutorialInstructor_CheckPoint_C.ExecuteUbergraph_BP_NoceTutorialInstructor_CheckPoint
// 0x0028 (0x0028 - 0x0000)
struct BP_NoceTutorialInstructor_CheckPoint_C_ExecuteUbergraph_BP_NoceTutorialInstructor_CheckPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsAutoSave)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceSaveSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceTutorialInstructor_CheckPoint_C_ExecuteUbergraph_BP_NoceTutorialInstructor_CheckPoint;

}

