#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceDebugCameraController

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NoceDebugCameraController.BP_NoceDebugCameraController_C.ReceiveOnDeactivate
// 0x0008 (0x0008 - 0x0000)
struct BP_NoceDebugCameraController_C_ReceiveOnDeactivate final
{
public:
	class APlayerController*                      RestoredPC;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceDebugCameraController_C_ReceiveOnDeactivate;

// Function BP_NoceDebugCameraController.BP_NoceDebugCameraController_C.ExecuteUbergraph_BP_NoceDebugCameraController
// 0x0028 (0x0028 - 0x0000)
struct BP_NoceDebugCameraController_C_ExecuteUbergraph_BP_NoceDebugCameraController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_RestoredPC;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceWorldManagerSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANocePlayerState*                       CallFunc_GetNocePlayerState_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceDebugCameraController_C_ExecuteUbergraph_BP_NoceDebugCameraController;

}

