#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceTutorialInstructor_ToySaber

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NoceTutorialInstructor_ToySaber.BP_NoceTutorialInstructor_ToySaber_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceTutorialInstructor_ToySaber_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceTutorialInstructor_ToySaber_C_ReceiveEndPlay;

// Function BP_NoceTutorialInstructor_ToySaber.BP_NoceTutorialInstructor_ToySaber_C.IsStartCondition
// 0x0028 (0x0028 - 0x0000)
struct BP_NoceTutorialInstructor_ToySaber_C_IsStartCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ID)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartCondition_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerState*                       CallFunc_GetNocePlayerState_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceTutorialInstructor_ToySaber_C_IsStartCondition;

// Function BP_NoceTutorialInstructor_ToySaber.BP_NoceTutorialInstructor_ToySaber_C.IsCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceTutorialInstructor_ToySaber_C_IsCompleteCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceTutorialInstructor_ToySaber_C_IsCompleteCondition;

// Function BP_NoceTutorialInstructor_ToySaber.BP_NoceTutorialInstructor_ToySaber_C.ExecuteUbergraph_BP_NoceTutorialInstructor_ToySaber
// 0x0028 (0x0028 - 0x0000)
struct BP_NoceTutorialInstructor_ToySaber_C_ExecuteUbergraph_BP_NoceTutorialInstructor_ToySaber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ID)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerState*                       CallFunc_GetNocePlayerState_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceTutorialInstructor_ToySaber_C_ExecuteUbergraph_BP_NoceTutorialInstructor_ToySaber;

// Function BP_NoceTutorialInstructor_ToySaber.BP_NoceTutorialInstructor_ToySaber_C.BP_NoceTutorialInstructor_scyche_AutoGenFunc
// 0x000C (0x000C - 0x0000)
struct BP_NoceTutorialInstructor_ToySaber_C_BP_NoceTutorialInstructor_scyche_AutoGenFunc final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceTutorialInstructor_ToySaber_C_BP_NoceTutorialInstructor_scyche_AutoGenFunc;

}

