#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NocePostProcessManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NocePostProcessManager.BP_NocePostProcessManager_C
// 0x0390 (0x0620 - 0x0290)
class ABP_NocePostProcessManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess_ShiromukuRevive_V4;                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess_ShiromukuRevive_V2;                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess_ShiromukuRevive_V3;                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_EndCounterableHint_OutValue_4868C51C4533FD2DFFE499A171AEE3BB; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_EndCounterableHint__Direction_4868C51C4533FD2DFFE499A171AEE3BB; // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_EndCounterableHint;                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_StartCounterableHint_JitterScaleRatio_C2311E6E4D87CF817BCD6C89EBD42B0A; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_StartCounterableHint__Direction_C2311E6E4D87CF817BCD6C89EBD42B0A; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_StartCounterableHint;                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_EndHPWarnings_OutValue_9539E8074C8DC2461300A5B931F0FFF5; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_EndHPWarnings__Direction_9539E8074C8DC2461300A5B931F0FFF5; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_EndHPWarnings;                            // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_StartHPWarnings_FirstValue_1_0_0B0E599645851FC95CA5A890FC9B397B; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_StartHPWarnings_OutValue_0B0E599645851FC95CA5A890FC9B397B; // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_StartHPWarnings__Direction_0B0E599645851FC95CA5A890FC9B397B; // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_StartHPWarnings;                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_ShiroRevive2EnterAtk_DaggerCurve_E06FD302403DACE038538D80B81B6896; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_ShiroRevive2EnterAtk_AxeCurve_E06FD302403DACE038538D80B81B6896; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_ShiroRevive2EnterAtk_PipeCurve_E06FD302403DACE038538D80B81B6896; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_ShiroRevive2EnterAtk__Direction_E06FD302403DACE038538D80B81B6896; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_ShiroRevive2EnterAtk;                           // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_ShiroPlayerRevive2Update_NewTrack_0_014A71D94FCF6EF7F1C9DBA7FC4338ED; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_ShiroPlayerRevive2Update__Direction_014A71D94FCF6EF7F1C9DBA7FC4338ED; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_ShiroPlayerRevive2Update;                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_BreadDown_Drop_Activate_9D7DA25B4233A48D172155B2FE5E4A2C; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_BreadDown_Drop__Direction_9D7DA25B4233A48D172155B2FE5E4A2C; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_BreadDown_Drop;                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_JustDodge_Activate_F20C8AB24BE14A4518470BB2251DDA65; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_JustDodge__Direction_F20C8AB24BE14A4518470BB2251DDA65; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_JustDodge;                                // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_BreakDown_Alpha_Activate_46F89B8C4B0D1F7092E9D7AD40AF6A00; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_BreakDown_Alpha__Direction_46F89B8C4B0D1F7092E9D7AD40AF6A00; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_BreakDown_Alpha;                          // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_BreakDown_Blend_Activate_A313447040BD2982E4FC9FB4F53B25FF; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_BreakDown_Blend__Direction_A313447040BD2982E4FC9FB4F53B25FF; // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_BreakDown_Blend;                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_HellModeSpiritAttack_Activate_EC4BD8AD4D51AA86DEF6188F3B5A993E; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_HellModeSpiritAttack__Direction_EC4BD8AD4D51AA86DEF6188F3B5A993E; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_HellModeSpiritAttack;                     // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_FocusFOV_Alpha_FEF3EF054D8B3948F45ECFA6E4AE3C5D; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_FocusFOV__Direction_FEF3EF054D8B3948F45ECFA6E4AE3C5D; // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_FocusFOV;                                 // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_SanityWeak_DizzyActivate_753BC0884A5B6723812970847C2E4605; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_SanityWeak__Direction_753BC0884A5B6723812970847C2E4605; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_SanityWeak;                               // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_SanityFocus_Activate_C2F9B14948AB5F9505BF6089769AE116; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_SanityFocus__Direction_C2F9B14948AB5F9505BF6089769AE116; // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_SanityFocus;                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        M_PP_SanityFocus_Ref;                              // 0x03A8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterial*                              M_PP_SanityFocus;                                  // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PP_SanityFocus;                                // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       ActiveCameraComponent;                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        M_PP_SanityWeak_Ref;                               // 0x03E0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterial*                              M_PP_SanityWeak;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PP_SanityWeak;                                 // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        FieldOfViewOriginal;                               // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FieldOfViewFocusRatio;                             // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        M_PP_HellModeSpiritAttack_Ref;                     // 0x0420(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterial*                              M_PP_HellModeSpiritAttack;                         // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PP_HellModeSpiritAttack;                       // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayingHellModeSpiritAttack;                       // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HellModeSpiritAttackTime;                          // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HellModeSpiritAttackTimerHandle;                   // 0x0458(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        M_PP_BreakDown_Ref;                                // 0x0460(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      M_PP_BreakDown;                                    // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PP_BreakDown;                                  // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayingBreakDown;                                  // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        M_PP_JustDodge_Ref;                                // 0x0498(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterial*                              M_PP_JustDodge;                                    // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PP_JustDodge;                                  // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ShiromukuReviveIndex;                              // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        M_PP_ShiromukuRevive1_Ref;                         // 0x04D0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterial*                              M_PP_ShiromukuRevive1;                             // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PP_ShiromukuRevive1;                           // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PP_ShiromukuRevive2;                               // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        MI_PP_ShiromukuRevive_V2_Ref;                      // 0x0508(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        MI_PP_ShiromukuRevive_V3_Ref;                      // 0x0528(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        MI_PP_ShiromukuRevive_V4_Ref;                      // 0x0548(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        ShiroRevive2StrengthBase;                          // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShiroRevive2Strength_Pipe;                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShiroRevive2Strength_Add;                          // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShiroRevive2Strength_Axe;                          // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShiroRevive2Strength_Dagger;                       // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        M_PP_HPWarnings_Ref;                               // 0x0590(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterial*                              M_PP_HPWarnings;                                   // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PP_HPWarnings;                                 // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsingHpWarnings;                                 // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndHPWarningsDuringLink;                           // 0x05C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2[0x6];                                      // 0x05C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UATPCCameraComponent*                   ATPCCamera;                                        // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          InCineCamera;                                      // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      GhostEffect;                                       // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar;                                            // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        MI_PP_CounterableHint_Ref;                         // 0x05E8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      MI_PP_CounterableHInt;                             // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_PP_CounterableHint;                            // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CounterableHintCount;                              // 0x0618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TL_ShiroRevive2EnterAtk__UpdateFunc();
	void TL_ShiroRevive2EnterAtk__FinishedFunc();
	void TL_ShiroPlayerRevive2Update__UpdateFunc();
	void TL_ShiroPlayerRevive2Update__FinishedFunc();
	void Timeline_StartHPWarnings__UpdateFunc();
	void Timeline_StartHPWarnings__FinishedFunc();
	void Timeline_StartCounterableHint__UpdateFunc();
	void Timeline_StartCounterableHint__FinishedFunc();
	void Timeline_SanityWeak__UpdateFunc();
	void Timeline_SanityWeak__FinishedFunc();
	void Timeline_SanityFocus__UpdateFunc();
	void Timeline_SanityFocus__FinishedFunc();
	void Timeline_JustDodge__UpdateFunc();
	void Timeline_JustDodge__FinishedFunc();
	void Timeline_HellModeSpiritAttack__UpdateFunc();
	void Timeline_HellModeSpiritAttack__FinishedFunc();
	void Timeline_FocusFOV__UpdateFunc();
	void Timeline_FocusFOV__FinishedFunc();
	void Timeline_EndHPWarnings__UpdateFunc();
	void Timeline_EndHPWarnings__FinishedFunc();
	void Timeline_EndCounterableHint__UpdateFunc();
	void Timeline_EndCounterableHint__FinishedFunc();
	void Timeline_BreakDown_Blend__UpdateFunc();
	void Timeline_BreakDown_Blend__FinishedFunc();
	void Timeline_BreakDown_Alpha__UpdateFunc();
	void Timeline_BreakDown_Alpha__FinishedFunc();
	void Timeline_BreadDown_Drop__UpdateFunc();
	void Timeline_BreadDown_Drop__FinishedFunc();
	void StartHPWarningsProcess(bool InSourceFormEvent);
	void StartHPWarnings(double InPlayTime, bool InSourceFormEvent);
	void StartCounterableHintProcess();
	void StartCounterableHint(double InAlpha, double InBlend, double InJitterScale, double InJitterSpeed, double InOverlayColor_ColorShiftBlend, double InOverlayColorRatio, const struct FLinearColor& InOverlapColor);
	void ShiroRevive2WepCurveSelect(class FName Wep, class FName ComboState, double* OutCruve);
	void ShiroPlayerRevive2OnAtk(class FName WeaponName, class FName StateName);
	void ShiromukuRevive4Progress();
	void ShiromukuRevive4End();
	void ShiromukuRevive3Progress();
	void ShiromukuRevive3End();
	void ShiromukuRevive2Progress();
	void ShiromukuRevive2End();
	void SetupShiromukuRevive4();
	void SetupShiromukuRevive3();
	void SetupShiromukuRevive2();
	void SetupShiromukuRevive1();
	void SetupSanityWeak();
	void SetupSanityFocus();
	void SetupJustDodge();
	void SetupHPWarnings();
	void SetupHellModeSpiritAttack();
	void SetupCounterableHint();
	void SetupBreakDown();
	void SetupAciveCameraComponent();
	void SetPlayerMeshStencilValue(int32 InStencilValue);
	void SanityWeakEndProcess();
	void SanityWeak(bool InEanble);
	void SanityFocusStartProcess();
	void SanityFocusEndProcess();
	void SanityFocus(bool InEnable);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnUseCineCamera(bool IsUsing);
	void OnPlayerEnterAttackState(class FName InWeaponName, class FName InStateName);
	void JustDodgeProcess();
	void JustDodge();
	void HellModeSpiritAttackStartProcess();
	void HellModeSpiritAttackEndProcess();
	void HellModeSpiritAttack();
	void HandleSwitchPlayer(class ACharacter* InNewPlayer);
	void HandleShiromukuRevive(int32 InValue);
	void HandleCineCameraChanged(bool InEnter);
	void ExecuteUbergraph_BP_NocePostProcessManager(int32 EntryPoint);
	void EndHPWarningsProcess();
	void EndHPWarnings(bool InSourceFormEvent);
	void EndCounterableHintProcess();
	void EndCounterableHint();
	void CreateEffectMaterialInstance(class UMaterial* Material, class UMaterialInstance* MaterialInstance, class UMaterialInstanceDynamic*& Instance);
	void BreakDownProcess();
	void BreakDown();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NocePostProcessManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NocePostProcessManager_C")
	}
	static class ABP_NocePostProcessManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NocePostProcessManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_NocePostProcessManager_C;

}

