#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceTutorialInstructorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoceTutorialInstructorBase.BP_NoceTutorialInstructorBase_C
// 0x0060 (0x0368 - 0x0308)
#pragma pack(push, 0x1)
class alignas(0x08) ABP_NoceTutorialInstructorBase_C : public ANoceTutorialInstructor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ANocePlayerCharacter*                   NocePlayerCharacter;                               // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ANocePlayerController*                  NocePlayerController;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Dialog;                                            // 0x0328(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FSoftClassPath                         HintWidgetPath;                                    // 0x0338(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UNoceGeneralHintWidget*                 HintWidget;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HasNotebookID;                                     // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RequestPlayDialog();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnTutorialTrigger();
	void OnTutorialStart();
	void OnTutorialFinish();
	void OnTutorialClose();
	void OnPossessPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void OnGameModeInitialized();
	void HideHintWedget();
	class UNoceGeneralHintWidget* GetHintWidget();
	void ExecuteUbergraph_BP_NoceTutorialInstructorBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoceTutorialInstructorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoceTutorialInstructorBase_C")
	}
	static class ABP_NoceTutorialInstructorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NoceTutorialInstructorBase_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_NoceTutorialInstructorBase_C;

}

