#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceFogHelperComponent

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoceFogHelperComponent.BP_NoceFogHelperComponent_C
// 0x0100 (0x01A0 - 0x00A0)
class UBP_NoceFogHelperComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UExponentialHeightFogComponent*         FogComponent;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FNoceExpFogSetting                     FogData;                                           // 0x00B0(0x00D8)(Edit, BlueprintVisible)
	struct FDataTableRowHandle                    FogDataTableHandle;                                // 0x0188(0x0010)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Registered;                                        // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyTableDataToComponent();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void GetFogDataFromTable();
	void ApplyFogDataToComponent();
	void GetFogDataFromComponent();
	void ExecuteUbergraph_BP_NoceFogHelperComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoceFogHelperComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoceFogHelperComponent_C")
	}
	static class UBP_NoceFogHelperComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NoceFogHelperComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_NoceFogHelperComponent_C;

}

