#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NocePopWindowTutorialInstructor_BrandPlus

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NocePopWindowTutorialInstructor_BrandPlus.BP_NocePopWindowTutorialInstructor_BrandPlus_C.ExecuteUbergraph_BP_NocePopWindowTutorialInstructor_BrandPlus
// 0x0048 (0x0048 - 0x0000)
struct BP_NocePopWindowTutorialInstructor_BrandPlus_C_ExecuteUbergraph_BP_NocePopWindowTutorialInstructor_BrandPlus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceSaveSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNoceGeneralHintWidget*                 CallFunc_GetHintWidget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceSystemSaveGame*                    CallFunc_GetSystemSaveGame_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTutorialVisibility_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerState*                       CallFunc_GetNocePlayerState_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAllNotebookIDs_OutIDs;                 // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NocePopWindowTutorialInstructor_BrandPlus_C_ExecuteUbergraph_BP_NocePopWindowTutorialInstructor_BrandPlus;

}

