#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceTentacleSubSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoceTentacleSubSystem.BP_NoceTentacleSubSystem_C
// 0x0050 (0x00C8 - 0x0078)
class UBP_NoceTentacleSubSystem_C final : public UNoceTentacleSubsystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class IInterface>                 TentacleInterface;                                 // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ShowErosionTentacle;                               // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableShiroFogSpawner;                             // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableShiroFogEffect;                              // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableNodeDetection;                               // 0x008B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableShiroFogGameOver;                           // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollection*           ErosionCollection;                                 // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ErosionLocationName;                               // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   ErosionRangeName;                                  // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FLinearColor                           CacheErosionLocation;                              // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         CacheErosionRange;                                 // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         MagicErosionValue;                                 // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CachedTentacleObject;                              // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckOneAndOnlyTentacle();
	void Deinitialize_BP();
	void ExecuteUbergraph_BP_NoceTentacleSubSystem(int32 EntryPoint);
	void HandleRequestTentacleLinkMotion(class AActor* RequestActor, class AActor* TargetActor, class FName LinkName);
	void Initialize_BP();
	void IsErosionTentacleActive(bool* ActiveErosionTentacle);
	void OnLoaded_056256D84D71343877EFDF8027DB4401(TSubclassOf<class UObject> Loaded);
	void OnProgressChanged(const struct FGameplayTag& NewTag);
	void OnProgressInit(const struct FGameplayTag& NewTag);
	void OnTentacleExist(bool Value);
	void ReceiveOnPlayerDieEvent();
	void RecordErosionVariable();
	void RegisterGameEvent();
	void RegisterProgressEvent();
	void RequestPreloadTentacleAsset();
	void RequestTentacleDisableBlockCamera();
	void RequestTentacleLink_BP(class AActor* RequestActor, class AActor* TargetActor, class FName LinkName);
	void RestoreErosionVariable();
	void ToggleErosionTentacleDebugFlag();
	void ToggleShowErosionTentacle();
	void UnLoadCachedObject();
	void UnRegisterGameEvent();
	void UnRegisterProgressEvent();
	void WorldBeginPlay_BP();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoceTentacleSubSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoceTentacleSubSystem_C")
	}
	static class UBP_NoceTentacleSubSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NoceTentacleSubSystem_C>();
	}
};
DUMPER7_ASSERTS_UBP_NoceTentacleSubSystem_C;

}

