#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceTitleGameMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NoceBase_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoceTitleGameMode.BP_NoceTitleGameMode_C
// 0x0088 (0x03F8 - 0x0370)
class ABP_NoceTitleGameMode_C final : public ANoceTitleGameMode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UDataLayerAsset*>                TouchedDataLayer;                                  // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          TitleSceneLoaded;                                  // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceEndingType                               TitleSceneEndingType;                              // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x2];                                      // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TitleSceneCorruptionLevel;                         // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioStateSet;                                     // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AudioStateCorruptionLevel;                         // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceEndingType                               AudioStateEndingType;                              // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           StateA;                                            // 0x03A4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StateA1;                                           // 0x03AC(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StateA2;                                           // 0x03B4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StateA3;                                           // 0x03BC(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StateB;                                            // 0x03C4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StateC;                                            // 0x03CC(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StateD;                                            // 0x03D4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          BGMInChunk1;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TitleSceneStreamFinished;                          // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TitleSceneStreamSafetyTimer;                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTitleScene(ENoceEndingType EndingType, int32 CorruptLevel);
	void UpdateDataLayers(ENoceEndingType InEndingType, int32 InCorruptionLevel);
	void UpdateAudioState(ENoceEndingType InEndingType, int32 InCorruptionLevel);
	void TryOpenMainMenu();
	void SetDataLayerState(TArray<class UDataLayerAsset*>& Array, EDataLayerRuntimeState InState);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void GetStreamingPos(struct FVector* Pos);
	void ExecuteUbergraph_BP_NoceTitleGameMode(int32 EntryPoint);
	void ClearGameData();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoceTitleGameMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoceTitleGameMode_C")
	}
	static class ABP_NoceTitleGameMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NoceTitleGameMode_C>();
	}
};
DUMPER7_ASSERTS_ABP_NoceTitleGameMode_C;

}

