#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NavLinkJumpParam_S

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameNoce_structs.hpp"


namespace SDK
{

// UserDefinedStruct BP_NavLinkJumpParam_S.BP_NavLinkJumpParam_S
// 0x0050 (0x0050 - 0x0000)
struct FBP_NavLinkJumpParam_S final
{
public:
	struct FVector                                Destination_9_440AA3FE41AF76361B72929F60AC46D1;    // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceNavLinkJumpType                          JumpType_14_A40477B84AAB0B2DDB8247AC453F918A;      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration_19_097041A9470234F0784FB282064F535D;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height_20_582A246247E1447007BC8E9F4FA7E981;        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance_21_CEFF9E9E4DD9168025B7A5B5E6B50E39;      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DestinationRot_24_860BCC4549FA824E45FD11B6A363C40A; // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FBP_NavLinkJumpParam_S;

}

