#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NocePopWindowTutorialInstructor_SavePoint1

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NocePopWindowTutorialInstructor_SavePoint1.BP_NocePopWindowTutorialInstructor_SavePoint1_C.SetupData
// 0x0018 (0x0018 - 0x0000)
struct BP_NocePopWindowTutorialInstructor_SavePoint1_C_SetupData final
{
public:
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerState*                       CallFunc_GetNocePlayerState_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableSavePointUpgrade_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NocePopWindowTutorialInstructor_SavePoint1_C_SetupData;

// Function BP_NocePopWindowTutorialInstructor_SavePoint1.BP_NocePopWindowTutorialInstructor_SavePoint1_C.CanStart
// 0x0018 (0x0018 - 0x0000)
struct BP_NocePopWindowTutorialInstructor_SavePoint1_C_CanStart final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerState*                       CallFunc_GetNocePlayerState_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableSavePointOffering_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NocePopWindowTutorialInstructor_SavePoint1_C_CanStart;

}

