#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NocePopWindowTutorialInstructorSavePointBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "BP_NocePopWindowTutorialInstructorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NocePopWindowTutorialInstructorSavePointBase.BP_NocePopWindowTutorialInstructorSavePointBase_C
// 0x0070 (0x0428 - 0x03B8)
class ABP_NocePopWindowTutorialInstructorSavePointBase_C : public ABP_NocePopWindowTutorialInstructorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NocePopWindowTutorialInstructorSavePointBase_C; // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FNoceUITutorialPopWindowPageData> OfferingPopWindowPageData;                       // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceUITutorialPopWindowPageData> UpgradePopWindowPageData;                        // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceNotebookTutorialContentRowHandle> OfferingSavePointNotebookIDs;               // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceNotebookTutorialContentRowHandle> UpgradeSavePointNotebookIDs;                // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ENoceTutorialType                             UpgradeTutorialType;                               // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ENoceTutorialType>                     StopTutorialTypes;                                 // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceNotebookTutorialContentRowHandle> SavePointNotebookIDs;                       // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetupData();
	void OnTutorialTrigger();
	void OnTutorialFinish();
	void OnPopWindowClose();
	void ExecuteUbergraph_BP_NocePopWindowTutorialInstructorSavePointBase(int32 EntryPoint);
	bool CanStart();
	bool IsStartCondition();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NocePopWindowTutorialInstructorSavePointBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NocePopWindowTutorialInstructorSavePointBase_C")
	}
	static class ABP_NocePopWindowTutorialInstructorSavePointBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NocePopWindowTutorialInstructorSavePointBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_NocePopWindowTutorialInstructorSavePointBase_C;

}

