#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Npc_Shuu

#include "Basic.hpp"

#include "ECharMesh_Shuu_structs.hpp"


namespace SDK::Params
{

// Function BP_Npc_Shuu.BP_Npc_Shuu_C.SetShuuCharMeshType
// 0x0028 (0x0028 - 0x0000)
struct BP_Npc_Shuu_C_SetShuuCharMeshType final
{
public:
	ECharMesh_Shuu                                InValue;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateCharMeshType_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Npc_Shuu_C_SetShuuCharMeshType;

}

