#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NocePlayerCameraRotateComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NocePlayerCameraRotateComponent.BP_NocePlayerCameraRotateComponent_C
// 0x0028 (0x00C8 - 0x00A0)
class UBP_NocePlayerCameraRotateComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 OwnerActor;                                        // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCameraComponent*             NocePlayerCamera;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   ATPCCamera;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_Camera_Reset();
	void AssignRotation(const struct FRotator& InRotator, bool InAutoClear, bool InResetSpeed, bool InApplyPitch, bool InApplyYaw, bool InApplyRoll);
	void ClearAssignRotation();
	void ExecuteUbergraph_BP_NocePlayerCameraRotateComponent(int32 EntryPoint);
	void ForceSetViewRotation(const struct FRotator& InRotation);
	void Initialize();
	void OnInputActionWithoutFindingLockTarget();
	void ReceiveBeginPlay();
	void RotateTo(const struct FVector& InTargetLocation, bool InAutoClear);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NocePlayerCameraRotateComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NocePlayerCameraRotateComponent_C")
	}
	static class UBP_NocePlayerCameraRotateComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NocePlayerCameraRotateComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_NocePlayerCameraRotateComponent_C;

}

