#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Npc_Shuu_Cine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Npc_Shuu_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Npc_Shuu_Cine.BP_Npc_Shuu_Cine_C
// 0x0030 (0x0E50 - 0x0E20)
class ABP_Npc_Shuu_Cine_C final : public ABP_Npc_Shuu_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Npc_Shuu_Cine_C;                 // 0x0E20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_FX_EVN_SMZ_ChaDust_Body;                        // 0x0E28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FX_EVN_SMZ_ChaDust_Head;                        // 0x0E30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FX_EVN_SMZ_Shuu_Head_001;                       // 0x0E38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FX_EVN_SMZ_Shuu_Hair_001;                       // 0x0E40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FX_EVN_SMZ_Shuu_Body_001;                       // 0x0E48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Npc_Shuu_Cine(int32 EntryPoint);
	void ReceiveBeginPlay();

	bool IsCineChar(bool* NoUse) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Npc_Shuu_Cine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Npc_Shuu_Cine_C")
	}
	static class ABP_Npc_Shuu_Cine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Npc_Shuu_Cine_C>();
	}
};
DUMPER7_ASSERTS_ABP_Npc_Shuu_Cine_C;

}

