#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceBinkSubsystem

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.EnableBinkRender
// 0x0002 (0x0002 - 0x0000)
struct BP_NoceBinkSubsystem_C_EnableBinkRender final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_EnableBinkRender;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.PlayBinkVideo
// 0x0002 (0x0002 - 0x0000)
struct BP_NoceBinkSubsystem_C_PlayBinkVideo final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_PlayBinkVideo;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.PreloadBinkVideo
// 0x00A0 (0x00A0 - 0x0000)
struct BP_NoceBinkSubsystem_C_PreloadBinkVideo final
{
public:
	struct FTransform                             SpawnTransform;                                    // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       EditorModeBinkPlayerSource;                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkPlayerSource;                                  // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Seconds;                                           // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 BinkLinkUrl;                                       // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsBinkSeekEveryFrame;                              // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACS_BinkPlayTool_C*                     CallFunc_UpdateOrSpawnBinkPlayTool_BinkPlayTool;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_PreloadBinkVideo;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.PreloadBinkVideo_BP
// 0x0100 (0x0100 - 0x0000)
struct BP_NoceBinkSubsystem_C_PreloadBinkVideo_BP final
{
public:
	struct FNoceBinkPreloadData                   InData;                                            // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       K2Node_DynamicCast_AsBink_Media_Player;            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_PreloadBinkVideo_Seconds_ImplicitCast;    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_PreloadBinkVideo_BP;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.ReleaseBinkPlayTool
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceBinkSubsystem_C_ReleaseBinkPlayTool final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_ReleaseBinkPlayTool;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.RewindBinkVideo
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceBinkSubsystem_C_RewindBinkVideo final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_RewindBinkVideo;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.SeekBinkVideo
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceBinkSubsystem_C_SeekBinkVideo final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_SeekBinkVideo;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.SetBinkSeekEveryFrame
// 0x0002 (0x0002 - 0x0000)
struct BP_NoceBinkSubsystem_C_SetBinkSeekEveryFrame final
{
public:
	bool                                          IsSeekEveryFrame;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_SetBinkSeekEveryFrame;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.SetBinkVideoTime
// 0x0010 (0x0010 - 0x0000)
struct BP_NoceBinkSubsystem_C_SetBinkVideoTime final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_SetBinkVideoTime;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.StopBinkVideo
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceBinkSubsystem_C_StopBinkVideo final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_StopBinkVideo;

// Function BP_NoceBinkSubsystem.BP_NoceBinkSubsystem_C.UpdateOrSpawnBinkPlayTool
// 0x01B0 (0x01B0 - 0x0000)
struct BP_NoceBinkSubsystem_C_UpdateOrSpawnBinkPlayTool final
{
public:
	struct FTransform                             SpawnTransform;                                    // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       EditorModeBinkPlayerSource;                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkPlayerSource;                                  // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Seconds;                                           // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 BinkLinkUrl;                                       // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsBinkSeekEveryFrame;                              // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACS_BinkPlayTool_C*                     BinkPlayTool_0;                                    // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACS_BinkPlayTool_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceBinkSubsystem_C_UpdateOrSpawnBinkPlayTool;

}

