#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceSkyLightHelper

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NoceSkyLightHelper.BP_NoceSkyLightHelper_C.ApplyDataToComponent
// 0x0078 (0x0078 - 0x0000)
struct BP_NoceSkyLightHelper_C_ApplyDataToComponent final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceSkyLightSetting                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0068)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceSkyLightHelper_C_ApplyDataToComponent;

// Function BP_NoceSkyLightHelper.BP_NoceSkyLightHelper_C.ExecuteUbergraph_BP_NoceSkyLightHelper
// 0x0020 (0x0020 - 0x0000)
struct BP_NoceSkyLightHelper_C_ExecuteUbergraph_BP_NoceSkyLightHelper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceEnvironmentSubsystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNoceEnvironmentSubsystem*              CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceSkyLightHelper_C_ExecuteUbergraph_BP_NoceSkyLightHelper;

// Function BP_NoceSkyLightHelper.BP_NoceSkyLightHelper_C.GetDataFromComponent
// 0x0070 (0x0070 - 0x0000)
struct BP_NoceSkyLightHelper_C_GetDataFromComponent final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceSkyLightSetting                   CallFunc_GetSkyLightDataFromComponent_ReturnValue; // 0x0008(0x0068)()
};
DUMPER7_ASSERTS_BP_NoceSkyLightHelper_C_GetDataFromComponent;

// Function BP_NoceSkyLightHelper.BP_NoceSkyLightHelper_C.RecaptureSky
// 0x0010 (0x0010 - 0x0000)
struct BP_NoceSkyLightHelper_C_RecaptureSky final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceSkyLightHelper_C_RecaptureSky;

// Function BP_NoceSkyLightHelper.BP_NoceSkyLightHelper_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_NoceSkyLightHelper_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceSkyLightHelper_C_ReceiveEndPlay;

// Function BP_NoceSkyLightHelper.BP_NoceSkyLightHelper_C.TryGetComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_NoceSkyLightHelper_C_TryGetComponent final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NoceSkyLightHelper_C_TryGetComponent;

}

