#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceBattlePositionSubsystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoceBattlePositionSubsystem.BP_NoceBattlePositionSubsystem_C
// 0x0130 (0x01C0 - 0x0090)
class UBP_NoceBattlePositionSubsystem_C final : public UNoceBattlePositionSubsystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0090(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FVector>                        LocationPrimary;                                   // 0x0098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        LocationSecondary;                                 // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        LocationBattleField;                               // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        LocationFilter;                                    // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UEnvQuery*                              QueryPrimaryTemplate;                              // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEnvQuery*                              QuerySecondaryTemplate;                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessingPrimary;                                 // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessingSecondary;                               // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessingTeriary;                                 // 0x00EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ANoceEnemyCharacter*>            RegisterEnemy;                                     // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	struct FVector                                CachePlayerLocation;                               // 0x0100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachePlayerDir;                                    // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DeltaDirection;                                    // 0x0130(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetDirection;                                   // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LerpDirectionAlpha;                                // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FanFrontDistT1;                                    // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FanFrontDistOther;                                 // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FanBackDistT1;                                     // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FanBackDistOther;                                  // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FanAngle;                                          // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EnemiesCenterDir;                                  // 0x0178(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tier1_Count;                                       // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tier2_Count;                                       // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceFilterPointToPoint;                        // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceFilterToOtherEnemy;                        // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BattlePosIgnoreTags;                               // 0x01A0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CalculateMyScore(class ANoceEnemyCharacter* Enemy, ENoceBattlePositionTier Tier, const struct FVector& ReferenceLocation, double* Score);
	void Deinitialize_BP();
	void DrawLocationGizmo();
	void EnemiesCenterDirection(struct FVector* Dir);
	void ExecuteUbergraph_BP_NoceBattlePositionSubsystem(int32 EntryPoint);
	void GetCurrentDirection(struct FVector* Direction);
	void GetFanBackDistance(ENoceBattlePositionTier Tier, double* Distance);
	void GetFanFrontDistance(ENoceBattlePositionTier Tier, double* Distance);
	void GetMyBattlePosition(class AActor* MyActor, bool* Success, struct FVector* Location, ENoceBattlePositionTier* Tier);
	void Ignore_Tags_Condition(class ANoceEnemyCharacter* Enemy, bool* Bool);
	void IndexTransferToTier(int32 Index_0, ENoceBattlePositionTier* Tier);
	void Initialize_BP();
	void IsAllQueryFinished(bool* Value);
	void IsInMyBattleField(class AActor* ItsActor, bool* Value, ENoceBattlePositionTier* Tier);
	void IsInMyBattleFieldTier(class AActor* ItsActor, bool* Value, ENoceBattlePositionTier* Tier);
	void IsQueryProcessing(bool* Value);
	void OnPrimaryQueryFinished(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void OnSecondaryQueryFinished(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void OnSystemEnabledChanged(bool NewValue);
	void RetryAllQuery(double RetryDelay);
	void RunAllQuery();
	void Tick_BP(float DeltaTime);
	void TickReferenceDirection(double DeltaTime);
	void TrackEnemyPosition();
	void WorldBeginPlay_BP();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoceBattlePositionSubsystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoceBattlePositionSubsystem_C")
	}
	static class UBP_NoceBattlePositionSubsystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NoceBattlePositionSubsystem_C>();
	}
};
DUMPER7_ASSERTS_UBP_NoceBattlePositionSubsystem_C;

}

