#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NoceTutorialInstructor_DarkCrawlDebut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NoceTutorialInstructorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NoceTutorialInstructor_DarkCrawlDebut.BP_NoceTutorialInstructor_DarkCrawlDebut_C
// 0x0030 (0x0398 - 0x0368)
class ABP_NoceTutorialInstructor_DarkCrawlDebut_C final : public ABP_NoceTutorialInstructorBase_C
{
public:
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NoceTutorialInstructor_DarkCrawlDebut_C; // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsInBattle;                                        // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLeavedBattle;                                   // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Ema_Q;                                             // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           DarkCrawl;                                         // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnTutorialStart();
	bool IsStartCondition();
	void ExecuteUbergraph_BP_NoceTutorialInstructor_DarkCrawlDebut(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NoceTutorialInstructor_DarkCrawlDebut_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NoceTutorialInstructor_DarkCrawlDebut_C")
	}
	static class ABP_NoceTutorialInstructor_DarkCrawlDebut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NoceTutorialInstructor_DarkCrawlDebut_C>();
	}
};
DUMPER7_ASSERTS_ABP_NoceTutorialInstructor_DarkCrawlDebut_C;

}

