#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OpenDoorByProgress

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_OpenDoorByProgress.BP_OpenDoorByProgress_C.ApplyUpdate
// 0x0020 (0x0020 - 0x0000)
struct BP_OpenDoorByProgress_C_ApplyUpdate final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InteractDoor_C>   K2Node_DynamicCast_AsBPI_Interact_Door;            // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_OpenDoorByProgress_C_ApplyUpdate;

// Function BP_OpenDoorByProgress.BP_OpenDoorByProgress_C.ExecuteUbergraph_BP_OpenDoorByProgress
// 0x0028 (0x0028 - 0x0000)
struct BP_OpenDoorByProgress_C_ExecuteUbergraph_BP_OpenDoorByProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InteractDoor_C>   K2Node_DynamicCast_AsBPI_Interact_Door;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_IsDoorReady_OutReady;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_OpenDoorByProgress_C_ExecuteUbergraph_BP_OpenDoorByProgress;

// Function BP_OpenDoorByProgress.BP_OpenDoorByProgress_C.NeedUpdateOpen
// 0x0005 (0x0005 - 0x0000)
struct BP_OpenDoorByProgress_C_NeedUpdateOpen final
{
public:
	bool                                          B;                                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_OpenDoorByProgress_C_NeedUpdateOpen;

// Function BP_OpenDoorByProgress.BP_OpenDoorByProgress_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_OpenDoorByProgress_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_OpenDoorByProgress_C_ReceiveTick;

// Function BP_OpenDoorByProgress.BP_OpenDoorByProgress_C.UpdateOpenDoor_BP
// 0x0028 (0x0028 - 0x0000)
struct BP_OpenDoorByProgress_C_UpdateOpenDoor_BP final
{
public:
	bool                                          NeedOpen;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NeedUpdateOpen_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InteractDoor_C>   K2Node_DynamicCast_AsBPI_Interact_Door;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_IsDoorReady_OutReady;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_OpenDoorByProgress_C_UpdateOpenDoor_BP;

}

