#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Player_CameraMode_State

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Player_CameraMode_State.BP_Player_CameraMode_State_C.ExecuteUbergraph_BP_Player_CameraMode_State
// 0x0038 (0x0038 - 0x0000)
struct BP_Player_CameraMode_State_C_ExecuteUbergraph_BP_Player_CameraMode_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_NocePlayerCharacter_C> K2Node_DynamicCast_AsBPI_Noce_Player_Character; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_NocePlayerCharacter_C> K2Node_DynamicCast_AsBPI_Noce_Player_Character_1; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Player_CameraMode_State_C_ExecuteUbergraph_BP_Player_CameraMode_State;

}

