#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_Deflect_State

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "SMSystem_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.ConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_ConstructionScript final
{
public:
	ESMExecutionEnvironment                       CallFunc_WithExecutionEnvironment_ExecutionEnvironment; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_ConstructionScript;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.ExecuteUbergraph_BP_Pl_Base_Deflect_State
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_ExecuteUbergraph_BP_Pl_Base_Deflect_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMontage_OutMontage;                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDefaultBlendInTime_ReturnValue;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSkipThisState_CanSkip;                 // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_ExecuteUbergraph_BP_Pl_Base_Deflect_State;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.GetMontage
// 0x0028 (0x0028 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_GetMontage final
{
public:
	class UAnimMontage*                           OutMontage;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Local_Montage;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANoceWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromBank_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_GetMontage;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.OnBlendOut_B3483EBE455CC236689FEE97E80AA15E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_OnBlendOut_B3483EBE455CC236689FEE97E80AA15E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_OnBlendOut_B3483EBE455CC236689FEE97E80AA15E;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.OnCompleted_B3483EBE455CC236689FEE97E80AA15E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_OnCompleted_B3483EBE455CC236689FEE97E80AA15E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_OnCompleted_B3483EBE455CC236689FEE97E80AA15E;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.OnInputAxis
// 0x0010 (0x0010 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_OnInputAxis final
{
public:
	ENoceInputAxis                                InInputAxis;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_HandleInputAxis_InValue_ImplicitCast;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_OnInputAxis;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.OnInterrupted_B3483EBE455CC236689FEE97E80AA15E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_OnInterrupted_B3483EBE455CC236689FEE97E80AA15E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_OnInterrupted_B3483EBE455CC236689FEE97E80AA15E;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.OnMontageStateChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_OnMontageStateChanged final
{
public:
	ENoceMontageState                             NewMontageState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_OnMontageStateChanged;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.OnNotifyBegin_B3483EBE455CC236689FEE97E80AA15E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_OnNotifyBegin_B3483EBE455CC236689FEE97E80AA15E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_OnNotifyBegin_B3483EBE455CC236689FEE97E80AA15E;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.OnNotifyEnd_B3483EBE455CC236689FEE97E80AA15E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_OnNotifyEnd_B3483EBE455CC236689FEE97E80AA15E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_OnNotifyEnd_B3483EBE455CC236689FEE97E80AA15E;

// Function BP_Pl_Base_Deflect_State.BP_Pl_Base_Deflect_State_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_Pl_Base_Deflect_State_C_OnStateUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_Deflect_State_C_OnStateUpdate;

}

