#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_Dead_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SMSystem_structs.hpp"
#include "BP_Pl_Base_Base_State_classes.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_Dead_State.BP_Pl_Base_Dead_State_C
// 0x0048 (0x0248 - 0x0200)
class UBP_Pl_Base_Dead_State_C final : public UBP_Pl_Base_Base_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_Dead_State_C;            // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BankID;                                            // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimID;                                            // 0x020C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_PlayerFSMDead;                                  // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CustomTriggerGameOver;                             // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Camera_Mode_Tag;                                   // 0x021C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         CameraSequenceFront;                               // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CameraPlayer;                                      // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class ULevelSequence*                         CameraSequenceBack;                                // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequenceActor;                                     // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ConstructionScript();
	void ExecuteUbergraph_BP_Pl_Base_Dead_State(int32 EntryPoint);
	void GetCameraSequenceData(class ULevelSequence** TargetSequence);
	void OnInputAction(ENoceInputAction InInputAction, bool InPressed);
	void OnStateBegin();
	void OnStateEnd();
	void PlayMontage();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_Dead_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_Dead_State_C")
	}
	static class UBP_Pl_Base_Dead_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_Dead_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_Dead_State_C;

}

