#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerGameState_AddWeapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerGameState_Base_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerGameState_AddWeapon.BP_PlayerGameState_AddWeapon_C
// 0x0028 (0x0130 - 0x0108)
class UBP_PlayerGameState_AddWeapon_C final : public UBP_PlayerGameState_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerGameState_AddWeapon_C;     // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          ResetFogWeaponInventory;                           // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResetDarkWeaponInventory;                          // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           WeaponName;                                        // 0x0118(0x0010)(Edit, BlueprintVisible)
	bool                                          HideForCinematic;                                  // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeAdd;                                    // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerGameState_AddWeapon(int32 EntryPoint);
	void ConstructionScript();
	void OnStateBegin();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerGameState_AddWeapon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerGameState_AddWeapon_C")
	}
	static class UBP_PlayerGameState_AddWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerGameState_AddWeapon_C>();
	}
};
DUMPER7_ASSERTS_UBP_PlayerGameState_AddWeapon_C;

}

