#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_Sprint_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SMSystem_structs.hpp"
#include "BP_Pl_Base_Base_State_classes.hpp"
#include "GameNoce_structs.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_Sprint_State.BP_Pl_Base_Sprint_State_C
// 0x00E0 (0x02E0 - 0x0200)
class UBP_Pl_Base_Sprint_State_C final : public UBP_Pl_Base_Base_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_Sprint_State_C;          // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_SprintStateCostSanityRatio;                     // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_Sprint;                                         // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEHandle_Sprint;                                   // 0x0218(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        LeaveState_TmeInStateThreshold;                    // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StaminaKey;                                        // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StaminaCostPeriod;                                 // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_StaminaCostPeriodSetByCaller;                   // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              GE_EffectSpec_StaminaCost;                         // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            GE_Handle_StaminaCost;                             // 0x0250(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_NoStaminaRegen;                                 // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_Handle_NoStaminaRegen;                          // 0x0260(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     Action_RunningCostStaminaAdd;                      // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   Action_RunningCostStaminaRemove;                   // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        JogEndTime;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogEndTimer;                                       // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogToWalkTime;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogToWalkTimer;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InputAngleThreshold;                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogStartTime;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JogStartTimer;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Object_Types;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_Pl_NoceWalkToComponent_C*           NocePlayerWalkToComp;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HeadLocation;                                      // 0x02C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_BFC1EE164EAC1A876380CEAAABD14941();
	void BeginCostStamina();
	void CheckInputStatus(double InDeltaSeconds);
	void ConstructionScript();
	void EndCostStamina();
	void ExecuteUbergraph_BP_Pl_Base_Sprint_State(int32 EntryPoint);
	void HandleCostStaminaSwitch();
	void HandleCostStaminaSwitchEnd();
	bool IsRunningCostStamina();
	void OnForceRunningNoCostStamina(bool IsEnable);
	void OnInputAction(ENoceInputAction InInputAction, bool InPressed);
	void OnInputAxis(ENoceInputAxis InInputAxis, float InValue);
	void OnStateBegin();
	void OnStateEnd();
	void OnStateInitialized();
	void OnStateUpdate(float DeltaSeconds);
	void ProcessCostStamina();
	void Removed_4DDCEAE14F928F0963ADA08FB2434460();
	void SetupCostStamina();
	bool StopSprintByInputSprintReleased();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_Sprint_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_Sprint_State_C")
	}
	static class UBP_Pl_Base_Sprint_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_Sprint_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_Sprint_State_C;

}

