#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreloadSeqeuence_State

#include "Basic.hpp"

#include "BP_ProgressState_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PreloadSeqeuence_State.BP_PreloadSeqeuence_State_C
// 0x0088 (0x0178 - 0x00F0)
class UBP_PreloadSeqeuence_State_C final : public UBP_ProgressState_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class ULevelSequence>          TargetResources;                                   // 0x00F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>              SeqDataTable;                                      // 0x0120(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   DataRowName;                                       // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          SelectedSequence;                                  // 0x0150(0x0028)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnStateBegin();
	void OnLoaded_1C31181F4D9D9CC693DB2B9548D2D965(class UObject* Loaded);
	void OnComplete_C9157AE74DD3F227D46539A457BFE3DF();
	void ExecuteUbergraph_BP_PreloadSeqeuence_State(int32 EntryPoint);
	void ConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PreloadSeqeuence_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PreloadSeqeuence_State_C")
	}
	static class UBP_PreloadSeqeuence_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PreloadSeqeuence_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_PreloadSeqeuence_State_C;

}

