#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerGamePlayTagTransition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SMSystem_structs.hpp"
#include "SMSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerGamePlayTagTransition.BP_PlayerGamePlayTagTransition_C
// 0x0020 (0x00E0 - 0x00C0)
class UBP_PlayerGamePlayTagTransition_C final : public USMTransitionInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANocePlayerState*                       PlayerState;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           CheckGamePlay;                                     // 0x00D0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          ExactMatch;                                        // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TagExists;                                         // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnTransitionShutdown();
	void OnTransitionInitialized();
	void OnGamePlayTagUpdate(const struct FGameplayTag& Tag, bool TagExists_0);
	void ExecuteUbergraph_BP_PlayerGamePlayTagTransition(int32 EntryPoint);
	void ConstructionScript();

	bool CanEnterTransition() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerGamePlayTagTransition_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerGamePlayTagTransition_C")
	}
	static class UBP_PlayerGamePlayTagTransition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerGamePlayTagTransition_C>();
	}
};
DUMPER7_ASSERTS_UBP_PlayerGamePlayTagTransition_C;

}

