#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_NocePlayerCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "NeoAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.Apply Claw GIn Sequence
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_Apply_Claw_GIn_Sequence final
{
public:
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_Apply_Claw_GIn_Sequence;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.ApplyBattleStatusTimerTick
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_ApplyBattleStatusTimerTick final
{
public:
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_ApplyBattleStatusTimerTick;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.ApplyBattling
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_ApplyBattling final
{
public:
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_ApplyBattling;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.ApplyDamageWithReaction
// 0x02A0 (0x02A0 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_ApplyDamageWithReaction final
{
public:
	double                                        InHealthDamage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InWinceDamage;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InMaxSanityDamage;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InStaminaDamage;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InMaxSanityDamageToHealthDamageRatio;              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsForceWince;                                      // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceWinceType                                InWinceType;                                       // 0x0025(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                InDeathType;                                       // 0x0026(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCheckInvincible_;                                // 0x0027(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InHealthDamageEffectedByDamageRatio;               // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InHealthDamageApplyGutsCheck;                      // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsLimitHealth;                                   // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCheckOmamoriKagami;                              // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCheckSuperArmor;                                 // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceAttackHitResult                   Local_HitResult;                                   // 0x0030(0x0178)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference)
	ENoceWinceType                                Local_NewWinceType;                                // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanApplyWinceType_ReturnValue;            // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSuperArmor_ReturnValue;                 // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceWinceType                                CallFunc_HandleDamage_ReturnValue;                 // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInvincible_ReturnValue;                 // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_HandleDamage_InHealthDamage_ImplicitCast; // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_HandleDamage_InWinceDamage_ImplicitCast;  // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_HandleDamage_InMaxSanityDamage_ImplicitCast; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_HandleDamage_InStaminaDamage_ImplicitCast; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_ApplyDamageWithReaction;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.ApplyWinceType
// 0x0050 (0x0050 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_ApplyWinceType final
{
public:
	ENoceWinceType                                InWinceType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClawG_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetHead_ReturnValue;                      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_ApplyWinceType;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.AudioDebugDraw
// 0x0048 (0x0048 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_AudioDebugDraw final
{
public:
	class UNeoAudioSystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_AudioDebugDraw;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_ApplyCameraMode
// 0x000C (0x000C - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_ApplyCameraMode final
{
public:
	struct FGameplayTag                           CameraMode;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          WithInterpolation;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceSet;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_ApplyCameraMode;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_ApplyCustomCamera
// 0x000C (0x000C - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_ApplyCustomCamera final
{
public:
	struct FGameplayTag                           CameraMode;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          WithInterpolation;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_ApplyCustomCamera;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_ApplyDamageWithReaction
// 0x0038 (0x0038 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_ApplyDamageWithReaction final
{
public:
	double                                        InHealthDamage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InWinceDamage;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InMaxSanityDamage;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InStaminaDamage;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InMaxSanityDamageToHealthDamageRatio;              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsForceWince;                                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceWinceType                                InWinceType;                                       // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                InDeathType;                                       // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCheckInvincible_;                                // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InHealthDamageEffectedByDamageRatio;               // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InHealthDamageApplyGutsCheck;                      // 0x002D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsLimitHealth;                                   // 0x002E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCheckOmamoriKagami;                              // 0x002F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InCheckSuperArmor;                                 // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_ApplyDamageWithReaction;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_DebugPlayerDeath
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugPlayerDeath final
{
public:
	int32                                         DeathType;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DeathDir;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugPlayerDeath;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_DebugPlayerInvincbile
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugPlayerInvincbile final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugPlayerInvincbile;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_DebugPlayerNoCostStamina
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugPlayerNoCostStamina final
{
public:
	bool                                          InEable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugPlayerNoCostStamina;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_DebugPlayerNoStaminaTiredTimerTick
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugPlayerNoStaminaTiredTimerTick final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugPlayerNoStaminaTiredTimerTick;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_DebugSetNoCostClawTransform
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugSetNoCostClawTransform final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_DebugSetNoCostClawTransform;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_DropWeapon
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_DropWeapon final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_DropWeapon;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_EnableForceStay
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_EnableForceStay final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_EnableForceStay;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_EnableMaterialsClaw
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_EnableMaterialsClaw final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_EnableMaterialsClaw;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_EnableMaterialsClawG
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_EnableMaterialsClawG final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_EnableMaterialsClawG;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_GetAudioProbeLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_GetAudioProbeLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_GetAudioProbeLocation;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_GetCameraViewRotation
// 0x0038 (0x0038 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_GetCameraViewRotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UATPCCameraLocationObject*              CallFunc_GetCameraLocationObject_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetViewRotation_ReturnValue;              // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_GetCameraViewRotation;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_GetCounterAutoAimSearchInfo
// 0x0030 (0x0030 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_GetCounterAutoAimSearchInfo final
{
public:
	double                                        OutRadius;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutHalfAngle;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANoceWeapon*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAutoAimSearchInfo_Radius;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAutoAimSearchInfo_HalfAngle;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_GetCounterAutoAimSearchInfo;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_HandleDamage
// 0x0178 (0x0178 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_HandleDamage final
{
public:
	struct FNoceAttackHitResult                   InAttackHitResult;                                 // 0x0000(0x0178)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_HandleDamage;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_HandleOnSlopeChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_HandleOnSlopeChanged final
{
public:
	bool                                          InIsOnSlope;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_HandleOnSlopeChanged;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_InRealBattleStatus
// 0x0002 (0x0002 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_InRealBattleStatus final
{
public:
	bool                                          OutValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRealBattleStatus_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_InRealBattleStatus;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_LockInputWithDuration
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_LockInputWithDuration final
{
public:
	bool                                          InAcceptAction;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAcceptAxis;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAcceptUIAction;                                  // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAcceptCamera;                                    // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InToken;                                           // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InDuration;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_LockInputWithDuration;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_ResetCustomCamera
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_ResetCustomCamera final
{
public:
	bool                                          WithInterpolation;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_ResetCustomCamera;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_SetCameraViewRotation
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_SetCameraViewRotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_SetCameraViewRotation;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_SetClawFurWPOIntensityForCutscene
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_SetClawFurWPOIntensityForCutscene final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_SetClawFurWPOIntensityForCutscene;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_SetCollisionResponseIgnorePawn
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_SetCollisionResponseIgnorePawn final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_SetCollisionResponseIgnorePawn;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_SetPlayerIdleVarInt
// 0x0004 (0x0004 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_SetPlayerIdleVarInt final
{
public:
	int32                                         IdleVarInt;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_SetPlayerIdleVarInt;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_SetPlayerIdleVarTime
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_SetPlayerIdleVarTime final
{
public:
	double                                        OverwriteIdleVarTime_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_SetPlayerIdleVarTime;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_ShowCloth
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_ShowCloth final
{
public:
	class FName                                   InValue;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_ShowCloth;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_StartFaceTargetCameraMode
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_StartFaceTargetCameraMode final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_StartFaceTargetCameraMode;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_StartFaceTargetCameraModeWithRotation
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_StartFaceTargetCameraModeWithRotation final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_StartFaceTargetCameraModeWithRotation;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_StartRunTo
// 0x0028 (0x0028 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_StartRunTo final
{
public:
	struct FRotator                               InRunToRotation;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        InRunToDuration;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InLimitInput;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_StartRunTo;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_StartWeddingCameraMode
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_StartWeddingCameraMode final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_StartWeddingCameraMode;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_StopWalking
// 0x0001 (0x0001 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_StopWalking final
{
public:
	bool                                          IsStop;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_StopWalking;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_SwitchWeaponAudioType
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_SwitchWeaponAudioType final
{
public:
	struct FGameplayTag                           InSwitchValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_SwitchWeaponAudioType;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_TestHellModeDamage
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_TestHellModeDamage final
{
public:
	class UNoceHellModeDataAsset*                 InHellModeDataAsset;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_TestHellModeDamage;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_WalkToLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_WalkToLocation final
{
public:
	double                                        InStartDelayTime;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InTargetLocation;                                  // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InCameraLerpTime;                                  // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InLimitInput;                                      // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_WalkToLocation;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.BPI_WalkToWithCameraRotation
// 0x0048 (0x0048 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_BPI_WalkToWithCameraRotation final
{
public:
	double                                        InStartDelayTime;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               InCameraRotation;                                  // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                InWalkToLocation;                                  // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InCameraLerpTime;                                  // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InLimitInput;                                      // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_BPI_WalkToWithCameraRotation;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.DebugPlayerDeath
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerDeath final
{
public:
	int32                                         DeathType;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DeathDir;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_3;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_4;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_5;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_6;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_7;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_8;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_9;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                Temp_byte_Variable_10;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceHitReactionTwoWayType                    Temp_byte_Variable_11;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceHitReactionTwoWayType                    Temp_byte_Variable_12;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceHitReactionTwoWayType                    K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_1;                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ENoceDeathType                                K2Node_Select_Default_2;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceWinceType                                CallFunc_HandleDamage_ReturnValue;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerDeath;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.DebugPlayerInvincible
// 0x0003 (0x0003 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerInvincible final
{
public:
	bool                                          InEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTokenInvincible_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerInvincible;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.DebugPlayerNoCostClawTransform
// 0x000C (0x000C - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerNoCostClawTransform final
{
public:
	bool                                          InEnbale;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerNoCostClawTransform;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.DebugPlayerNoCostStamina
// 0x000C (0x000C - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerNoCostStamina final
{
public:
	bool                                          InEnbale;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerNoCostStamina;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.DebugPlayerNoStaminaTiredTimerTick
// 0x000C (0x000C - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerNoStaminaTiredTimerTick final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_DebugPlayerNoStaminaTiredTimerTick;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.DebugTogglePlayerInvincbile
// 0x0028 (0x0028 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_DebugTogglePlayerInvincbile final
{
public:
	class UNoceCheatManager*                      CallFunc_GetNoceCheatManager_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNoceCheatManager*                      CallFunc_GetNoceCheatManager_ReturnValue_1;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebugInvincibleEnabled_ReturnValue;     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ExecuteCommand_CommandValue_ImplicitCast; // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_DebugTogglePlayerInvincbile;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.DoEndLevelCameraMode
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_DoEndLevelCameraMode final
{
public:
	class UATPCCameraLocationObject*              CallFunc_GetCameraLocationObject_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_DoEndLevelCameraMode;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.DoStartLevelCameraMode
// 0x0028 (0x0028 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_DoStartLevelCameraMode final
{
public:
	struct FGameplayTag                           InCameraModeTag;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               InRotation;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UATPCCameraLocationObject*              CallFunc_GetCameraLocationObject_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_NocePlayerCharacter_C_DoStartLevelCameraMode;

// Function BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C.ExecuteUbergraph_BP_Pl_Base_NocePlayerCharacter
// 0x08A0 (0x08A0 - 0x0000)
struct BP_Pl_Base_NocePlayerCharacter_C_ExecuteUbergraph_BP_Pl_Base_NocePlayerCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float InHealthDamage, float InMaxSanityDamage)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0018(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x0030(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_1;                              // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InValue_1;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_InValue;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InEnable_5;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InEnable_4;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InEable;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InEnable_3;                           // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceAttackHitResult                   K2Node_Event_InAttackHitResult;                    // 0x0070(0x0178)(NoDestructor, ContainsInstancedReference)
	double                                        K2Node_Event_InHealthDamage;                       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_InWinceDamage;                        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_InMaxSanityDamage;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_InStaminaDamage;                      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_InMaxSanityDamageToHealthDamageRatio; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsForceWince;                         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceWinceType                                K2Node_Event_InWinceType;                          // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceDeathType                                K2Node_Event_InDeathType;                          // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InCheckInvincible_;                   // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InHealthDamageEffectedByDamageRatio;  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InHealthDamageApplyGutsCheck;         // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
