#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_InteractInfoComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pl_Base_InteractInfoComp.BP_Pl_Base_InteractInfoComp_C
// 0x0088 (0x0270 - 0x01E8)
class UBP_Pl_Base_InteractInfoComp_C final : public UNoceInteractComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANocePlayerCharacter*                   NocePlayerCharacter;                               // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WallIn;                                            // 0x01F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WallNormal;                                        // 0x0210(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WallEndPoint;                                      // 0x0228(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WallOut;                                           // 0x0240(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WallHeight;                                        // 0x0258(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanClimbWall(ENoceInteractType* InteractType);
	void CanInteract(ENoceInteractType* InteractType);
	bool CanVault();
	void ExecuteUbergraph_BP_Pl_Base_InteractInfoComp(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_InteractInfoComp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_InteractInfoComp_C")
	}
	static class UBP_Pl_Base_InteractInfoComp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_InteractInfoComp_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_InteractInfoComp_C;

}

