#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Player_RefreshWeapon_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_ProgressStateWithEndTag_Base_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Player_RefreshWeapon_State.BP_Player_RefreshWeapon_State_C
// 0x0040 (0x0140 - 0x0100)
class UBP_Player_RefreshWeapon_State_C final : public UBP_ProgressStateWithEndTag_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          EquipOnBegin;                                      // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StateDone;                                         // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CheckTag;                                          // 0x0110(0x0020)(Edit, BlueprintVisible)
	bool                                          SetFogWeaponInventory;                             // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetDarkHinako;                                     // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayEndDuration;                                  // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RequestDelayEnd();
	void OnStateUpdate(float DeltaSeconds);
	void OnStateBegin();
	void HandleEquipLastWeapon();
	void ExecuteUbergraph_BP_Player_RefreshWeapon_State(int32 EntryPoint);
	void ConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Player_RefreshWeapon_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Player_RefreshWeapon_State_C")
	}
	static class UBP_Player_RefreshWeapon_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Player_RefreshWeapon_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Player_RefreshWeapon_State_C;

}

