#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_SpinTheWheel_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Pl_Base_InteractBase_State_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_SpinTheWheel_State.BP_Pl_Base_SpinTheWheel_State_C
// 0x0020 (0x0250 - 0x0230)
class UBP_Pl_Base_SpinTheWheel_State_C final : public UBP_Pl_Base_InteractBase_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_SpinTheWheel_State_C;    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BankID;                                            // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetupReady;                                        // 0x023C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Interact_Target;                                   // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Gameplay_Effect_Class;                             // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ConstructionScript();
	void EnterSetup();
	void ExecuteUbergraph_BP_Pl_Base_SpinTheWheel_State(int32 EntryPoint);
	void GetAnim(class UAnimMontage** Anim);
	double GetPlayerZLocation();
	void OnBlendOut_C4B01E884D1D9AE63CA13687D352E185(class FName NotifyName);
	void OnCompleted_C4B01E884D1D9AE63CA13687D352E185(class FName NotifyName);
	void OnInterrupted_C4B01E884D1D9AE63CA13687D352E185(class FName NotifyName);
	void OnNotifyBegin_C4B01E884D1D9AE63CA13687D352E185(class FName NotifyName);
	void OnNotifyEnd_C4B01E884D1D9AE63CA13687D352E185(class FName NotifyName);
	void OnStateBegin();
	void OnStateEnd();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_SpinTheWheel_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_SpinTheWheel_State_C")
	}
	static class UBP_Pl_Base_SpinTheWheel_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_SpinTheWheel_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_SpinTheWheel_State_C;

}

