#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProgressUFO_FSM

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass BP_ProgressUFO_FSM.BP_ProgressUFO_FSM_C
// 0x1C00 (0x2308 - 0x0708)
class UBP_ProgressUFO_FSM_C final : public UNoceProgressSMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0708(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_2; // 0x0710(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_1; // 0x08A0(0x0190)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_705829E94CB38F6340E27181FD97AC23_LD_Prop; // 0x0A30(0x0190)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_3; // 0x0BC0(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_2; // 0x0D48(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_1; // 0x0ED0(0x0188)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_705829E94CB38F6340E27181FD97AC23_LD_Prop; // 0x1058(0x0188)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_60; // 0x11E0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_59; // 0x1228(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_58; // 0x1270(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_57; // 0x12B8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_56; // 0x1300(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_55; // 0x1348(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_54; // 0x1390(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_53; // 0x13D8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_52; // 0x1420(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_51; // 0x1468(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_50; // 0x14B0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_49; // 0x14F8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_48; // 0x1540(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_47; // 0x1588(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_46; // 0x15D0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_45; // 0x1618(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_44; // 0x1660(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_43; // 0x16A8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_42; // 0x16F0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_41; // 0x1738(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_40; // 0x1780(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_39; // 0x17C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_38; // 0x1810(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_37; // 0x1858(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_36; // 0x18A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_35; // 0x18E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_34; // 0x1930(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_33; // 0x1978(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_32; // 0x19C0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_31; // 0x1A08(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_30; // 0x1A50(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_29; // 0x1A98(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_28; // 0x1AE0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_27; // 0x1B28(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_26; // 0x1B70(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_25; // 0x1BB8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_24; // 0x1C00(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_23; // 0x1C48(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_22; // 0x1C90(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_21; // 0x1CD8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_20; // 0x1D20(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_19; // 0x1D68(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_18; // 0x1DB0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_17; // 0x1DF8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_16; // 0x1E40(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_15; // 0x1E88(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_14; // 0x1ED0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_13; // 0x1F18(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_12; // 0x1F60(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_11; // 0x1FA8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_10; // 0x1FF0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_9; // 0x2038(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_8; // 0x2080(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_7; // 0x20C8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_6; // 0x2110(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_5; // 0x2158(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_4; // 0x21A0(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_3; // 0x21E8(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_2; // 0x2230(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop_1; // 0x2278(0x0048)()
	struct FSMGraphProperty_Runtime               SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_LD_Prop; // 0x22C0(0x0048)()

public:
	void ExecuteUbergraph_BP_ProgressUFO_FSM(int32 EntryPoint);
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_0316C480EDFCC52C58FC39C32AB814F5();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_148A049EFCF328703182023688207C4D();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_1581D7A611D25A61099820CB8DAB7372();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_160F5A58BC04A4A0F3D775C8AA440C80();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_16BE8292A6788590A92CA9DAD8C71841();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_19AA57B89CD064627BD3F780308AA8B7();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_1DA3F9E5B0DC1EAD897784BE174A335F();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_21292BD12B806BB1F2B59768577278CC();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_30DBBAC70AD31544E39571139187BF2F();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_349AF12044C00A13039D06A4E0FA4B07();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_3AA2E41A06C186FF596F1DA9C9B7398C();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_3BE8D017C64852EDA64CE875BB2C06BF();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_3BE8D017C64852EDA64CE875BB2C06BF_1();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_3BE8D017C64852EDA64CE875BB2C06BF_2();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_3BE8D017C64852EDA64CE875BB2C06BF_3();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_40BD6B4192942E536406836D3B317078();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_40BD6B4192942E536406836D3B317078_1();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_40BD6B4192942E536406836D3B317078_2();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_40BD6B4192942E536406836D3B317078_3();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_42E68242927825F6D1F806BEDD37A84E();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_46510D0F03B0D06ED441B23FA203FE44();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_4B35F7501BB40C84C68A9529736FF12C();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_52FDB34ACA6E0C79542622BFB5F7A8D8();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_5747EE2308025715858C5D9E2728A941();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_5E510B7CD986F1951CC15D2A0FE4A07F();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_68F361843462D5BFF4099CA21CF5269C();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_6DDA82AD6BFD7D1163068BCC53EF39A3();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_7365F527E9891626609CAA324485F419();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_737E3D4B8B9EA7FF3EF9A7E94CE0322C();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_74BBB366B1FA1DC7825C004E35C1D154();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_7AA4AEE53F9FF4EABAD0BCE52618E7D7();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_7B577F5AC96A8C46C49FBBD2505257EA();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_7C07EE8AE93DF137AAFFD2C2E5CB78DE();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_7D75C879F3086A043B87FEA07A2B84BC();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_8CE46C790F243F7E8171D183269B40A6();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_9253C269921F8427BA72659DEE43E093();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_9A8EE1DC3EF26151A505079BF27DDEEF();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_9ED70CB3C1555CD38D16CE02F37944AC();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_A128BDA28D7ACFD309157FDB564A8841();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_A30B6C52CB5E8FD3A2A61AB4F816EB6B();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_A3FDFEB1D5ACB55606DA36CA30407E4C();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_A7E0C5101A2568A931C7B6F4756CE01D();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_AD3AAC87C6B305C796F73865156BC46F();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_AE9F53D16D6BA55915F1DB5D069AF875();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_AEC28474733A2B15C3F981D933B9E32B();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_B2F8644288D0A94A50E3813C93F05CA8();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_B40D97A578BF02DAC9786089F937A088();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_BDF6008FE7839D7CA561CC1F035FF19E();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_BE2856ACEB6EFE333FD6630B3C448217();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_C03B41CFF46748B1AE440ECB8C028818();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_C0454EC0B453C2BDD0C00C7CF0015517();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_C75EDFC818BBEE161F6AF0A25A8B5DF2();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_CA11BA0790CAD049D5B902965928BD24();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_CD713A13323458DD0DFC4377E7DDE93A();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_D107072B56DAF3D213299009B1318A9C();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_D6B11A7CB56137E2DA3CDDA372DD0C9A();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_D8320CC7B4BF4DAB96BAD0DDCDD044B6();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_D98A542EA0FA931C88EA01AB99A9DC47();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_E89B1486CA0CF6AE2C860495396EA334();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_FBCFAFC7F956D2A20FBFF4012F5BD573();
	void SMGraphK2Node_GraphPropertyNode_705829E94CB38F6340E27181FD97AC23_FF98CBA5740DEEA451B06A04B453627E();
	void SMGraphK2Node_StateEntryNode_705829E94CB38F6340E27181FD97AC23_Back_To_Title_043D89834A88A9297B0A4BBC615FA641();
	void SMGraphK2Node_StateEntryNode_705829E94CB38F6340E27181FD97AC23_Credit_Long_9AD3C766401CCB2181B02EBFDB3E35A2();
	void SMGraphK2Node_StateEntryNode_705829E94CB38F6340E27181FD97AC23_Pick_Up_Letter_9B0EF77848808FAEE977919E5A14A619();
	void SMGraphK2Node_StateEntryNode_705829E94CB38F6340E27181FD97AC23_Save_Ending_FB630A36450C0E29F4BF65B6DFAFCDFB();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ProgressUFO_FSM_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ProgressUFO_FSM_C")
	}
	static class UBP_ProgressUFO_FSM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ProgressUFO_FSM_C>();
	}
};
DUMPER7_ASSERTS_UBP_ProgressUFO_FSM_C;

}

