#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_KatanaAlter_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Pl_Base_InteractBase_State_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_KatanaAlter_State.BP_Pl_Base_KatanaAlter_State_C
// 0x0038 (0x0268 - 0x0230)
class UBP_Pl_Base_KatanaAlter_State_C final : public UBP_Pl_Base_InteractBase_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_KatanaAlter_State_C;     // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BankID;                                            // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetupReady;                                        // 0x023C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Interact_Target;                                   // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        CheckDuration;                                     // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentDuration;                                   // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartPush;                                         // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanCancel;                                         // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanMoving;                                         // 0x025A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNocePlayerDamageHandleComponent*       Noce_Player_Damage_Handle;                         // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ConstructionScript();
	void EnterSetup();
	void ExecuteUbergraph_BP_Pl_Base_KatanaAlter_State(int32 EntryPoint);
	void GetEnterMontage(class UAnimMontage** Montage);
	double GetPlayerZLocation();
	void GetSuccessMontage(class UAnimMontage** Montage);
	void LeaveSetup();
	void OnBlendOut_7E440D88477958DC928E5FBDDF109AFA(class FName NotifyName);
	void OnBlendOut_CED187804DF3E8B902EF10AE01ABD9CB(class FName NotifyName);
	void OnCompleted_7E440D88477958DC928E5FBDDF109AFA(class FName NotifyName);
	void OnCompleted_CED187804DF3E8B902EF10AE01ABD9CB(class FName NotifyName);
	void OnInterrupted_7E440D88477958DC928E5FBDDF109AFA(class FName NotifyName);
	void OnInterrupted_CED187804DF3E8B902EF10AE01ABD9CB(class FName NotifyName);
	void OnNotifyBegin_7E440D88477958DC928E5FBDDF109AFA(class FName NotifyName);
	void OnNotifyBegin_CED187804DF3E8B902EF10AE01ABD9CB(class FName NotifyName);
	void OnNotifyEnd_7E440D88477958DC928E5FBDDF109AFA(class FName NotifyName);
	void OnNotifyEnd_CED187804DF3E8B902EF10AE01ABD9CB(class FName NotifyName);
	void OnStateBegin();
	void OnStateEnd();
	void OnStateUpdate(float DeltaSeconds);
	void PlayEnterMontage();
	void PlayLeaveMontage();
	void PlaySuccessMontage();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_KatanaAlter_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_KatanaAlter_State_C")
	}
	static class UBP_Pl_Base_KatanaAlter_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_KatanaAlter_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_KatanaAlter_State_C;

}

