#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Player_FillClawTransformFull_State

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Player_FillClawTransformFull_State.BP_Player_FillClawTransformFull_State_C.ExecuteUbergraph_BP_Player_FillClawTransformFull_State
// 0x0018 (0x0018 - 0x0000)
struct BP_Player_FillClawTransformFull_State_C_ExecuteUbergraph_BP_Player_FillClawTransformFull_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNocePlayerClawTransformComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Player_FillClawTransformFull_State_C_ExecuteUbergraph_BP_Player_FillClawTransformFull_State;

}

