#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_ToySaberFocusAttack_State

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SMSystem_structs.hpp"
#include "BP_Pl_Base_Base_State_classes.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_ToySaberFocusAttack_State.BP_Pl_Base_ToySaberFocusAttack_State_C
// 0x0078 (0x0278 - 0x0200)
class UBP_Pl_Base_ToySaberFocusAttack_State_C final : public UBP_Pl_Base_Base_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_ToySaberFocusAttack_State_C; // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<ENocePlayerAnimStateType>              PlayerAnimStates;                                  // 0x0208(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          WantToAttack;                                      // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BankID;                                            // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimID;                                            // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceInputQueueComponent*               InputQueueComponent;                               // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_NoStaminaRegen;                                 // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_Handle_NoStaminaRegen;                          // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLightAttack;                                     // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           Audio_DeflecSfx;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PlayerFSMAttack;                                // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PlayerFSMAttack_LightAttack;                    // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PlayerFSMAttack_HeavyAttack;                    // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_PlayerFSMAttack_FocusAttack;                    // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimMontage*                           MontageToPlay;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CallOnEnterAttackState();
	void ConstructionScript();
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FNoceAttackDeflectResult& DeflectResult);
	void CREATEDELEGATE_PROXYFUNCTION_1(const struct FNoceAttackDeflectResult& DeflectResult);
	void ExecuteUbergraph_BP_Pl_Base_ToySaberFocusAttack_State(int32 EntryPoint);
	void GetMontage(class UAnimMontage** OutMontage);
	void OnAttackHit(const TArray<struct FNoceAttackHitResult>& HitResults);
	void OnBlendOut_590C1CE742B08FDC56614B8CA4452D4D(class FName NotifyName);
	void OnCompleted_590C1CE742B08FDC56614B8CA4452D4D(class FName NotifyName);
	void OnInputAxis(ENoceInputAxis InInputAxis, float InValue);
	void OnInterrupted_590C1CE742B08FDC56614B8CA4452D4D(class FName NotifyName);
	void OnMontageStateChanged(ENoceMontageState NewMontageState);
	void OnNotifyBegin_590C1CE742B08FDC56614B8CA4452D4D(class FName NotifyName);
	void OnNotifyEnd_590C1CE742B08FDC56614B8CA4452D4D(class FName NotifyName);
	void OnStateBegin();
	void OnStateEnd();
	void OnStateUpdate(float DeltaSeconds);
	void SetupWantToAttack();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_ToySaberFocusAttack_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_ToySaberFocusAttack_State_C")
	}
	static class UBP_Pl_Base_ToySaberFocusAttack_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_ToySaberFocusAttack_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_ToySaberFocusAttack_State_C;

}

