#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pickup_KeyItemBase

#include "Basic.hpp"

#include "GameNoce_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pickup_KeyItemBase.BP_Pickup_KeyItemBase_C
// 0x0038 (0x02E8 - 0x02B0)
class ABP_Pickup_KeyItemBase_C : public ANocePickupKeyItem
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          WithoutAllAdditionalTags;                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  WithOutAdditionalTags;                             // 0x02C8(0x0020)(Edit, BlueprintVisible)

public:
	bool BP_PickupCanSpawn();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pickup_KeyItemBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pickup_KeyItemBase_C")
	}
	static class ABP_Pickup_KeyItemBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pickup_KeyItemBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_Pickup_KeyItemBase_C;

}

