#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Hina_NocePlayerState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NoceBase_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pl_Hina_NocePlayerState.BP_Pl_Hina_NocePlayerState_C
// 0x0168 (0x0710 - 0x05A8)
class ABP_Pl_Hina_NocePlayerState_C final : public ANocePlayerState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_DarkHina_BaBrMa_Round1_CH08; // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceShiroRevive2ByProgressComp*        NoceShiroRevive2PP_V4_ByProgressComp;              // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceShiroRevive2ByProgressComp*        NoceShiroRevive2PP_V3_4_ByProgressComp;            // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceShiroRevive2ByProgressComp*        NoceShiroRevive2PP_V3_3_ByProgressComp;            // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceShiroRevive2ByProgressComp*        NoceShiroRevive2PP_V3_2_ByProgressComp;            // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceShiroRevive2ByProgressComp*        NoceShiroRevive2PP_V3_1_ByProgressComp;            // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerRestrictByProgressComp*      BareHandDodge_PlayerRestrictByProgress_Round234;   // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceClawRemoveByProgressComp*          BackMarkRound3_ClawRemoveByProgress_Round234;      // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceClawRemoveByProgressComp*          HandRound2_ClawRemoveByProgress_Round234;          // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceClawRemoveByProgressComp*          Mask_ClawRemoveByProgressRound234;                 // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceClawRemoveByProgressComp*          BackMark_ClawRemoveByProgressRound234;             // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerRestrictByProgressComp*      ChangeWeapon_PlayerRestrictByProgress_Round234;    // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_DarkHina_BaBrMa_Round234;   // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceClawRemoveByProgressComp*          BackMarkRound3_ClawRemoveByProgress_Round1;        // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceClawRemoveByProgressComp*          HandRound2_ClawRemoveByProgress_Round1;            // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_DarkHina_BaBrMa_Round1;     // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_DarkHina_BaBr_Round1;       // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_DarkHina_Default_Round1;    // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_FogHina_Default;            // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_FogHina_Sk;                 // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_FogHina_SkSl;               // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCharMeshByProgressComp*      CharMeshByProgressComp_FogHina_SkSlBa;             // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerRestrictByProgressComp*      ChangeWeapon_PlayerRestrictByProgress_Round1;      // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceClawRemoveByProgressComp*          Mask_ClawRemoveByProgressRound1;                   // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceClawRemoveByProgressComp*          BackMark_ClawRemoveByProgressRound1;               // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerRestrictByProgressComp*      UseShortcutItem_PlayerRestrictByProgress;          // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerRestrictByProgressComp*      BareHandDodge_PlayerRestrictByProgress;            // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceShowByProgressComponent*           NoceShowByProgress;                                // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         HintWidgetPath;                                    // 0x0698(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftClassPath                         NewItemWidgetPath;                                 // 0x06B8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UNocePickPreviewWidget*                 NewItemWidgetRef;                                  // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNocePickMessageWidget*                 PickMessageWidgetRef;                              // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         PickMessageWidgetPath;                             // 0x06E8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsInEvent;                                         // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsingGimmick;                                    // 0x0709(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHealthDanger;                                    // 0x070A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInClawG;                                         // 0x070B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_AddHealth(float AddValue);
	void BP_AddSanity(float AddValue);
	void BP_ApplyFullHealth();
	void BP_ApplyFullSanity();
	void BP_ApplyFullStamina();
	void ExecuteUbergraph_BP_Pl_Hina_NocePlayerState(int32 EntryPoint);
	class UNoceGeneralHintWidget* GetHintWidget();
	void IsNotebookHintBlocked(bool* IsBlocked);
	void OnEnterEvent();
	void OnExitEvent();
	void OnGameplayTagChange(const struct FGameplayTag& Tag, bool TagExists);
	void OnUsingGimmick(bool IsUsing);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveOnPickUpItemEvent(ENoceInventoryType InventoryType, class FName ID, bool PlaySystemHintVO);
	void ReceiveTick(float DeltaSeconds);
	void ShowAddNotebookIDHint();
	void ShowHintWidget(const class FText& HintText, double duration);
	void ShowPickMessage(ENoceInventoryType Type, class FName ID);
	void ShowPickPreviewDialog(ENoceInventoryType InventoryType, class FName ID);
	void UpdateHPWarnings(bool InSourceFormEvent);
	void UpdateIsHealthDanger();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Hina_NocePlayerState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Hina_NocePlayerState_C")
	}
	static class ABP_Pl_Hina_NocePlayerState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pl_Hina_NocePlayerState_C>();
	}
};
DUMPER7_ASSERTS_ABP_Pl_Hina_NocePlayerState_C;

}

