#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Hina

#include "Basic.hpp"

#include "ECharMesh_Hina_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Pl_Base_NocePlayerCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pl_Hina.BP_Pl_Hina_C
// 0x0050 (0x14B0 - 0x1460)
class ABP_Pl_Hina_C final : public ABP_Pl_Base_NocePlayerCharacter_C
{
public:
	uint8                                         Pad_1454[0x4];                                     // 0x1454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Hina_C;                       // 0x1458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh_Tail;                                 // 0x1460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh_Ear;                                  // 0x1468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FX_Pl_UnderwearFog;                             // 0x1470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom;                                             // 0x1478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNeoInteractiveMapComponent*            NeoInteractiveMap;                                 // 0x1480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Pl_NoceIKController_C*              BP_Pl_NoceIKController;                            // 0x1488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh_Hair;                                 // 0x1490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh_Head;                                 // 0x1498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   EyeLacrimalFluidMaterialSlot;                      // 0x14A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharMesh_Hina                                HinaCharMeshType;                                  // 0x14A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void BPI_ShowCloth(class FName InValue);
	void ExecuteUbergraph_BP_Pl_Hina(int32 EntryPoint);
	void HandleOnEnterExitEvent();
	void InitializeSweetLight();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetHinaCharMeshType(ECharMesh_Hina InValue);
	void Show_Cloth(class FName InValue);
	void UnregisterWind();
	void UpdateEyeLacrimalFluid();

	bool IsInCinematic() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Hina_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Hina_C")
	}
	static class ABP_Pl_Hina_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pl_Hina_C>();
	}
};
DUMPER7_ASSERTS_ABP_Pl_Hina_C;

}

