#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_NarrowMove_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "BP_Pl_Base_InteractBase_State_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_NarrowMove_State.BP_Pl_Base_NarrowMove_State_C
// 0x0038 (0x0268 - 0x0230)
class UBP_Pl_Base_NarrowMove_State_C final : public UBP_Pl_Base_InteractBase_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_NarrowMove_State_C;      // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BankID;                                            // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetupReady;                                        // 0x023C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NarrowMoveIndicator_C*              NarrowMoveIndicator;                               // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EnterMontage;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           IdleMontage;                                       // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMoving;                                          // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanAcceptInput;                                    // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RefineTimer;                                       // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ConstructionScript();
	void DelayAcceptInput();
	void EnterSetup();
	void ExecuteUbergraph_BP_Pl_Base_NarrowMove_State(int32 EntryPoint);
	void GetBackwardMoveMontage(class UAnimMontage** Montage);
	void GetEnterMontage(class UAnimMontage** Montage);
	void GetForwardMoveMontage(class UAnimMontage** Montage);
	void GetIdleMontage(class UAnimMontage** Montage);
	void GetLocationAndRotationByMaker(class USceneComponent* InMaker, bool InIsStartMaker, struct FVector* Location, struct FRotator* Rotation);
	bool IsPlayingEnterMontage();
	bool IsPlayingIdleMontage();
	void LeaveSetup();
	void OnBlendOut_2570E1874CFCC4AA5CE0B7897EE511E0(class FName NotifyName);
	void OnBlendOut_3536E3244F35CBD20B5749A14672DC64(class FName NotifyName);
	void OnBlendOut_7B506E114BD58A7A30FFB09F545C0631(class FName NotifyName);
	void OnBlendOut_D00667FC4CF05876A45EDC9CF9701A94(class FName NotifyName);
	void OnCompleted_2570E1874CFCC4AA5CE0B7897EE511E0(class FName NotifyName);
	void OnCompleted_3536E3244F35CBD20B5749A14672DC64(class FName NotifyName);
	void OnCompleted_7B506E114BD58A7A30FFB09F545C0631(class FName NotifyName);
	void OnCompleted_D00667FC4CF05876A45EDC9CF9701A94(class FName NotifyName);
	void OnInputAxis(ENoceInputAxis InInputAxis, float InValue);
	void OnInterrupted_2570E1874CFCC4AA5CE0B7897EE511E0(class FName NotifyName);
	void OnInterrupted_3536E3244F35CBD20B5749A14672DC64(class FName NotifyName);
	void OnInterrupted_7B506E114BD58A7A30FFB09F545C0631(class FName NotifyName);
	void OnInterrupted_D00667FC4CF05876A45EDC9CF9701A94(class FName NotifyName);
	void OnMontageStateChanged(ENoceMontageState NewMontageState);
	void OnNotifyBegin_2570E1874CFCC4AA5CE0B7897EE511E0(class FName NotifyName);
	void OnNotifyBegin_3536E3244F35CBD20B5749A14672DC64(class FName NotifyName);
	void OnNotifyBegin_7B506E114BD58A7A30FFB09F545C0631(class FName NotifyName);
	void OnNotifyBegin_D00667FC4CF05876A45EDC9CF9701A94(class FName NotifyName);
	void OnNotifyEnd_2570E1874CFCC4AA5CE0B7897EE511E0(class FName NotifyName);
	void OnNotifyEnd_3536E3244F35CBD20B5749A14672DC64(class FName NotifyName);
	void OnNotifyEnd_7B506E114BD58A7A30FFB09F545C0631(class FName NotifyName);
	void OnNotifyEnd_D00667FC4CF05876A45EDC9CF9701A94(class FName NotifyName);
	void OnStateBegin();
	void OnStateEnd();
	void OnStateUpdate(float DeltaSeconds);
	void PlayBackwardMoveMontage();
	void PlayBackwardOutMontage();
	void PlayEnterMontage();
	void PlayForwardMoveMontage();
	void PlayForwardOutMontage();
	void PlayIdleMontage();
	void ResetNarrowMoveVariables();
	void Update(double InDeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_NarrowMove_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_NarrowMove_State_C")
	}
	static class UBP_Pl_Base_NarrowMove_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_NarrowMove_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_NarrowMove_State_C;

}

