#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_NocePlayerCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pl_Base_NocePlayerCharacter.BP_Pl_Base_NocePlayerCharacter_C
// 0x0390 (0x1460 - 0x10D0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_Pl_Base_NocePlayerCharacter_C : public ANocePlayerCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNocePlayerShowHideComponent*           NocePlayerShowHide;                                // 0x10D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCapsuleShrinkComp*           NocePlayerCapsuleShrinkComp;                       // 0x10E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavModifierComponent*                  NavModifier;                                       // 0x10E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_NoceRagdollController_C*           BPC_NoceRagdollController;                         // 0x10F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkinnedDecalSampler*                   SkinnedDecalSampler;                               // 0x10F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerBroochComponent*             NocePlayerBrooch;                                  // 0x1100(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerInputHelperComponent*        NocePlayerInputHelper;                             // 0x1108(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget_ClawAttrackSoulHint;                        // 0x1110(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget_ClawAttrackSoul;                            // 0x1118(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_ENV;                                     // 0x1120(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_MOON;                                    // 0x1128(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_CH;                                      // 0x1130(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SweetLightSpringArm;                               // 0x1138(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_DistanceProbe;                                  // 0x1140(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget_LockOnTarget;                               // 0x1148(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceLockOnTargetComponent*             NoceLockOnTarget;                                  // 0x1150(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerLookTargetComponent*         NocePlayerLookTarget;                              // 0x1158(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerKatanaComponent*             NocePlayerKatana;                                  // 0x1160(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerChargeComponent*             NocePlayerCharge;                                  // 0x1168(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Pl_NoceWalkToComponent_C*           NoceWalkToComponent;                               // 0x1170(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      JustDodgeCollision_Capsule;                        // 0x1178(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerClawTransformComponent*      NocePlayerClawTransform;                           // 0x1180(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceRootMotionScaleComponent*          NoceRootMotionScale;                               // 0x1188(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceMapIconComponent*                  NoceMapIcon;                                       // 0x1190(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NocePlayerCameraRotateComponent_C*  NocePlayerCameraRotate;                            // 0x1198(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NoceFootStepVFXComponent_C*         NoceFootStepVFXComponent;                          // 0x11A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceSpeakerRegister*                   NoceSpeakerRegister;                               // 0x11A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioCueActorSpawner*               NeoAudioCueActorSpawner;                           // 0x11B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TempLampPos;                                       // 0x11B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerCameraComponent*             PlayerFollowCamera;                                // 0x11C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UATPCCameraComponent*                   ATPCCamera;                                        // 0x11C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DistanceFieldSphere_Head;                          // 0x11D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DistanceFieldSphere_Body1;                         // 0x11D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DistanceFieldSphere_Body;                          // 0x11E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DistanceFieldSphere_LowerArm;                      // 0x11E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DistanceFieldSphere_RLowerArm;                     // 0x11F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMediaSoundComponent*                   MediaSound;                                        // 0x11F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioCueOnStopTrigger*              NeoAudioCueOnStopTrigger;                          // 0x1200(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DataLayerTriggerComponent_C*        BP_DataLayerTriggerComponent;                      // 0x1208(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NoceFogControlComponent_C*          BP_NoceFogControlComponent;                        // 0x1210(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceSuperArmorComponent*               NoceSuperArmor;                                    // 0x1218(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Pl_NoceSanityComponent_C*           NoceSanity;                                        // 0x1220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NoceHitPerformComponent_C*          NoceHitPerform;                                    // 0x1228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerDamageHandleComponent*       NocePlayerDamageHandle;                            // 0x1230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerAttackInfoComponent*         NocePlayerAttackInfo;                              // 0x1238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Pl_AutoAimComponent_C*              AutoAimComponent;                                  // 0x1240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceTimeComponent*                     NoceTime;                                          // 0x1248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceInputQueueComponent*               NoceInputQueue;                                    // 0x1250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceAttackTraceComponent*              NoceAttackTrace;                                   // 0x1258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceInvincibleComponent*               NoceInvincible;                                    // 0x1260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerStaminaComponent*            NocePlayerStamina;                                 // 0x1268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                MotionWarping;                                     // 0x1270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Pl_Base_InteractInfoComp_C*         BP_InteractInfoComp;                               // 0x1278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioCueToSwitch*                   NeoAudioCueToSwitch;                               // 0x1280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceMontageStateMonitorComponent*      NoceMontageStateMonitor;                           // 0x1288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNoceAnimCancelComponent*               NoceAnimCancel;                                    // 0x1290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioCueAutoTrigger*                NeoAudioCueAutoTrigger;                            // 0x1298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioCueToTrigger*                  NeoAudioCueToTrigger;                              // 0x12A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimPlusBankComponent*                 AnimPlusBank;                                      // 0x12A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USMStateMachineComponent*               SMStateMachine;                                    // 0x12B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioSoundComponent*                NeoAudioSound;                                     // 0x12B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        ResetBlendTime;                                    // 0x12C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnAutoAim;                                         // 0x12C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 GE_Battling;                                       // 0x12D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_BattleStatusTimerTick;                          // 0x12E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_InEvent;                                        // 0x12E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PreviousCamera;                                    // 0x12F0(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Pl_DebugNoCostStamina;                          // 0x12F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Pl_DebugNoStaminaTiredTimerTick;                // 0x1300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Pl_DebugNoCostClawTransform;                    // 0x1308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_C*                             WBP_HUD;                                           // 0x1310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AActor* Attacker)> OnDamage;                                 // 0x1318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    LanternDisableSweetLight;                          // 0x1328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                WalkToLocation;                                    // 0x1338(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WalkToLocation_TimerHandle;                        // 0x1350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           JustDodgeTimerHandle;                              // 0x1358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         JustDodgeTimeDilation;                             // 0x1360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JustDodgeDuration;                                 // 0x1364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CachedDistance;                                    // 0x1368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANoceEnemyCharacter*                    JustDodgeCauser;                                   // 0x1370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LevelTimerHandle;                                  // 0x1378(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AudioDistanceProbeRatio;                           // 0x1380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1384[0x4];                                     // 0x1384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DoNotSaveCameraMode;                               // 0x1388(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        OverwriteIdleVarTime;                              // 0x13A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightHandPosition;                                 // 0x13B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftHandPosition;                                  // 0x13C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LockInputToken;                                    // 0x13E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LockInputTimerHandle;                              // 0x13E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class FName>                             TargetGrids;                                       // 0x13F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Previous_Camera;                                   // 0x1440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponDroped;                                      // 0x1448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1449[0x3];                                     // 0x1449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   JustDodgeCauserCombo;                              // 0x144C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_Claw_GIn_Sequence();
	void ApplyBattleStatusTimerTick();
	void ApplyBattling();
	void ApplyClawGStatusTimerTickInSequence();
	void ApplyDamageWithReaction(double InHealthDamage, double InWinceDamage, double InMaxSanityDamage, double InStaminaDamage, float InMaxSanityDamageToHealthDamageRatio, bool IsForceWince, ENoceWinceType InWinceType, ENoceDeathType InDeathType, bool InCheckInvincible_, bool InHealthDamageEffectedByDamageRatio, bool InHealthDamageApplyGutsCheck, bool InIsLimitHealth, bool InCheckOmamoriKagami, bool InCheckSuperArmor);
	void ApplyWinceType(ENoceWinceType InWinceType);
	void AudioDebugDraw();
	void BPI_ApplyBattleStatusTimerTick();
	void BPI_ApplyBattling();
	void BPI_ApplyCameraMode(const struct FGameplayTag& CameraMode, bool WithInterpolation, bool ForceSet);
	void BPI_ApplyCameraReset();
	void BPI_ApplyClawGInSequence();
	void BPI_ApplyClawGStatusTimerTickInSequence();
	void BPI_ApplyCustomCamera(const struct FGameplayTag& CameraMode, bool WithInterpolation);
	void BPI_ApplyDamageWithReaction(double InHealthDamage, double InWinceDamage, double InMaxSanityDamage, double InStaminaDamage, double InMaxSanityDamageToHealthDamageRatio, bool IsForceWince, ENoceWinceType InWinceType, ENoceDeathType InDeathType, bool InCheckInvincible_, bool InHealthDamageEffectedByDamageRatio, bool InHealthDamageApplyGutsCheck, bool InIsLimitHealth, bool InCheckOmamoriKagami, bool InCheckSuperArmor);
	void BPI_ClearWalkToLocationTimerHandle();
	void BPI_DebugPlayerDeath(int32 DeathType, int32 DeathDir);
	void BPI_DebugPlayerInvincbile(bool InEnable);
	void BPI_DebugPlayerNoCostStamina(bool InEable);
	void BPI_DebugPlayerNoStaminaTiredTimerTick(bool InEnable);
	void BPI_DebugSetNoCostClawTransform(bool InEnable);
	void BPI_DebugTogglePlayerInvincible();
	void BPI_DropWeapon(const struct FVector& Impulse);
	void BPI_EnableForceStay(bool InEnable);
	void BPI_EnableMaterialsClaw(bool InEnable);
	void BPI_EnableMaterialsClawG(bool InEnable);
	void BPI_EndFaceTargetCameraMode();
	void BPI_EndWeddingCameraMode();
	void BPI_GetAudioProbeLocation(struct FVector* Location);
	void BPI_GetCameraViewRotation(struct FRotator* Rotation);
	void BPI_GetCounterAutoAimSearchInfo(double* OutRadius, double* OutHalfAngle);
	void BPI_HandleDamage(const struct FNoceAttackHitResult& InAttackHitResult);
	void BPI_HandleOnSlopeChanged(bool InIsOnSlope);
	void BPI_InRealBattleStatus(bool* OutValue);
	void BPI_LockInputWithDuration(bool InAcceptAction, bool InAcceptAxis, bool InAcceptUIAction, bool InAcceptCamera, class FName InToken, double InDuration);
	void BPI_RemoveBattling();
	void BPI_ResetCustomCamera(bool WithInterpolation);
	void BPI_ResetToPreviousCamera();
	void BPI_SetCameraViewRotation(const struct FRotator& Rotation);
	void BPI_SetClawFurWPOIntensityForCutscene(double InValue);
	void BPI_SetCollisionResponseIgnorePawn(bool Ignore);
	void BPI_SetPlayerIdleVarInt(int32 IdleVarInt);
	void BPI_SetPlayerIdleVarTime(double OverwriteIdleVarTime_0);
	void BPI_ShowCloth(class FName InValue);
	void BPI_StartFaceTargetCameraMode(class AActor* InTargetActor);
	void BPI_StartFaceTargetCameraModeWithRotation(const struct FRotator& InRotation);
	void BPI_StartRunTo(const struct FRotator& InRunToRotation, double InRunToDuration, bool InLimitInput);
	void BPI_StartWeddingCameraMode(const struct FRotator& InRotation);
	void BPI_StopWalking(bool IsStop);
	void BPI_SwitchWeaponAudioType(const struct FGameplayTag& InSwitchValue);
	void BPI_TestHellModeDamage(class UNoceHellModeDataAsset* InHellModeDataAsset);
	void BPI_WalkToLocation(double InStartDelayTime, const struct FVector& InTargetLocation, double InCameraLerpTime, bool InLimitInput);
	void BPI_WalkToWithCameraRotation(double InStartDelayTime, const struct FRotator& InCameraRotation, const struct FVector& InWalkToLocation, double InCameraLerpTime, bool InLimitInput);
	void ClearLockInput();
	void DebugPlayerDeath(int32 DeathType, int32 DeathDir);
	void DebugPlayerInvincible(bool InEnabled);
	void DebugPlayerNoCostClawTransform(bool InEnbale);
	void DebugPlayerNoCostStamina(bool InEnbale);
	void DebugPlayerNoStaminaTiredTimerTick(bool InEnable);
	void DebugTogglePlayerInvincbile();
	void DoEndLevelCameraMode();
	void DoStartLevelCameraMode(const struct FGameplayTag& InCameraModeTag, const struct FRotator& InRotation);
	void EndCapsuleShrink();
	void ExecuteUbergraph_BP_Pl_Base_NocePlayerCharacter(int32 EntryPoint);
	class AActor* FindCounterTarget_BP(bool InCounterHint, bool InFromRealInput);
	void Handle_Load_Record();
	void HandleAxeDefenseCounter(struct FNoceAttackHitResult& InAttackHitResult, bool InCheckOmamoriKagami, bool* SkipDamage, bool* SkipHitPerform, bool* SkipDamageAction, ENoceWinceType* OutWinceType);
	void HandleClawTransform_BP(bool InTransformToClawG);
	void HandleDamage(const struct FNoceAttackHitResult& AttackHitResult);
	void HandleEventModeChange();
	void HandleInteractInterruptedByDamage();
	void HandleJust_DodgeEnd();
	void HandleJustDodge_BP(const struct FNoceAttackHitResult& InHitResult);
	void HandleKatanaAutoDefense(struct FNoceAttackHitResult& InHitResult, bool InCheckOmamoriKagami, bool* OutSkipDamage, bool* OutSkipHitPerform, bool* OutSkipDamageAction, ENoceWinceType* OutWinceType);
	void HandleOnAttributeSetInitialized();
	void HandleOnPossessed(bool InPossessed);
	void HandleOnSlopeChanged(bool InIsOnSlope);
	void HandleWaitForLevelReady_BP();
	void Initialize();
	void InitializeHUD();
	void InitializeSweetLight();
	void InpActEvt_Delete_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_PageDown_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_PageUp_K2Node_InputKeyEvent_1(const struct FKey& Key);
	bool IsDamageTriggerJustDodge_BP(const struct FNoceAttackHitResult& InHitResult);
	bool IsHandlingJustDodge();
	bool IsJustDodgeCollisionEnabled_BP();
	void IsReachTargetLocation(bool* IsReached);
	void IsUsingBossCamera(bool* Value);
	void IsUsingOnSlopeCamera(bool* Value);
	void OnPreDamageHitHandler(float InHealthDamage, float InMaxSanityDamage);
	void OnRagdollStatusChanged(ENoceRagdollStatus NewStatus);
	void OnWeaponChanged_BP(class ANoceWeapon* NewWeapon);
	void OnWeaponChangedForSweetLight(class ANoceWeapon* NewWeapon);
	void ProcessCharMeshType_BP(const struct FNoceCharMeshDataRow& InDataRow);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveOnReviveEvent();
	void ReceivePossessed(class AController* NewController);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveUnpossessed(class AController* OldController);
	void RemoveBattling();
	void RemoveHUD();
	void ResetCustomCamera(bool bWithInterpolation);
	void ResetToPreviousCamera();
	void SaveCurrentCamera();
	void SetupAudioDistanceProbe();
	void SetupWinceDirection(double InAngle, bool InIsInvertWinceDirection);
	void ShowHidePlayer_BP(bool InShow, bool InAdjustInput);
	void StartCapsuleShrink();
	void StopCharacterMontage();
	void SwitchWeaponAudioType(const struct FGameplayTag& InSwitchValue);
	void UnregisterSweetLight();
	void UpdateAudioDistanceProbeRatio();
	void Use_Camera_Mode(const struct FGameplayTag& CameraMode, bool WithInterpolation, bool ForceSet);
	void UseBossCamera();
	void UseClawGCamera();
	void UseCustomCamera(const struct FGameplayTag& CameraMode, bool bWithInterpolation);
	void UseDefaultCamera();
	void UseIndoorCamera();
	void UseOnSlopeCamera();
	void WaitForLevelReady();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_NocePlayerCharacter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_NocePlayerCharacter_C")
	}
	static class ABP_Pl_Base_NocePlayerCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pl_Base_NocePlayerCharacter_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_Pl_Base_NocePlayerCharacter_C;

}

