#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_NoceSanityComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pl_NoceSanityComponent.BP_Pl_NoceSanityComponent_C
// 0x0090 (0x0438 - 0x03A8)
class UBP_Pl_NoceSanityComponent_C final : public UNoceSanityComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSoftObjectPath                        Audio_SetFocusStateOn;                             // 0x03B0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Audio_SetFocusStateOff;                            // 0x03D0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Audio_SetWeakState;                                // 0x03F0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        Audio_SetNormalState;                              // 0x0410(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ANocePlayerCharacter*                   NocePlayerCharacter;                               // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AudioFocusOff();
	void AudioFocusOn();
	void AudioStopWeakSFX();
	void ExecuteUbergraph_BP_Pl_NoceSanityComponent(int32 EntryPoint);
	void HandleFocusEnd();
	void HandleFocusStart();
	void HandleSanityWeakEnd();
	void HandleSanityWeakStart();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_NoceSanityComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_NoceSanityComponent_C")
	}
	static class UBP_Pl_NoceSanityComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_NoceSanityComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_NoceSanityComponent_C;

}

