#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_Ladder_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "BP_Pl_Base_InteractBase_State_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_Ladder_State.BP_Pl_Base_Ladder_State_C
// 0x0048 (0x0278 - 0x0230)
class UBP_Pl_Base_Ladder_State_C final : public UBP_Pl_Base_InteractBase_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_Ladder_State_C;          // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BankID;                                            // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetupReady;                                        // 0x023C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           IdleMontage;                                       // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMoving;                                          // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           EnterMontage;                                      // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_LadderIndicator_C> BPI_LadderIndicator;                              // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeftHandUp;                                      // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           IdleVarTimer;                                      // 0x0270(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ConstructionScript();
	void CountIdleVarStart();
	void CountIdleVarStop();
	void EnterSetup();
	void ExecuteUbergraph_BP_Pl_Base_Ladder_State(int32 EntryPoint);
	void GetEnterMontage(class UAnimMontage** Montage);
	void GetIdleMontage(class UAnimMontage** Montage);
	void GetLocationAndRotationByMaker(class USceneComponent* InMaker, bool InAdjustForGround, struct FVector* Location, struct FRotator* Rotation);
	void GetMoveDownMontage(class UAnimMontage** Montage);
	void GetMoveUpMontage(class UAnimMontage** Montage);
	bool IsPlayingEnterMontage();
	bool IsPlayingIdleMontage();
	void LeaveSetup();
	void OnBlendOut_049257F24B118FB34C822FA5DED3194A(class FName NotifyName);
	void OnBlendOut_20AD9E924B3AFEF24DB336B3E2A7C955(class FName NotifyName);
	void OnBlendOut_329318D044CDCB13F8AE2EAD46661B74(class FName NotifyName);
	void OnBlendOut_72D9271047FDE861715434A0E6C02EDC(class FName NotifyName);
	void OnBlendOut_805814EC4C9DC91C2B6B46AAD6B67FB7(class FName NotifyName);
	void OnCompleted_049257F24B118FB34C822FA5DED3194A(class FName NotifyName);
	void OnCompleted_20AD9E924B3AFEF24DB336B3E2A7C955(class FName NotifyName);
	void OnCompleted_329318D044CDCB13F8AE2EAD46661B74(class FName NotifyName);
	void OnCompleted_72D9271047FDE861715434A0E6C02EDC(class FName NotifyName);
	void OnCompleted_805814EC4C9DC91C2B6B46AAD6B67FB7(class FName NotifyName);
	void OnInputAxis(ENoceInputAxis InInputAxis, float InValue);
	void OnInterrupted_049257F24B118FB34C822FA5DED3194A(class FName NotifyName);
	void OnInterrupted_20AD9E924B3AFEF24DB336B3E2A7C955(class FName NotifyName);
	void OnInterrupted_329318D044CDCB13F8AE2EAD46661B74(class FName NotifyName);
	void OnInterrupted_72D9271047FDE861715434A0E6C02EDC(class FName NotifyName);
	void OnInterrupted_805814EC4C9DC91C2B6B46AAD6B67FB7(class FName NotifyName);
	void OnMontageStateChanged(ENoceMontageState NewMontageState);
	void OnNotifyBegin_049257F24B118FB34C822FA5DED3194A(class FName NotifyName);
	void OnNotifyBegin_20AD9E924B3AFEF24DB336B3E2A7C955(class FName NotifyName);
	void OnNotifyBegin_329318D044CDCB13F8AE2EAD46661B74(class FName NotifyName);
	void OnNotifyBegin_72D9271047FDE861715434A0E6C02EDC(class FName NotifyName);
	void OnNotifyBegin_805814EC4C9DC91C2B6B46AAD6B67FB7(class FName NotifyName);
	void OnNotifyEnd_049257F24B118FB34C822FA5DED3194A(class FName NotifyName);
	void OnNotifyEnd_20AD9E924B3AFEF24DB336B3E2A7C955(class FName NotifyName);
	void OnNotifyEnd_329318D044CDCB13F8AE2EAD46661B74(class FName NotifyName);
	void OnNotifyEnd_72D9271047FDE861715434A0E6C02EDC(class FName NotifyName);
	void OnNotifyEnd_805814EC4C9DC91C2B6B46AAD6B67FB7(class FName NotifyName);
	void OnStateBegin();
	void OnStateEnd();
	void PlayEnterMontage();
	void PlayIdleMontage();
	void PlayIdleVar();
	void PlayMoveDownMontage();
	void PlayMoveUpMontage();
	void PlayOutMontage(bool InPlayUpOut);
	void SetupLadderDownOutMotionWarp();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_Ladder_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_Ladder_State_C")
	}
	static class UBP_Pl_Base_Ladder_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_Ladder_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_Ladder_State_C;

}

