#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayDialogTrigger

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_PlayerTrigger_Base_classes.hpp"
#include "S_PlayerTriggerElement_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayDialogTrigger.BP_PlayDialogTrigger_C
// 0x0038 (0x03E0 - 0x03A8)
class ABP_PlayDialogTrigger_C final : public ABP_PlayerTrigger_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayDialogTrigger_C;             // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FNoceDialogDataRowHandle               DialogRow;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, NoDestructor)
	bool                                          CheckIfDone;                                       // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_PlayerTriggerElement>        TriggerWhenDone;                                   // 0x03D0(0x0010)(Edit, BlueprintVisible)

public:
	void DoOnBeginOverlap(class AActor* InPawn);
	void ExecuteUbergraph_BP_PlayDialogTrigger(int32 EntryPoint);
	class FString GetDebugTriggerInfo();
	class FString GetDebugTriggerTitle();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayDialogTrigger_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayDialogTrigger_C")
	}
	static class ABP_PlayDialogTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayDialogTrigger_C>();
	}
};
DUMPER7_ASSERTS_ABP_PlayDialogTrigger_C;

}

