#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_InteractBase_State

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"
#include "BP_Pl_Base_Base_State_classes.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_InteractBase_State.BP_Pl_Base_InteractBase_State_C
// 0x0030 (0x0230 - 0x0200)
class UBP_Pl_Base_InteractBase_State_C : public UBP_Pl_Base_Base_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_InteractBase_State_C;    // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_PlayerFSM_Interact;                             // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<ENocePlayerAnimStateType>              PlayerAnimStates;                                  // 0x0210(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         OriginalBattleStatusTime;                          // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RemainBattleStatusTime;                            // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ConstructionScript();
	void ExecuteUbergraph_BP_Pl_Base_InteractBase_State(int32 EntryPoint);
	void LeaveSetup();
	void OnInputAxis(ENoceInputAxis InInputAxis, float InValue);
	void OnMontageStateChanged(ENoceMontageState NewMontageState);
	void OnStateBegin();
	void OnStateEnd();
	void OnStateUpdate(float DeltaSeconds);
	void RecordMontage(class UAnimMontage* InMontage);
	void SetBattleStatusTime(float InMagnitude);
	void SetupRemainBattleStatusTime();
	void SetupWantToAttack();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_InteractBase_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_InteractBase_State_C")
	}
	static class UBP_Pl_Base_InteractBase_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_InteractBase_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_InteractBase_State_C;

}

