#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_PullUpWellBucket_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Pl_Base_InteractBase_State_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C
// 0x0040 (0x0270 - 0x0230)
class UBP_Pl_Base_PullUpWellBucket_State_C final : public UBP_Pl_Base_InteractBase_State_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Pl_Base_PullUpWellBucket_State_C; // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BankID;                                            // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetupReady;                                        // 0x023C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CheckDuration;                                     // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Interact_Target;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          StartPull;                                         // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentDuration;                                   // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Success_Times;                                     // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Success_Times;                             // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanMoving;                                         // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanCancel;                                         // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CheckSuccessTimes();
	void ConstructionScript();
	void EnterSetup();
	void ExecuteUbergraph_BP_Pl_Base_PullUpWellBucket_State(int32 EntryPoint);
	void GetEnterMontage(class UAnimMontage** Montage);
	void GetHoldMontage(class UAnimMontage** Montage);
	void GetLeaveMontage(class UAnimMontage** Montage);
	void GetMovingMontage(class UAnimMontage** Montage);
	double GetPlayerZLocation();
	void GetSuccessMontage(class UAnimMontage** Montage);
	void LeaveSetup();
	void OnBlendOut_1269B0BE46A8A8811CE44C8B2FF0E89E(class FName NotifyName);
	void OnBlendOut_86756FC94361FD94D8CEAF99EA75C8AE(class FName NotifyName);
	void OnBlendOut_BD4A821E4B22D17CDE0504A157F74D64(class FName NotifyName);
	void OnBlendOut_CFCBE47C445CAF877031BAAE8C5AE391(class FName NotifyName);
	void OnBlendOut_D2853A20494D5027CCC7C9B3680E3D77(class FName NotifyName);
	void OnCompleted_1269B0BE46A8A8811CE44C8B2FF0E89E(class FName NotifyName);
	void OnCompleted_86756FC94361FD94D8CEAF99EA75C8AE(class FName NotifyName);
	void OnCompleted_BD4A821E4B22D17CDE0504A157F74D64(class FName NotifyName);
	void OnCompleted_CFCBE47C445CAF877031BAAE8C5AE391(class FName NotifyName);
	void OnCompleted_D2853A20494D5027CCC7C9B3680E3D77(class FName NotifyName);
	void OnInterrupted_1269B0BE46A8A8811CE44C8B2FF0E89E(class FName NotifyName);
	void OnInterrupted_86756FC94361FD94D8CEAF99EA75C8AE(class FName NotifyName);
	void OnInterrupted_BD4A821E4B22D17CDE0504A157F74D64(class FName NotifyName);
	void OnInterrupted_CFCBE47C445CAF877031BAAE8C5AE391(class FName NotifyName);
	void OnInterrupted_D2853A20494D5027CCC7C9B3680E3D77(class FName NotifyName);
	void OnNotifyBegin_1269B0BE46A8A8811CE44C8B2FF0E89E(class FName NotifyName);
	void OnNotifyBegin_86756FC94361FD94D8CEAF99EA75C8AE(class FName NotifyName);
	void OnNotifyBegin_BD4A821E4B22D17CDE0504A157F74D64(class FName NotifyName);
	void OnNotifyBegin_CFCBE47C445CAF877031BAAE8C5AE391(class FName NotifyName);
	void OnNotifyBegin_D2853A20494D5027CCC7C9B3680E3D77(class FName NotifyName);
	void OnNotifyEnd_1269B0BE46A8A8811CE44C8B2FF0E89E(class FName NotifyName);
	void OnNotifyEnd_86756FC94361FD94D8CEAF99EA75C8AE(class FName NotifyName);
	void OnNotifyEnd_BD4A821E4B22D17CDE0504A157F74D64(class FName NotifyName);
	void OnNotifyEnd_CFCBE47C445CAF877031BAAE8C5AE391(class FName NotifyName);
	void OnNotifyEnd_D2853A20494D5027CCC7C9B3680E3D77(class FName NotifyName);
	void OnStateBegin();
	void OnStateEnd();
	void OnStateUpdate(float DeltaSeconds);
	void PlayEnterMontage();
	void PlayHoldMontage();
	void PlayLeaveMontage();
	void PlayMovingMontage();
	void PlaySuccessMontage();
	void ResetHold();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pl_Base_PullUpWellBucket_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pl_Base_PullUpWellBucket_State_C")
	}
	static class UBP_Pl_Base_PullUpWellBucket_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pl_Base_PullUpWellBucket_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Pl_Base_PullUpWellBucket_State_C;

}

