#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_PullUpWellBucket_State

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.CheckSuccessTimes
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_CheckSuccessTimes final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_CheckSuccessTimes;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.ConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_ConstructionScript final
{
public:
	ESMExecutionEnvironment                       CallFunc_WithExecutionEnvironment_ExecutionEnvironment; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_ConstructionScript;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.EnterSetup
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_EnterSetup final
{
public:
	double                                        CallFunc_GetPlayerZLocation_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well;            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPI_GetSuccessTimes_SuccessTimes;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPI_GetSuccessTimes_CurrentSuccessTimes;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BPI_GetCurrentDuration_CurrentDuration;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BPI_GetCheckDuration_CheckDuration;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BPI_GetMotionWarpMarker_OutVector;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BPI_GetMotionWarpMarker_OutRotation;      // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BPI_DoMotionWarp_Value;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_EnterSetup;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.ExecuteUbergraph_BP_Pl_Base_PullUpWellBucket_State
// 0x03F8 (0x03F8 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_ExecuteUbergraph_BP_Pl_Base_PullUpWellBucket_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSkipThisState_CanSkip;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_22;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_21;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_20;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_22;           // 0x0240(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetEnterMontage_Montage;                  // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetHoldMontage_Montage;                   // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetSuccessMontage_Montage;                // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetLeaveMontage_Montage;                  // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_24;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_23;           // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well;            // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_23;                  // 0x02DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well_1;          // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well_2;          // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerController*                  CallFunc_GetNocePlayerController_ReturnValue;      // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputActionDownTime_ReturnValue;       // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_24;           // 0x0334(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSuccessTimes_ReturnValue;            // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346[0x2];                                      // 0x0346(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well_3;          // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMovingMontage_Montage;                 // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well_4;          // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_4; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well_5;          // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well_6;          // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_ExecuteUbergraph_BP_Pl_Base_PullUpWellBucket_State;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.GetEnterMontage
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_GetEnterMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_AnimID;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromBank_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_GetEnterMontage;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.GetHoldMontage
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_GetHoldMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_AnimID;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromBank_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_GetHoldMontage;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.GetLeaveMontage
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_GetLeaveMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_AnimID;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromBank_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_GetLeaveMontage;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.GetMovingMontage
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_GetMovingMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_AnimID;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromBank_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_GetMovingMontage;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.GetPlayerZLocation
// 0x0050 (0x0050 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_GetPlayerZLocation final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_GetPlayerZLocation;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.GetSuccessMontage
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_GetSuccessMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_AnimID;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAnimMontageFromBank_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_GetSuccessMontage;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.LeaveSetup
// 0x0018 (0x0018 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_LeaveSetup final
{
public:
	TScriptInterface<class IBPI_InteractWell_C>   K2Node_DynamicCast_AsBPI_Interact_Well;            // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_LeaveSetup;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnBlendOut_1269B0BE46A8A8811CE44C8B2FF0E89E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_1269B0BE46A8A8811CE44C8B2FF0E89E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_1269B0BE46A8A8811CE44C8B2FF0E89E;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnBlendOut_86756FC94361FD94D8CEAF99EA75C8AE
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_86756FC94361FD94D8CEAF99EA75C8AE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_86756FC94361FD94D8CEAF99EA75C8AE;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnBlendOut_BD4A821E4B22D17CDE0504A157F74D64
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_BD4A821E4B22D17CDE0504A157F74D64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_BD4A821E4B22D17CDE0504A157F74D64;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnBlendOut_CFCBE47C445CAF877031BAAE8C5AE391
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_CFCBE47C445CAF877031BAAE8C5AE391 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_CFCBE47C445CAF877031BAAE8C5AE391;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnBlendOut_D2853A20494D5027CCC7C9B3680E3D77
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_D2853A20494D5027CCC7C9B3680E3D77 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnBlendOut_D2853A20494D5027CCC7C9B3680E3D77;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnCompleted_1269B0BE46A8A8811CE44C8B2FF0E89E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_1269B0BE46A8A8811CE44C8B2FF0E89E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_1269B0BE46A8A8811CE44C8B2FF0E89E;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnCompleted_86756FC94361FD94D8CEAF99EA75C8AE
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_86756FC94361FD94D8CEAF99EA75C8AE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_86756FC94361FD94D8CEAF99EA75C8AE;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnCompleted_BD4A821E4B22D17CDE0504A157F74D64
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_BD4A821E4B22D17CDE0504A157F74D64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_BD4A821E4B22D17CDE0504A157F74D64;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnCompleted_CFCBE47C445CAF877031BAAE8C5AE391
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_CFCBE47C445CAF877031BAAE8C5AE391 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_CFCBE47C445CAF877031BAAE8C5AE391;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnCompleted_D2853A20494D5027CCC7C9B3680E3D77
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_D2853A20494D5027CCC7C9B3680E3D77 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnCompleted_D2853A20494D5027CCC7C9B3680E3D77;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnInterrupted_1269B0BE46A8A8811CE44C8B2FF0E89E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_1269B0BE46A8A8811CE44C8B2FF0E89E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_1269B0BE46A8A8811CE44C8B2FF0E89E;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnInterrupted_86756FC94361FD94D8CEAF99EA75C8AE
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_86756FC94361FD94D8CEAF99EA75C8AE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_86756FC94361FD94D8CEAF99EA75C8AE;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnInterrupted_BD4A821E4B22D17CDE0504A157F74D64
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_BD4A821E4B22D17CDE0504A157F74D64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_BD4A821E4B22D17CDE0504A157F74D64;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnInterrupted_CFCBE47C445CAF877031BAAE8C5AE391
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_CFCBE47C445CAF877031BAAE8C5AE391 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_CFCBE47C445CAF877031BAAE8C5AE391;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnInterrupted_D2853A20494D5027CCC7C9B3680E3D77
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_D2853A20494D5027CCC7C9B3680E3D77 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnInterrupted_D2853A20494D5027CCC7C9B3680E3D77;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyBegin_1269B0BE46A8A8811CE44C8B2FF0E89E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_1269B0BE46A8A8811CE44C8B2FF0E89E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_1269B0BE46A8A8811CE44C8B2FF0E89E;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyBegin_86756FC94361FD94D8CEAF99EA75C8AE
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_86756FC94361FD94D8CEAF99EA75C8AE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_86756FC94361FD94D8CEAF99EA75C8AE;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyBegin_BD4A821E4B22D17CDE0504A157F74D64
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_BD4A821E4B22D17CDE0504A157F74D64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_BD4A821E4B22D17CDE0504A157F74D64;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyBegin_CFCBE47C445CAF877031BAAE8C5AE391
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_CFCBE47C445CAF877031BAAE8C5AE391 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_CFCBE47C445CAF877031BAAE8C5AE391;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyBegin_D2853A20494D5027CCC7C9B3680E3D77
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_D2853A20494D5027CCC7C9B3680E3D77 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyBegin_D2853A20494D5027CCC7C9B3680E3D77;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyEnd_1269B0BE46A8A8811CE44C8B2FF0E89E
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_1269B0BE46A8A8811CE44C8B2FF0E89E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_1269B0BE46A8A8811CE44C8B2FF0E89E;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyEnd_86756FC94361FD94D8CEAF99EA75C8AE
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_86756FC94361FD94D8CEAF99EA75C8AE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_86756FC94361FD94D8CEAF99EA75C8AE;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyEnd_BD4A821E4B22D17CDE0504A157F74D64
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_BD4A821E4B22D17CDE0504A157F74D64 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_BD4A821E4B22D17CDE0504A157F74D64;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyEnd_CFCBE47C445CAF877031BAAE8C5AE391
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_CFCBE47C445CAF877031BAAE8C5AE391 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_CFCBE47C445CAF877031BAAE8C5AE391;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnNotifyEnd_D2853A20494D5027CCC7C9B3680E3D77
// 0x0008 (0x0008 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_D2853A20494D5027CCC7C9B3680E3D77 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnNotifyEnd_D2853A20494D5027CCC7C9B3680E3D77;

// Function BP_Pl_Base_PullUpWellBucket_State.BP_Pl_Base_PullUpWellBucket_State_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_Pl_Base_PullUpWellBucket_State_C_OnStateUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_PullUpWellBucket_State_C_OnStateUpdate;

}

