#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pl_Base_JogTiredEnd_State

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "SMSystem_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Pl_Base_JogTiredEnd_State.BP_Pl_Base_JogTiredEnd_State_C.CanLeaveState
// 0x0002 (0x0002 - 0x0000)
struct BP_Pl_Base_JogTiredEnd_State_C_CanLeaveState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_JogTiredEnd_State_C_CanLeaveState;

// Function BP_Pl_Base_JogTiredEnd_State.BP_Pl_Base_JogTiredEnd_State_C.ConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_Pl_Base_JogTiredEnd_State_C_ConstructionScript final
{
public:
	ESMExecutionEnvironment                       CallFunc_WithExecutionEnvironment_ExecutionEnvironment; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_JogTiredEnd_State_C_ConstructionScript;

// Function BP_Pl_Base_JogTiredEnd_State.BP_Pl_Base_JogTiredEnd_State_C.ExecuteUbergraph_BP_Pl_Base_JogTiredEnd_State
// 0x0038 (0x0038 - 0x0000)
struct BP_Pl_Base_JogTiredEnd_State_C_ExecuteUbergraph_BP_Pl_Base_JogTiredEnd_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLeaveState_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_StayInStateTimer_ImplicitCast;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_JogTiredEnd_State_C_ExecuteUbergraph_BP_Pl_Base_JogTiredEnd_State;

// Function BP_Pl_Base_JogTiredEnd_State.BP_Pl_Base_JogTiredEnd_State_C.OnInputAction
// 0x0003 (0x0003 - 0x0000)
struct BP_Pl_Base_JogTiredEnd_State_C_OnInputAction final
{
public:
	ENoceInputAction                              InInputAction;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InPressed;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLeaveState_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_JogTiredEnd_State_C_OnInputAction;

// Function BP_Pl_Base_JogTiredEnd_State.BP_Pl_Base_JogTiredEnd_State_C.OnInputAxis
// 0x000C (0x000C - 0x0000)
struct BP_Pl_Base_JogTiredEnd_State_C_OnInputAxis final
{
public:
	ENoceInputAxis                                InInputAxis;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_JogTiredEnd_State_C_OnInputAxis;

// Function BP_Pl_Base_JogTiredEnd_State.BP_Pl_Base_JogTiredEnd_State_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_Pl_Base_JogTiredEnd_State_C_OnStateUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pl_Base_JogTiredEnd_State_C_OnStateUpdate;

}

