#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerRunTo_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_PlayerGameState_Base_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_PlayerRunTo_State.BP_PlayerRunTo_State_C
// 0x0038 (0x0140 - 0x0108)
class UBP_PlayerRunTo_State_C final : public UBP_PlayerGameState_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerRunTo_State_C;             // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRotator                               RunToRotation;                                     // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        RunToDuration;                                     // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LimitInput;                                        // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckStreamingHandle;                              // 0x0138(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void StartRun();
	void OnStateBegin();
	void ExecuteUbergraph_BP_PlayerRunTo_State(int32 EntryPoint);
	void ConstructionScript();
	void CheckStreamingReady();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerRunTo_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerRunTo_State_C")
	}
	static class UBP_PlayerRunTo_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerRunTo_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_PlayerRunTo_State_C;

}

