#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerRemoveBattling_State

#include "Basic.hpp"

#include "SMSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerRemoveBattling_State.BP_PlayerRemoveBattling_State_C.ExecuteUbergraph_BP_PlayerRemoveBattling_State
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerRemoveBattling_State_C_ExecuteUbergraph_BP_PlayerRemoveBattling_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_NocePlayerCharacter_C> K2Node_DynamicCast_AsBPI_Noce_Player_Character; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PlayerRemoveBattling_State_C_ExecuteUbergraph_BP_PlayerRemoveBattling_State;

// Function BP_PlayerRemoveBattling_State.BP_PlayerRemoveBattling_State_C.ConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_PlayerRemoveBattling_State_C_ConstructionScript final
{
public:
	ESMExecutionEnvironment                       CallFunc_WithExecutionEnvironment_ExecutionEnvironment; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PlayerRemoveBattling_State_C_ConstructionScript;

}

