#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rummage_Base

#include "Basic.hpp"

#include "BP_FSMGimmick_classes.hpp"
#include "Engine_structs.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rummage_Base.BP_Rummage_Base_C
// 0x0080 (0x0F40 - 0x0EC0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_Rummage_Base_C : public ABP_FSMGimmick_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Rummage_Base_C;                  // 0x0EB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight;                                         // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ConditionHandler_C*                 BP_ConditionHandler;                               // 0x0EC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Text;                                              // 0x0ED0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HintLocation;                                      // 0x0ED8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HidePlayer;                                        // 0x0EE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE1[0x7];                                      // 0x0EE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayAfterCamera;                                  // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPerformEnd;                                      // 0x0EF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 PickUpType;                                        // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ANocePickupsPoint*>              PickupsPointList;                                  // 0x0F08(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient)
	class ABP_Interact_Pickup_C*                  SpawnedItem;                                       // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BackupPickUpType;                                  // 0x0F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          DisablePlayerInput;                                // 0x0F28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResizePickupTriggerbox;                            // 0x0F29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2A[0x2];                                      // 0x0F2A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNeoAudioTriggerIdHandle               AudioOpenDrawer;                                   // 0x0F2C(0x0008)(Edit, BlueprintVisible, NoDestructor)
	bool                                          SpawnedItemIgnoreVisionCheck;                      // 0x0F34(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlaySystemHintVOOnPerforme;                        // 0x0F35(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipRummageTutorial;                               // 0x0F36(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindEventToPickup();
	void BPI_Gimmick_GetCameraBlendInVariables(double* BlendInTime, double* BlendInExp, int32* ViewTargetBlend);
	void BPI_Rummage_CanCompeteGimmick(bool* Output);
	void BPI_Rummage_IsDisablePlayerInput(bool* Disable);
	void BPI_Rummage_IsHidePlayer(bool* HidePlayer_0);
	void BPI_Rummage_OnGimmickCameraBlendIn();
	void CanCompeteGimmick(bool* Output);
	void CheckAndSetSpawnedItem(class ANoceInteractableBase* Item, bool* IsValid);
	bool ExecuteInstantFeedback(class AActor* InteractPawn_0);
	void ExecuteUbergraph_BP_Rummage_Base(int32 EntryPoint);
	void ExitGimmick();
	struct FVector GetHintLocationBP();
	void GetSpawnTransform(struct FTransform* OutTransform);
	void NeedSetAudioState(bool* Result);
	void NeedSetPlayerToUseGimmickState(bool* Yes);
	void OnGimmickCameraBlendIn();
	void OnPrepareGimmick();
	void OnPrePerformRummageFinish();
	void OnSpawned(class ABP_Interact_Pickup_C* SpawnedActor);
	void OnSpawnedItemPickedUp();
	void PerformRummage();
	void PrePerformRummage();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ResizeSpawnedItemTriggerBox();
	void SpawnTargetStuff();
	void UpdatePickupsPointList();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Rummage_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Rummage_Base_C")
	}
	static class ABP_Rummage_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rummage_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_Rummage_Base_C;

}

