#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RummageWithAnimation_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RummageWithAnimation_Base.BP_RummageWithAnimation_Base_C.BPI_Rummage_CanCompeteGimmick
// 0x0001 (0x0001 - 0x0000)
struct BP_RummageWithAnimation_Base_C_BPI_Rummage_CanCompeteGimmick final
{
public:
	bool                                          Output;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RummageWithAnimation_Base_C_BPI_Rummage_CanCompeteGimmick;

// Function BP_RummageWithAnimation_Base.BP_RummageWithAnimation_Base_C.ExecuteUbergraph_BP_RummageWithAnimation_Base
// 0x0010 (0x0010 - 0x0000)
struct BP_RummageWithAnimation_Base_C_ExecuteUbergraph_BP_RummageWithAnimation_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RummageWithAnimation_Base_C_ExecuteUbergraph_BP_RummageWithAnimation_Base;

// Function BP_RummageWithAnimation_Base.BP_RummageWithAnimation_Base_C.GetSpawnTransform
// 0x00C0 (0x00C0 - 0x0000)
struct BP_RummageWithAnimation_Base_C_GetSpawnTransform final
{
public:
	struct FTransform                             OutTransform;                                      // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RummageWithAnimation_Base_C_GetSpawnTransform;

// Function BP_RummageWithAnimation_Base.BP_RummageWithAnimation_Base_C.HandleSaveStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_RummageWithAnimation_Base_C_HandleSaveStatus final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RummageWithAnimation_Base_C_HandleSaveStatus;

// Function BP_RummageWithAnimation_Base.BP_RummageWithAnimation_Base_C.OnPickupEnableDelayOver
// 0x0001 (0x0001 - 0x0000)
struct BP_RummageWithAnimation_Base_C_OnPickupEnableDelayOver final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RummageWithAnimation_Base_C_OnPickupEnableDelayOver;

// Function BP_RummageWithAnimation_Base.BP_RummageWithAnimation_Base_C.OnSpawned
// 0x0028 (0x0028 - 0x0000)
struct BP_RummageWithAnimation_Base_C_OnSpawned final
{
public:
	class ABP_Interact_Pickup_C*                  SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RummageWithAnimation_Base_C_OnSpawned;

// Function BP_RummageWithAnimation_Base.BP_RummageWithAnimation_Base_C.PerformRummage
// 0x0010 (0x0010 - 0x0000)
struct BP_RummageWithAnimation_Base_C_PerformRummage final
{
public:
	class UObject*                                CallFunc_SendSoundTrigger_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPlayRate_Rate_ImplicitCast;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RummageWithAnimation_Base_C_PerformRummage;

// Function BP_RummageWithAnimation_Base.BP_RummageWithAnimation_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RummageWithAnimation_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RummageWithAnimation_Base_C_ReceiveTick;

}

