#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RecoverPlayer_State

#include "Basic.hpp"

#include "SMSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_RecoverPlayer_State.BP_RecoverPlayer_State_C.ExecuteUbergraph_BP_RecoverPlayer_State
// 0x0018 (0x0018 - 0x0000)
struct BP_RecoverPlayer_State_C_ExecuteUbergraph_BP_RecoverPlayer_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerCharacter*                   CallFunc_GetNocePlayerCharater_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RecoverPlayer_State_C_ExecuteUbergraph_BP_RecoverPlayer_State;

// Function BP_RecoverPlayer_State.BP_RecoverPlayer_State_C.ConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_RecoverPlayer_State_C_ConstructionScript final
{
public:
	ESMExecutionEnvironment                       CallFunc_WithExecutionEnvironment_ExecutionEnvironment; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RecoverPlayer_State_C_ConstructionScript;

}

