#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RequestSweetLight_State

#include "Basic.hpp"

#include "BP_ProgressState_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RequestSweetLight_State.BP_RequestSweetLight_State_C
// 0x0048 (0x0138 - 0x00F0)
class UBP_RequestSweetLight_State_C final : public UBP_ProgressState_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UDataTable>              SweetLightData;                                    // 0x00F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   RowName;                                           // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLight;                                       // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCharacter;                                       // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RequestPriority;                                   // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateBegin();
	void ExecuteUbergraph_BP_RequestSweetLight_State(int32 EntryPoint);
	void ConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RequestSweetLight_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RequestSweetLight_State_C")
	}
	static class UBP_RequestSweetLight_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RequestSweetLight_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_RequestSweetLight_State_C;

}

