#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rummage_HLSTreasureBox_001

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Rummage_HLSTreasureBox_001.BP_Rummage_HLSTreasureBox_001_C.ExecuteUbergraph_BP_Rummage_HLSTreasureBox_001
// 0x0010 (0x0010 - 0x0000)
struct BP_Rummage_HLSTreasureBox_001_C_ExecuteUbergraph_BP_Rummage_HLSTreasureBox_001 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rummage_HLSTreasureBox_001_C_ExecuteUbergraph_BP_Rummage_HLSTreasureBox_001;

// Function BP_Rummage_HLSTreasureBox_001.BP_Rummage_HLSTreasureBox_001_C.GetSpawnTransform
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Rummage_HLSTreasureBox_001_C_GetSpawnTransform final
{
public:
	struct FTransform                             OutTransform;                                      // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rummage_HLSTreasureBox_001_C_GetSpawnTransform;

// Function BP_Rummage_HLSTreasureBox_001.BP_Rummage_HLSTreasureBox_001_C.HandleSaveStatus
// 0x0001 (0x0001 - 0x0000)
struct BP_Rummage_HLSTreasureBox_001_C_HandleSaveStatus final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rummage_HLSTreasureBox_001_C_HandleSaveStatus;

// Function BP_Rummage_HLSTreasureBox_001.BP_Rummage_HLSTreasureBox_001_C.OnSpawned
// 0x0008 (0x0008 - 0x0000)
struct BP_Rummage_HLSTreasureBox_001_C_OnSpawned final
{
public:
	class ABP_Interact_Pickup_C*                  SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rummage_HLSTreasureBox_001_C_OnSpawned;

// Function BP_Rummage_HLSTreasureBox_001.BP_Rummage_HLSTreasureBox_001_C.PerformRummage
// 0x0008 (0x0008 - 0x0000)
struct BP_Rummage_HLSTreasureBox_001_C_PerformRummage final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPlayRate_Rate_ImplicitCast;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rummage_HLSTreasureBox_001_C_PerformRummage;

// Function BP_Rummage_HLSTreasureBox_001.BP_Rummage_HLSTreasureBox_001_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Rummage_HLSTreasureBox_001_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rummage_HLSTreasureBox_001_C_ReceiveTick;

}

