#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SetProgress_WhenClearningEnemies

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SetProgress_WhenClearningEnemies.BP_SetProgress_WhenClearningEnemies_C
// 0x0060 (0x0300 - 0x02A0)
class ABP_SetProgress_WhenClearningEnemies_C final : public ANoceActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   ConditionTagName;                                  // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ConditionContainer;                                // 0x02C0(0x0020)(Edit, BlueprintVisible)
	bool                                          NeedExactMatch;                                    // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SetProgressWhenClearning;                          // 0x02E4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          JobDone;                                           // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AddAdditionalProgress;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          IncludeFreak;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SetProgress_WhenClearningEnemies(int32 EntryPoint);
	void HandleMissionComplete();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveEnemyDeadEvent(class AActor* EnemyCharacter);
	void RegisterEnemyDeadEvent();
	void UnregisterEnemyDeadEvent();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SetProgress_WhenClearningEnemies_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SetProgress_WhenClearningEnemies_C")
	}
	static class ABP_SetProgress_WhenClearningEnemies_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SetProgress_WhenClearningEnemies_C>();
	}
};
DUMPER7_ASSERTS_ABP_SetProgress_WhenClearningEnemies_C;

}

