#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SetActorHiddenActionV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Action_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SetActorHiddenActionV2.BP_SetActorHiddenActionV2_C
// 0x0020 (0x0070 - 0x0050)
class UBP_SetActorHiddenActionV2_C final : public UBP_Action_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SetActorHiddenActionV2_C;        // 0x0050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         TargetActors;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          Hide;                                              // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Collision;                                  // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DestroyTarget;                                     // 0x006A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DestroyLifeSpan;                                   // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SetActorHiddenActionV2(int32 EntryPoint);
	void PerformAction();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SetActorHiddenActionV2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SetActorHiddenActionV2_C")
	}
	static class UBP_SetActorHiddenActionV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SetActorHiddenActionV2_C>();
	}
};
DUMPER7_ASSERTS_UBP_SetActorHiddenActionV2_C;

}

