#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SetEnableFaceTargetCameraMode_State

#include "Basic.hpp"

#include "BP_ProgressState_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_SetEnableFaceTargetCameraMode_State.BP_SetEnableFaceTargetCameraMode_State_C
// 0x0050 (0x0140 - 0x00F0)
class UBP_SetEnableFaceTargetCameraMode_State_C final : public UBP_ProgressState_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Enable;                                            // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x0100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<ENoceInputAction>                      ForbiddenInputActions;                             // 0x0118(0x0010)(Edit, BlueprintVisible)
	double                                        DelayOnEnable;                                     // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RotateCameraImmediate;                             // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckReadyHandle;                                  // 0x0138(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateBegin();
	void ExecuteUbergraph_BP_SetEnableFaceTargetCameraMode_State(int32 EntryPoint);
	void DoEnable();
	void DoDisable();
	void ConstructionScript();
	void CheckReady();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SetEnableFaceTargetCameraMode_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SetEnableFaceTargetCameraMode_State_C")
	}
	static class UBP_SetEnableFaceTargetCameraMode_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SetEnableFaceTargetCameraMode_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_SetEnableFaceTargetCameraMode_State_C;

}

