#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SightViewCondition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_Condition_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SightViewCondition.BP_SightViewCondition_C
// 0x0080 (0x00B8 - 0x0038)
class UBP_SightViewCondition_C final : public UBP_Condition_Base_C
{
public:
	bool                                          IsUsingAssignedTargetPoint;                        // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetPoint;                                       // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDraw;                                         // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         IgnoreCollisionActors;                             // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                OffsetTargetPoint;                                 // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TargetInViewRangeX;                                // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TargetInViewRangeY;                                // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANocePlayerController*                  NocePlayerController;                              // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void GetTargetPoint(struct FVector* Location);
	void DrawLineInScreenSpace(const struct FVector2D& Start, const struct FVector2D& End);
	void DrawDebugInfo();
	void CheckIsTargetInSightViewRange(const struct FVector& InTargetLocation, bool* IsInSight);
	bool BP_DoCheckCondition();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SightViewCondition_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SightViewCondition_C")
	}
	static class UBP_SightViewCondition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SightViewCondition_C>();
	}
};
DUMPER7_ASSERTS_UBP_SightViewCondition_C;

}

