#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShowCredit_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProgressStateWithEndTag_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShowCredit_State.BP_ShowCredit_State_C
// 0x0030 (0x0130 - 0x0100)
class UBP_ShowCredit_State_C : public UBP_ProgressStateWithEndTag_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   WidgetName;                                        // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CreditName;                                        // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNoceCreditWidget*                      Widget;                                            // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 FadeRequesetInfo;                                  // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnStateEnd();
	void OnStateBegin();
	void ExecuteUbergraph_BP_ShowCredit_State(int32 EntryPoint);
	void ConstructionScript();
	void OnWidgetClosed();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ShowCredit_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ShowCredit_State_C")
	}
	static class UBP_ShowCredit_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ShowCredit_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_ShowCredit_State_C;

}

