#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimplePerform_Base

#include "Basic.hpp"

#include "BP_FSMGimmick_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SimplePerform_Base.BP_SimplePerform_Base_C
// 0x0040 (0x0F00 - 0x0EC0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_SimplePerform_Base_C : public ABP_FSMGimmick_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SimplePerform_Base_C;            // 0x0EB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_ConditionHandler_C*                 BP_ConditionHandler;                               // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   PerformCameras;                                    // 0x0EC8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         PerformNum;                                        // 0x0ED8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EDC[0x4];                                      // 0x0EDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPerformFeedbackEnd;                              // 0x0EE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CanCompleteAfterPerform;                           // 0x0EF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInterrupt;                                      // 0x0EF4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HidePlayer;                                        // 0x0EF5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HidePlayerOnPrepare;                               // 0x0EF6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool ExecuteInstantFeedback(class AActor* InteractPawn_0);
	void ExecuteUbergraph_BP_SimplePerform_Base(int32 EntryPoint);
	void GetPerformCamera(int32 Index_0, class ACameraActor** Output);
	void GetTotalPerformNum(int32* PerformNum_0);
	void PerformFeedback(int32 Index_0);
	void SkipBlendOutOnFinish(bool* SkipBlendOut);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SimplePerform_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SimplePerform_Base_C")
	}
	static class ABP_SimplePerform_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SimplePerform_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_SimplePerform_Base_C;

}

