#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SetProgressTag_ByEndingBranch_State

#include "Basic.hpp"

#include "BP_ProgressState_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SetProgressTag_ByEndingBranch_State.BP_SetProgressTag_ByEndingBranch_State_C
// 0x0030 (0x0120 - 0x00F0)
class UBP_SetProgressTag_ByEndingBranch_State_C final : public UBP_ProgressState_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           EndingA_Tag;                                       // 0x00F8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EndingB_Tag;                                       // 0x0100(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EndingC_Tag;                                       // 0x0108(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EndingD_Tag;                                       // 0x0110(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EndingE_Tag;                                       // 0x0118(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void SetSpecifyProgressTag(const struct FGameplayTag& InProgressTag);
	void OnStateBegin();
	void ExecuteUbergraph_BP_SetProgressTag_ByEndingBranch_State(int32 EntryPoint);
	void ConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SetProgressTag_ByEndingBranch_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SetProgressTag_ByEndingBranch_State_C")
	}
	static class UBP_SetProgressTag_ByEndingBranch_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SetProgressTag_ByEndingBranch_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_SetProgressTag_ByEndingBranch_State_C;

}

