#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SetThinkByTag_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SMSystem_classes.hpp"


namespace SDK
{

// SMNodeBlueprintGeneratedClass BP_SetThinkByTag_State.BP_SetThinkByTag_State_C
// 0x0028 (0x0118 - 0x00F0)
class UBP_SetThinkByTag_State_C final : public USMStateInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           TargetCharacterTag;                                // 0x00F8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          Exact_Match;                                       // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableThink;                                       // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x0102(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CacheActors;                                       // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance, AdvancedDisplay)

public:
	void OnStateBegin();
	void ExecuteUbergraph_BP_SetThinkByTag_State(int32 EntryPoint);
	void ConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SetThinkByTag_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SetThinkByTag_State_C")
	}
	static class UBP_SetThinkByTag_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SetThinkByTag_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_SetThinkByTag_State_C;

}

