#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenIndicatorComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ScreenIndicatorComponent.BP_ScreenIndicatorComponent_C.StartIndicator
// 0x0001 (0x0001 - 0x0000)
struct BP_ScreenIndicatorComponent_C_StartIndicator final
{
public:
	bool                                          ShowIndicator_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenIndicatorComponent_C_StartIndicator;

// Function BP_ScreenIndicatorComponent.BP_ScreenIndicatorComponent_C.SetShowIndicator
// 0x0001 (0x0001 - 0x0000)
struct BP_ScreenIndicatorComponent_C_SetShowIndicator final
{
public:
	bool                                          InShowIndicator;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenIndicatorComponent_C_SetShowIndicator;

// Function BP_ScreenIndicatorComponent.BP_ScreenIndicatorComponent_C.SetIndicatorActive
// 0x0030 (0x0030 - 0x0000)
struct BP_ScreenIndicatorComponent_C_SetIndicatorActive final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNoceFloatIconSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenIndicatorComponent_C_SetIndicatorActive;

// Function BP_ScreenIndicatorComponent.BP_ScreenIndicatorComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ScreenIndicatorComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenIndicatorComponent_C_ReceiveTick;

// Function BP_ScreenIndicatorComponent.BP_ScreenIndicatorComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ScreenIndicatorComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenIndicatorComponent_C_ReceiveEndPlay;

// Function BP_ScreenIndicatorComponent.BP_ScreenIndicatorComponent_C.ExecuteUbergraph_BP_ScreenIndicatorComponent
// 0x0050 (0x0050 - 0x0000)
struct BP_ScreenIndicatorComponent_C_ExecuteUbergraph_BP_ScreenIndicatorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NewTag;                         // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InShowIndicator;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowIndicator;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NewTag)> K2Node_CreateDelegate_OutputDelegate;         // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANoceGameState*                         CallFunc_GetNoceGameState_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INoceGameProgressInterface> K2Node_DynamicCast_AsNoce_Game_Progress_Interface; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetProgressTag_ReturnValue;               // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenIndicatorComponent_C_ExecuteUbergraph_BP_ScreenIndicatorComponent;

// Function BP_ScreenIndicatorComponent.BP_ScreenIndicatorComponent_C.CurrentShowingIndicator
// 0x0001 (0x0001 - 0x0000)
struct BP_ScreenIndicatorComponent_C_CurrentShowingIndicator final
{
public:
	bool                                          IsShowing;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenIndicatorComponent_C_CurrentShowingIndicator;

// Function BP_ScreenIndicatorComponent.BP_ScreenIndicatorComponent_C.CheckGameProgress
// 0x0008 (0x0008 - 0x0000)
struct BP_ScreenIndicatorComponent_C_CheckGameProgress final
{
public:
	struct FGameplayTag                           NewTag;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenIndicatorComponent_C_CheckGameProgress;

}

