#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShowSystemMessageAction

#include "Basic.hpp"

#include "GameNoce_structs.hpp"


namespace SDK::Params
{

// Function BP_ShowSystemMessageAction.BP_ShowSystemMessageAction_C.ExecuteUbergraph_BP_ShowSystemMessageAction
// 0x0078 (0x0078 - 0x0000)
struct BP_ShowSystemMessageAction_C_ExecuteUbergraph_BP_ShowSystemMessageAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceUISubsystem*                       CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceSystemMessageWidget*               K2Node_DynamicCast_AsNoce_System_Message_Widget;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceSystemMessageData                 K2Node_MakeStruct_NoceSystemMessageData;           // 0x0030(0x0040)()
	bool                                          CallFunc_ShowText_NoUse;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ShowSystemMessageAction_C_ExecuteUbergraph_BP_ShowSystemMessageAction;

}

