#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Teleport_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ProgressStateWithEndTag_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Teleport_State.BP_Teleport_State_C
// 0x0080 (0x0180 - 0x0100)
class UBP_Teleport_State_C final : public UBP_ProgressStateWithEndTag_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x0108(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                TargetActorLocation;                               // 0x0130(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetActorRotation;                               // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ResetCamera;                                       // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Dev_TeleportPoint_C*                CacheTelepointObject;                              // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         TeleportRequestIndex;                              // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0174(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RequireStreamingComplete;                          // 0x0175(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceGCAfterLevelStreamedOut;                      // 0x0176(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DelayUntilNextTick;                                // 0x0177(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreWorldTrigger;                                // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetAudioToLoadingState;                            // 0x0179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTeleportSuccess(bool Succeed);
	void OnStateBegin();
	void ExecuteUbergraph_BP_Teleport_State(int32 EntryPoint);
	void ConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Teleport_State_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Teleport_State_C")
	}
	static class UBP_Teleport_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Teleport_State_C>();
	}
};
DUMPER7_ASSERTS_UBP_Teleport_State_C;

}

