#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Wep_Melee_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Wep_Melee_Base.BP_Wep_Melee_Base_C
// 0x0030 (0x0410 - 0x03E0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_Wep_Melee_Base_C : public ANoceMeleeWeapon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimPlusBankRegisterComponent*         AnimPlusBankRegister;                              // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ReachLowDurability;                                // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          OriginalDurabilityMesh;                            // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          LowDurabilityMesh;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Equip_BP();
	void ExecuteUbergraph_BP_Wep_Melee_Base(int32 EntryPoint);
	void OnShowWeaponDurabilityUI(bool InShowOnUI, class FName InWeaponName, float InDurability, bool InIsDiscarded);
	void ReceiveBeginPlay();
	void ShowLowDurabilityMesh(bool InLowDurability);
	void UnEquip_BP();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Wep_Melee_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Wep_Melee_Base_C")
	}
	static class ABP_Wep_Melee_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Wep_Melee_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_Wep_Melee_Base_C;

}

