#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaitDataLayer_State

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WaitDataLayer_State.BP_WaitDataLayer_State_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_WaitDataLayer_State_C_OnStateUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_WaitDataLayer_State_C_OnStateUpdate;

// Function BP_WaitDataLayer_State.BP_WaitDataLayer_State_C.GetDataLayerRuntimeState
// 0x0030 (0x0030 - 0x0000)
struct BP_WaitDataLayer_State_C_GetDataLayerRuntimeState final
{
public:
	class UDataLayerAsset*                        InAsset;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDataLayerRuntimeState                        Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerManager*                      CallFunc_GetDataLayerManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UDataLayerInstance*               CallFunc_GetDataLayerInstanceFromAsset_ReturnValue; // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataLayerManager*                      CallFunc_GetDataLayerManager_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDataLayerRuntimeState                        CallFunc_GetDataLayerInstanceRuntimeState_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_WaitDataLayer_State_C_GetDataLayerRuntimeState;

// Function BP_WaitDataLayer_State.BP_WaitDataLayer_State_C.ExecuteUbergraph_BP_WaitDataLayer_State
// 0x000C (0x000C - 0x0000)
struct BP_WaitDataLayer_State_C_ExecuteUbergraph_BP_WaitDataLayer_State final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDataLayerRuntimeState                        CallFunc_GetDataLayerRuntimeState_Result;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_WaitDataLayer_State_C_ExecuteUbergraph_BP_WaitDataLayer_State;

}

