#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_AIBase_PatrolHandle

#include "Basic.hpp"

#include "BP_AISpawnerPatrolSetting_S_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_AIBase_PatrolHandle.BPC_AIBase_PatrolHandle_C
// 0x0078 (0x0118 - 0x00A0)
class UBPC_AIBase_PatrolHandle_C final : public UActorComponent
{
public:
	struct FBP_AISpawnerPatrolSetting_S           PatrolSetting;                                     // 0x00A0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   CurrGroup;                                         // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIdx;                                        // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReachPathEnd;                                      // 0x0104(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForwardWay;                                        // 0x0105(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Last_Index;                                        // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CachedGroup;                                       // 0x010C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FindNextPoint(class ABP_Patrol_TargetPoint_C** Point);
	void GetCurrPatrolGroupSetting(struct FBP_PatrolGroupSetting_S* GroupSetting);
	void GetCurrPatrolPoints(TArray<class ABP_Patrol_TargetPoint_C*>* Points, int32* LastIndex);
	void GetCurrPoint(class ABP_Patrol_TargetPoint_C** Point);
	void Set_Patrol_Setting(const struct FBP_AISpawnerPatrolSetting_S& Setting);
	void SwitchPatrolGroup(class FName GroupName);
	void UpdateReachPathEnd();
	void UpdateStatus();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_AIBase_PatrolHandle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_AIBase_PatrolHandle_C")
	}
	static class UBPC_AIBase_PatrolHandle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_AIBase_PatrolHandle_C>();
	}
};
DUMPER7_ASSERTS_UBPC_AIBase_PatrolHandle_C;

}

