#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_NoceRagdollController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "F_CheckTransformRagdollBoneData_structs.hpp"
#include "GameNoce_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "F_RagdollSoundData_structs.hpp"
#include "BP_NoceCharacterComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_NoceRagdollController.BPC_NoceRagdollController_C
// 0x0280 (0x0330 - 0x00B0)
class UBPC_NoceRagdollController_C final : public UBP_NoceCharacterComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPC_NoceRagdollController_C;        // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNoceAnimInstance*                      NoceAnimInstance;                                  // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableRagdoll;                                     // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNocePostProcessAnimInstance*           NocePostAnimInstance;                              // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          InstantToRagdoll;                                  // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SupportFakeDead;                                   // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisablePostAbp;                                    // 0x00D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableTickCapsule;                                 // 0x00D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableCapsuleCollision;                           // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MeshNameArray;                                     // 0x00D8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FNoceRagdollMeshSetting>        MeshDataArray;                                     // 0x00E8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FF_CheckTransformRagdollBoneData> CheckCollisionData;                              // 0x00F8(0x0010)(Edit, BlueprintVisible)
	bool                                          DebugDrawGizmo;                                    // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeshRelativeLocation;                              // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   BelowSimulateBoneName;                             // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(ENoceRagdollStatus NewStatus)> OnStatusChangedEvent;               // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ENoceRagdollStatus                            CurrentStatus;                                     // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FName>              MeshProfileMap;                                    // 0x0148(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterMovementComponent*            MyCharacterMovement;                               // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   NeckBone;                                          // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PelvisBone;                                        // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RequestSetOrigi;                                   // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorSpringState                     Spring_State;                                      // 0x01B8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                DeltaMeshLocation;                                 // 0x01F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseSnapshot                          RagdollPoseRecord;                                 // 0x0208(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	bool                                          RecordValid;                                       // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     RecordLocalTransform;                              // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<class FName>                           RecordBoneNames;                                   // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	class FName                                   RecordMeshName;                                    // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CheckTransformRagdollBoneData> ExtraCheckSetting;                               // 0x0270(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	struct FGameplayTagContainer                  RagdollAbilityTag;                                 // 0x0280(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DirectToRagdoll;                                   // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendingToAnimationDuration;                       // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseImpulseThreshold;                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugSound;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNeoAudioSoundComponent*                MyNeoAudio;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugSoundDetail;                                  // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FF_RagdollSoundData>            SoundSetting;                                      // 0x02C8(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           TriggeredBoneArray;                                // 0x02D8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	float                                         DelayDurationToSleep;                              // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TemporaryDisabled;                                 // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OnFakeDeadLocation;                                // 0x02F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OnFakeDeadRotation;                                // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ConstLocationBlendTime;                            // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceLinkMotionComponent*               LinkComp;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Allow_Start_Ragdoll(bool* Value);
	void AvoidPopping();
	bool CheckCollisionBySetting(TArray<struct FF_CheckTransformRagdollBoneData>& Setting);
	bool CheckTransformToRagdollRequest();
	void ClearExtraBoneCheck();
	void EndFlow();
	void ExecuteUbergraph_BPC_NoceRagdollController(int32 EntryPoint);
	void InitializeFlow();
	bool IsMeshNameMatched(const class FString& MeshName);
	void LoadRecord();
	void MakeRecord();
	void OnDelayRagdoll();
	void PreActivateRagdoll();
	void ProcessToAnimationCore();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveMeshOnHitEvent(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveOnResurrect();
	void ReceiveTick(float DeltaSeconds);
	void ReturnFromRagdoll();
	void SetCapsuleOrientation();
	void SetCapsuleTransform();
	void SetExtraBoneCheck(TArray<struct FF_CheckTransformRagdollBoneData>& CheckSetting);
	void SetNewPhyAsset(class USkeletalMeshComponent* MeshComp);
	void SetOrigiPhyAsset(class USkeletalMeshComponent* MeshComp);
	void SetStatus(ENoceRagdollStatus NewStatus);
	void SnapshotRagdollPose();
	void TickCapsuleLocation(double DeltaSeconds);
	void TickRagdollStatus(double DeltaSeconds);
	void ToRagdoll();
	void TryMorphToDeadLocation();
	void UnregisterMeshOnHitEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_NoceRagdollController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_NoceRagdollController_C")
	}
	static class UBPC_NoceRagdollController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_NoceRagdollController_C>();
	}
};
DUMPER7_ASSERTS_UBPC_NoceRagdollController_C;

}

