#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_AIBase_PatrolHandle

#include "Basic.hpp"

#include "BP_PatrolGroupSetting_S_structs.hpp"
#include "BP_AISpawnerPatrolSetting_S_structs.hpp"


namespace SDK::Params
{

// Function BPC_AIBase_PatrolHandle.BPC_AIBase_PatrolHandle_C.FindNextPoint
// 0x0080 (0x0080 - 0x0000)
struct BPC_AIBase_PatrolHandle_C_FindNextPoint final
{
public:
	class ABP_Patrol_TargetPoint_C*               Point;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Patrol_TargetPoint_C*>       CallFunc_GetCurrPatrolPoints_Points;               // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetCurrPatrolPoints_LastIndex;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Patrol_TargetPoint_C*               CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBP_PatrolGroupSetting_S               CallFunc_GetCurrPatrolGroupSetting_GroupSetting;   // 0x0060(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_AIBase_PatrolHandle_C_FindNextPoint;

// Function BPC_AIBase_PatrolHandle.BPC_AIBase_PatrolHandle_C.GetCurrPatrolGroupSetting
// 0x0038 (0x0038 - 0x0000)
struct BPC_AIBase_PatrolHandle_C_GetCurrPatrolGroupSetting final
{
public:
	struct FBP_PatrolGroupSetting_S               GroupSetting;                                      // 0x0000(0x0018)(Parm, OutParm, HasGetValueTypeHash)
	struct FBP_PatrolGroupSetting_S               CallFunc_Map_Find_Value;                           // 0x0018(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_AIBase_PatrolHandle_C_GetCurrPatrolGroupSetting;

// Function BPC_AIBase_PatrolHandle.BPC_AIBase_PatrolHandle_C.GetCurrPatrolPoints
// 0x0040 (0x0040 - 0x0000)
struct BPC_AIBase_PatrolHandle_C_GetCurrPatrolPoints final
{
public:
	TArray<class ABP_Patrol_TargetPoint_C*>       Points;                                            // 0x0000(0x0010)(Parm, OutParm)
	int32                                         LastIndex;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBP_PatrolGroupSetting_S               CallFunc_Map_Find_Value;                           // 0x0018(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_AIBase_PatrolHandle_C_GetCurrPatrolPoints;

// Function BPC_AIBase_PatrolHandle.BPC_AIBase_PatrolHandle_C.GetCurrPoint
// 0x0028 (0x0028 - 0x0000)
struct BPC_AIBase_PatrolHandle_C_GetCurrPoint final
{
public:
	class ABP_Patrol_TargetPoint_C*               Point;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Patrol_TargetPoint_C*>       CallFunc_GetCurrPatrolPoints_Points;               // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetCurrPatrolPoints_LastIndex;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Patrol_TargetPoint_C*               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_AIBase_PatrolHandle_C_GetCurrPoint;

// Function BPC_AIBase_PatrolHandle.BPC_AIBase_PatrolHandle_C.Set Patrol Setting
// 0x0060 (0x0060 - 0x0000)
struct BPC_AIBase_PatrolHandle_C_Set_Patrol_Setting final
{
public:
	struct FBP_AISpawnerPatrolSetting_S           Setting;                                           // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_AIBase_PatrolHandle_C_Set_Patrol_Setting;

// Function BPC_AIBase_PatrolHandle.BPC_AIBase_PatrolHandle_C.SwitchPatrolGroup
// 0x0048 (0x0048 - 0x0000)
struct BPC_AIBase_PatrolHandle_C_SwitchPatrolGroup final
{
public:
	class FName                                   GroupName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBP_PatrolGroupSetting_S               CallFunc_Map_Find_Value;                           // 0x0028(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_AIBase_PatrolHandle_C_SwitchPatrolGroup;

// Function BPC_AIBase_PatrolHandle.BPC_AIBase_PatrolHandle_C.UpdateReachPathEnd
// 0x0048 (0x0048 - 0x0000)
struct BPC_AIBase_PatrolHandle_C_UpdateReachPathEnd final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBP_PatrolGroupSetting_S               CallFunc_GetCurrPatrolGroupSetting_GroupSetting;   // 0x0008(0x0018)(HasGetValueTypeHash)
	TArray<class ABP_Patrol_TargetPoint_C*>       CallFunc_GetCurrPatrolPoints_Points;               // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetCurrPatrolPoints_LastIndex;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_AIBase_PatrolHandle_C_UpdateReachPathEnd;

}

