#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_GM_EnmManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EAttackRightRequestMethod_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_GM_EnmManager.BPC_GM_EnmManager_C
// 0x0088 (0x0128 - 0x00A0)
class UBPC_GM_EnmManager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Setting_MaxAttackRight;                            // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         State_CurAttackRight;                              // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Setting_BaseRCD;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Setting_AdditiveRandomRCD;                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Setting_BaseGCD;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Setting_AdditiveRandomGCD;                         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_RCD;                                         // 0x00D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_GCD;                                         // 0x00D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_AtkRightManagerActive;                       // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Setting_RandomRecoverSlot;                         // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_PrintAttackSlot;                             // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDebugFloatHistory                     Float_History;                                     // 0x0100(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	EAttackRightRequestMethod                     Setting_GlobalRequestMethod;                       // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplySetting(const struct FBP_AttackInitiativeSetting& Setting);
	void DrawAttackRightDebugInfo(double DeltaSeconds);
	void ExecuteUbergraph_BPC_GM_EnmManager(int32 EntryPoint);
	void HandleRoundCooldoown();
	void OnProgressTagUpdate(const struct FGameplayTag& NewTag);
	void RCD_AddNewRight();
	void RCD_CoolDownGenerator(double* RCD);
	void RCD_EndOfGCD();
	void RCD_GCDGenerator(double* GCD);
	void RCD_GetAttackRight(bool* CanAtk);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_GM_EnmManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_GM_EnmManager_C")
	}
	static class UBPC_GM_EnmManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_GM_EnmManager_C>();
	}
};
DUMPER7_ASSERTS_UBPC_GM_EnmManager_C;

}

