#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_EmBase_NavLinkInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BP_NavLinkJumpParam_S_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_EmBase_NavLinkInfo.BPC_EmBase_NavLinkInfo_C
// 0x0078 (0x0118 - 0x00A0)
class UBPC_EmBase_NavLinkInfo_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBP_NavLinkJumpParam_S                 JumpParam;                                         // 0x00A8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InNavLink;                                         // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InNavLinkTimer;                                    // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ForceEndNavLinkTime;                               // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckForceEndNavLink(double InDeltaTime);
	void ExecuteUbergraph_BPC_EmBase_NavLinkInfo(int32 EntryPoint);
	void On_Nav_Link_End();
	void OnNavLinkStart();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_EmBase_NavLinkInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_EmBase_NavLinkInfo_C")
	}
	static class UBPC_EmBase_NavLinkInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_EmBase_NavLinkInfo_C>();
	}
};
DUMPER7_ASSERTS_UBPC_EmBase_NavLinkInfo_C;

}

