#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_EmBase_AttackRIghtManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EAttackRightRequestMethod_structs.hpp"
#include "GameNoce_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_EmBase_AttackRIghtManager.BPC_EmBase_AttackRIghtManager_C
// 0x0028 (0x00C8 - 0x00A0)
class UBPC_EmBase_AttackRIghtManager_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DefaultSucRate;                                    // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_AttackRightBlocker;                          // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EAttackRightRequestMethod                     OverrideMethod;                                    // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BattlePosRecord;                                   // 0x00BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOverrideMethod;                                 // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BattlePos_GetRecordResult(bool* Suc, class UBlackboardComponent** BBComp);
	void BattlePos_ResetRecordResult();
	void Debug_DrawResult(int32 Result, bool Enable);
	void EmBase_AttackRightBlockerEnd();
	void EmBase_GetMethodSetting(class UBPC_GM_EnmManager_C* EnmManager, EAttackRightRequestMethod* Method);
	void EmBase_RandomRate(class UBPC_GM_EnmManager_C* EnmManager, int32* Suc);
	void EmBase_TryGetAttackRight(bool* CanAtk);
	void ExecuteUbergraph_BPC_EmBase_AttackRIghtManager(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_EmBase_AttackRIghtManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_EmBase_AttackRIghtManager_C")
	}
	static class UBPC_EmBase_AttackRIghtManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_EmBase_AttackRIghtManager_C>();
	}
};
DUMPER7_ASSERTS_UBPC_EmBase_AttackRIghtManager_C;

}

