#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_InteractWell

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_InteractWell.BPI_InteractWell_C.BPI_GetSuccessTimes
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractWell_C_BPI_GetSuccessTimes final
{
public:
	int32                                         SuccessTimes;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSuccessTimes;                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractWell_C_BPI_GetSuccessTimes;

// Function BPI_InteractWell.BPI_InteractWell_C.BPI_GetMotionWarpMarker
// 0x0038 (0x0038 - 0x0000)
struct BPI_InteractWell_C_BPI_GetMotionWarpMarker final
{
public:
	class FName                                   WarpTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutVector;                                         // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRotation;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_InteractWell_C_BPI_GetMotionWarpMarker;

// Function BPI_InteractWell.BPI_InteractWell_C.BPI_GetCurrentDuration
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractWell_C_BPI_GetCurrentDuration final
{
public:
	double                                        CurrentDuration;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractWell_C_BPI_GetCurrentDuration;

// Function BPI_InteractWell.BPI_InteractWell_C.BPI_GetCheckDuration
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractWell_C_BPI_GetCheckDuration final
{
public:
	double                                        CheckDuration;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractWell_C_BPI_GetCheckDuration;

// Function BPI_InteractWell.BPI_InteractWell_C.BPI_GetCameraRotation
// 0x0018 (0x0018 - 0x0000)
struct BPI_InteractWell_C_BPI_GetCameraRotation final
{
public:
	struct FRotator                               OutValue;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_InteractWell_C_BPI_GetCameraRotation;

// Function BPI_InteractWell.BPI_InteractWell_C.BPI_GetAnimID
// 0x0004 (0x0004 - 0x0000)
struct BPI_InteractWell_C_BPI_GetAnimID final
{
public:
	int32                                         OutAnimID;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractWell_C_BPI_GetAnimID;

// Function BPI_InteractWell.BPI_InteractWell_C.BPI_DoMotionWarp
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractWell_C_BPI_DoMotionWarp final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractWell_C_BPI_DoMotionWarp;

// Function BPI_InteractWell.BPI_InteractWell_C.BPI_PullUpWellBucket
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractWell_C_BPI_PullUpWellBucket final
{
public:
	double                                        CurrentDuration;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractWell_C_BPI_PullUpWellBucket;

}

