#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Farm

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_Farm.BPI_Farm_C.BPI_GenerateSpecialScarecrowLocation
// 0x0020 (0x0020 - 0x0000)
struct BPI_Farm_C_BPI_GenerateSpecialScarecrowLocation final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Farm_C_BPI_GenerateSpecialScarecrowLocation;

// Function BPI_Farm.BPI_Farm_C.BPI_Farm_Setup
// 0x0008 (0x0008 - 0x0000)
struct BPI_Farm_C_BPI_Farm_Setup final
{
public:
	bool                                          IsSkipQuiz;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewAreaIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Farm_C_BPI_Farm_Setup;

}

