#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_PlayerAnimInstance

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.SetCanEnterIdleVar
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerAnimInstance_C_SetCanEnterIdleVar final
{
public:
	bool                                          CanEnterIdleVar;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IdleVarInt;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_SetCanEnterIdleVar;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.GetOnSlope
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerAnimInstance_C_GetOnSlope final
{
public:
	bool                                          IsOnSlope;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_GetOnSlope;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_SetLadderHeadLayer
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_SetLadderHeadLayer final
{
public:
	bool                                          UseLadderHeadLayer;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_SetLadderHeadLayer;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_PlayerAnim_SetInSeamless
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetInSeamless final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetInSeamless;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_PlayerAnim_SetInCutscene
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetInCutscene final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetInCutscene;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_PlayerAnim_SetDefaultSlotBlending
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetDefaultSlotBlending final
{
public:
	double                                        Blending;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetDefaultSlotBlending;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_PlayerAnim_SetCutsceneBlending
// 0x0008 (0x0008 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetCutsceneBlending final
{
public:
	double                                        Blending;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetCutsceneBlending;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_PlayerAnim_SetCanLeaveJogEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetCanLeaveJogEnd final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetCanLeaveJogEnd;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_PlayerAnim_SetCanEnterJogEnd
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetCanEnterJogEnd final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_PlayerAnim_SetCanEnterJogEnd;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_PlayerAnim_GetInCutscene
// 0x0001 (0x0001 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_PlayerAnim_GetInCutscene final
{
public:
	bool                                          InCutscene;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_PlayerAnim_GetInCutscene;

// Function BPI_PlayerAnimInstance.BPI_PlayerAnimInstance_C.BPI_DebugIdleVarInt
// 0x0004 (0x0004 - 0x0000)
struct BPI_PlayerAnimInstance_C_BPI_DebugIdleVarInt final
{
public:
	int32                                         DebugIdleVarInt;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_PlayerAnimInstance_C_BPI_DebugIdleVarInt;

}

