#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_InteractObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_InteractObject.BPI_InteractObject_C.BPI_GetMotionWarpMarker
// 0x0038 (0x0038 - 0x0000)
struct BPI_InteractObject_C_BPI_GetMotionWarpMarker final
{
public:
	class FName                                   WarpTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutVector;                                         // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRotation;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_InteractObject_C_BPI_GetMotionWarpMarker;

// Function BPI_InteractObject.BPI_InteractObject_C.BPI_GetAnimID
// 0x0004 (0x0004 - 0x0000)
struct BPI_InteractObject_C_BPI_GetAnimID final
{
public:
	int32                                         OutAnimID;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractObject_C_BPI_GetAnimID;

// Function BPI_InteractObject.BPI_InteractObject_C.BPI_DoMotionWarp
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractObject_C_BPI_DoMotionWarp final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractObject_C_BPI_DoMotionWarp;

}

