#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_LadderIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_IsNearUpOutMarker
// 0x0001 (0x0001 - 0x0000)
struct BPI_LadderIndicator_C_BPI_IsNearUpOutMarker final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_IsNearUpOutMarker;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_IsNearUpInMaker
// 0x0001 (0x0001 - 0x0000)
struct BPI_LadderIndicator_C_BPI_IsNearUpInMaker final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_IsNearUpInMaker;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_IsActiveTriggerUp
// 0x0001 (0x0001 - 0x0000)
struct BPI_LadderIndicator_C_BPI_IsActiveTriggerUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_IsActiveTriggerUp;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_GetWarpInfoUpIn
// 0x0030 (0x0030 - 0x0000)
struct BPI_LadderIndicator_C_BPI_GetWarpInfoUpIn final
{
public:
	struct FVector                                ReturnLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnRotation;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_GetWarpInfoUpIn;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_GetWarpInfoUpEnd
// 0x0030 (0x0030 - 0x0000)
struct BPI_LadderIndicator_C_BPI_GetWarpInfoUpEnd final
{
public:
	struct FVector                                ReturnLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnRotation;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_GetWarpInfoUpEnd;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_GetIKMarkerTarget
// 0x0038 (0x0038 - 0x0000)
struct BPI_LadderIndicator_C_BPI_GetIKMarkerTarget final
{
public:
	bool                                          InBegin;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InUpFirst;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InMoveUp;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RightHand;                                         // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftHand;                                          // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_GetIKMarkerTarget;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_GetWarpInfoEnter
// 0x0038 (0x0038 - 0x0000)
struct BPI_LadderIndicator_C_BPI_GetWarpInfoEnter final
{
public:
	bool                                          InIsUp;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnLocation;                                    // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnRotation;                                    // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_GetWarpInfoEnter;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_GetCameraRotation
// 0x0018 (0x0018 - 0x0000)
struct BPI_LadderIndicator_C_BPI_GetCameraRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_GetCameraRotation;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_GetWarpInfoDownIn
// 0x0030 (0x0030 - 0x0000)
struct BPI_LadderIndicator_C_BPI_GetWarpInfoDownIn final
{
public:
	struct FVector                                ReturnLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnRotation;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_GetWarpInfoDownIn;

// Function BPI_LadderIndicator.BPI_LadderIndicator_C.BPI_GetUpInPointer
// 0x0008 (0x0008 - 0x0000)
struct BPI_LadderIndicator_C_BPI_GetUpInPointer final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LadderIndicator_C_BPI_GetUpInPointer;

}

