#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_TriggerTentacle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_TriggerTentacle.BPI_TriggerTentacle_C.BPI_GetTriggerTentacleLinkName
// 0x0010 (0x0010 - 0x0000)
struct BPI_TriggerTentacle_C_BPI_GetTriggerTentacleLinkName final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   LinkName;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_TriggerTentacle_C_BPI_GetTriggerTentacleLinkName;

// Function BPI_TriggerTentacle.BPI_TriggerTentacle_C.BPI_GetTriggerTentaclePosition
// 0x0038 (0x0038 - 0x0000)
struct BPI_TriggerTentacle_C_BPI_GetTriggerTentaclePosition final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TentacleLocation;                                  // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TentacleRotation;                                  // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_TriggerTentacle_C_BPI_GetTriggerTentaclePosition;

// Function BPI_TriggerTentacle.BPI_TriggerTentacle_C.BPI_SetupLifeSpan
// 0x0008 (0x0008 - 0x0000)
struct BPI_TriggerTentacle_C_BPI_SetupLifeSpan final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_TriggerTentacle_C_BPI_SetupLifeSpan;

// Function BPI_TriggerTentacle.BPI_TriggerTentacle_C.BPI_SwitchOnTentacle
// 0x0001 (0x0001 - 0x0000)
struct BPI_TriggerTentacle_C_BPI_SwitchOnTentacle final
{
public:
	bool                                          SwitchOn;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_TriggerTentacle_C_BPI_SwitchOnTentacle;

}

