#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_InteractDoor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_UseFigerAdd
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractDoor_C_BPI_UseFigerAdd final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_UseFigerAdd;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_OpenDoorHalf
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractDoor_C_BPI_OpenDoorHalf final
{
public:
	double                                        InPlayRate;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_OpenDoorHalf;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_OpenDoor
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractDoor_C_BPI_OpenDoor final
{
public:
	double                                        InPlayRate;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_OpenDoor;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_IsShojiDoor
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractDoor_C_BPI_IsShojiDoor final
{
public:
	bool                                          IsShoji;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_IsShojiDoor;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_IsDoorReady
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractDoor_C_BPI_IsDoorReady final
{
public:
	bool                                          OutReady;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_IsDoorReady;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_IsDamageLimitHealth
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractDoor_C_BPI_IsDamageLimitHealth final
{
public:
	bool                                          OutValue;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_IsDamageLimitHealth;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_GetShojiHandMaker
// 0x0020 (0x0020 - 0x0000)
struct BPI_InteractDoor_C_BPI_GetShojiHandMaker final
{
public:
	bool                                          OutUseHandeIK;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutMaker;                                          // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_GetShojiHandMaker;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_GetMotionWarpMarker
// 0x0040 (0x0040 - 0x0000)
struct BPI_InteractDoor_C_BPI_GetMotionWarpMarker final
{
public:
	class FName                                   WarpTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLantern;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutVector;                                         // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRotation;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_GetMotionWarpMarker;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_GetCameraRotation
// 0x0018 (0x0018 - 0x0000)
struct BPI_InteractDoor_C_BPI_GetCameraRotation final
{
public:
	struct FRotator                               OutValue;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_GetCameraRotation;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_GetAnimID
// 0x0004 (0x0004 - 0x0000)
struct BPI_InteractDoor_C_BPI_GetAnimID final
{
public:
	int32                                         OutAnimID;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_GetAnimID;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_ForceOpenDoor
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractDoor_C_BPI_ForceOpenDoor final
{
public:
	double                                        AnimStartTime;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_ForceOpenDoor;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_ForceCloseDoor
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractDoor_C_BPI_ForceCloseDoor final
{
public:
	double                                        AnimStartTime;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_ForceCloseDoor;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_Door_IsOpen
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractDoor_C_BPI_Door_IsOpen final
{
public:
	bool                                          IsOpen;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_Door_IsOpen;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_Door_AutoUseCameraMode
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractDoor_C_BPI_Door_AutoUseCameraMode final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_Door_AutoUseCameraMode;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_DoMotionWarp
// 0x0001 (0x0001 - 0x0000)
struct BPI_InteractDoor_C_BPI_DoMotionWarp final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_DoMotionWarp;

// Function BPI_InteractDoor.BPI_InteractDoor_C.BPI_CloseDoor
// 0x0008 (0x0008 - 0x0000)
struct BPI_InteractDoor_C_BPI_CloseDoor final
{
public:
	double                                        InPlayRate;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_InteractDoor_C_BPI_CloseDoor;

}

