#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_ExamineBase

#include "Basic.hpp"

#include "GameNoce_structs.hpp"


namespace SDK::Params
{

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_CanTriggerFound
// 0x0001 (0x0001 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_CanTriggerFound final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_CanTriggerFound;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_GetGuide
// 0x0008 (0x0008 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_GetGuide final
{
public:
	class FName                                   ExamineGuide;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_GetGuide;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_GetGuideInTarget
// 0x0008 (0x0008 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_GetGuideInTarget final
{
public:
	class FName                                   InTargetGuide;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_GetGuideInTarget;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_GetHidePlayerPref
// 0x0010 (0x0010 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_GetHidePlayerPref final
{
public:
	bool                                          HideAfterBlendIn;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HideDelay;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_GetHidePlayerPref;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_GetPostProcessComp
// 0x0008 (0x0008 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_GetPostProcessComp final
{
public:
	class UPostProcessComponent*                  PostProcessComp;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_GetPostProcessComp;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_IsBlendInCameraWithFade
// 0x0001 (0x0001 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_IsBlendInCameraWithFade final
{
public:
	bool                                          IsFade;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_IsBlendInCameraWithFade;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_OnCameraInput
// 0x0010 (0x0010 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_OnCameraInput final
{
public:
	double                                        ForwardValue;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightValue;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_OnCameraInput;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_OnExamineTick
// 0x0008 (0x0008 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_OnExamineTick final
{
public:
	double                                        DeltaSeconds;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_OnExamineTick;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_ShowCameraInfo
// 0x0018 (0x0018 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_ShowCameraInfo final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ACameraActor*                           CameraActor;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_ShowCameraInfo;

// Function BPI_ExamineBase.BPI_ExamineBase_C.BPI_Examine_TransferInput
// 0x0002 (0x0002 - 0x0000)
struct BPI_ExamineBase_C_BPI_Examine_TransferInput final
{
public:
	ENoceUIInputAction                            InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPressed;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_ExamineBase_C_BPI_Examine_TransferInput;

}

