#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Lock_Gimmick

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Lock_Gimmick.BPI_Lock_Gimmick_C.BPI_LockGimmick_HandleCheckAnswer
// 0x0001 (0x0001 - 0x0000)
struct BPI_Lock_Gimmick_C_BPI_LockGimmick_HandleCheckAnswer final
{
public:
	bool                                          IsCorrect;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Lock_Gimmick_C_BPI_LockGimmick_HandleCheckAnswer;

// Function BPI_Lock_Gimmick.BPI_Lock_Gimmick_C.BPI_LockGimmick_GetAutoCheckAnswer
// 0x0014 (0x0014 - 0x0000)
struct BPI_Lock_Gimmick_C_BPI_LockGimmick_GetAutoCheckAnswer final
{
public:
	bool                                          IsAutoCheckAnswer;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GuideName;                                         // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ConfirmedGuideName;                                // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Lock_Gimmick_C_BPI_LockGimmick_GetAutoCheckAnswer;

}

