#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CorruptionUnit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_CorruptionUnit.BPI_CorruptionUnit_C.BPI_UseNewTentacle
// 0x0001 (0x0001 - 0x0000)
struct BPI_CorruptionUnit_C_BPI_UseNewTentacle final
{
public:
	bool                                          UseNew;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_CorruptionUnit_C_BPI_UseNewTentacle;

// Function BPI_CorruptionUnit.BPI_CorruptionUnit_C.BPI_GetGrabSocketIndex
// 0x0004 (0x0004 - 0x0000)
struct BPI_CorruptionUnit_C_BPI_GetGrabSocketIndex final
{
public:
	int32                                         OutSocketIndex;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_CorruptionUnit_C_BPI_GetGrabSocketIndex;

// Function BPI_CorruptionUnit.BPI_CorruptionUnit_C.BPI_GetEscapeRotation
// 0x0020 (0x0020 - 0x0000)
struct BPI_CorruptionUnit_C_BPI_GetEscapeRotation final
{
public:
	bool                                          OutUseEscapeRotation;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OutEscapeRotation;                                 // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_CorruptionUnit_C_BPI_GetEscapeRotation;

}

