#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPP_Env_AF_CandyTableGroup_000_A

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPP_Env_AF_CandyTableGroup_000_A.BPP_Env_AF_CandyTableGroup_000_A_C
// 0x0058 (0x0388 - 0x0330)
class ABPP_Env_AF_CandyTableGroup_000_A_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyTable_000_A_Mesh00_000;         // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyToys_001_I_000;                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyToys_001_A_000;                 // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyHouse_000_D_000;                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyToys_001_E_000;                 // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyTable_000_A_000;                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyToys_001_D_000;                 // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyToys_001_G_000;                 // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_S_Rusty_Stake_tkqmdbnhw_lod5_000;              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyToys_001_F_000;                 // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_SM_Env_AF_CandyToys_001_H_000;                 // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPP_Env_AF_CandyTableGroup_000_A_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPP_Env_AF_CandyTableGroup_000_A_C")
	}
	static class ABPP_Env_AF_CandyTableGroup_000_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPP_Env_AF_CandyTableGroup_000_A_C>();
	}
};
DUMPER7_ASSERTS_ABPP_Env_AF_CandyTableGroup_000_A_C;

}

