#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_NpcBase_UpdateBrainStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AIBase_Brain_Enum_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_NpcBase_UpdateBrainStatus.BTService_NpcBase_UpdateBrainStatus_C
// 0x0028 (0x00C0 - 0x0098)
class UBTService_NpcBase_UpdateBrainStatus_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AAIController*                          Controller;                                        // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Pawn;                                              // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AIBase_AIController_C*              NoceAIController;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EBP_AIBase_Brain_Enum                         BrainStatus;                                       // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTService_NpcBase_UpdateBrainStatus(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTService_NpcBase_UpdateBrainStatus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_NpcBase_UpdateBrainStatus_C")
	}
	static class UBTService_NpcBase_UpdateBrainStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_NpcBase_UpdateBrainStatus_C>();
	}
};
DUMPER7_ASSERTS_UBTService_NpcBase_UpdateBrainStatus_C;

}

