#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CS_BinkPlayTool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameNoce_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CS_BinkPlayTool.CS_BinkPlayTool_C
// 0x0060 (0x02F0 - 0x0290)
class ACS_BinkPlayTool_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       EditorModeBinkPlayerSource;                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkPlayerSource;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       CurrentBinkPlayerSource;                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Seconds;                                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 BinkLinkUrl;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 CurrentBinkLinkUrl;                                // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsAutoEnableNoceFlag;                              // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBinkSeekEveryFrame;                              // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HasSetup;                                          // 0x02EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BinkPlay(bool IsPlay);
	void BinkRewind();
	void BinkSeek();
	void BinkStop();
	void CanSeekEveryFrame(bool* CanTick);
	void EnableBink(bool IsEnable, double DelayedToSeek);
	void EnableBinkRender(bool IsEnable);
	void ExecuteUbergraph_CS_BinkPlayTool(int32 EntryPoint);
	void GetDebugKeyString(const class FString& Suffix, class FName* OutName);
	void GetUrlWithOutfitSuffix(const class FString& InURL, class FString* OutUrl);
	void InitializeVideo();
	void OpenBinkUrl();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void Setup();
	void SetupByWorldMode();
	void UpdateCurrentUrl();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CS_BinkPlayTool_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CS_BinkPlayTool_C")
	}
	static class ACS_BinkPlayTool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACS_BinkPlayTool_C>();
	}
};
DUMPER7_ASSERTS_ACS_BinkPlayTool_C;

}

