#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableSequencerTracks

#include "Basic.hpp"

#include "CustomizableSequencerTracks_structs.hpp"


namespace SDK::Params
{

// Function CustomizableSequencerTracks.SequencerTrackInstanceBP.K2_OnInputAdded
// 0x0070 (0x0070 - 0x0000)
struct SequencerTrackInstanceBP_K2_OnInputAdded final
{
public:
	struct FSequencerTrackInstanceInput           Input;                                             // 0x0000(0x0070)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SequencerTrackInstanceBP_K2_OnInputAdded;

// Function CustomizableSequencerTracks.SequencerTrackInstanceBP.K2_OnInputRemoved
// 0x0070 (0x0070 - 0x0000)
struct SequencerTrackInstanceBP_K2_OnInputRemoved final
{
public:
	struct FSequencerTrackInstanceInput           Input;                                             // 0x0000(0x0070)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SequencerTrackInstanceBP_K2_OnInputRemoved;

// Function CustomizableSequencerTracks.SequencerTrackInstanceBP.GetAnimatedObject
// 0x0008 (0x0008 - 0x0000)
struct SequencerTrackInstanceBP_GetAnimatedObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SequencerTrackInstanceBP_GetAnimatedObject;

// Function CustomizableSequencerTracks.SequencerTrackInstanceBP.GetInput
// 0x0078 (0x0078 - 0x0000)
struct SequencerTrackInstanceBP_GetInput final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencerTrackInstanceInput           ReturnValue;                                       // 0x0008(0x0070)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SequencerTrackInstanceBP_GetInput;

// Function CustomizableSequencerTracks.SequencerTrackInstanceBP.GetInputs
// 0x0010 (0x0010 - 0x0000)
struct SequencerTrackInstanceBP_GetInputs final
{
public:
	TArray<struct FSequencerTrackInstanceInput>   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SequencerTrackInstanceBP_GetInputs;

// Function CustomizableSequencerTracks.SequencerTrackInstanceBP.GetNumInputs
// 0x0004 (0x0004 - 0x0000)
struct SequencerTrackInstanceBP_GetNumInputs final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SequencerTrackInstanceBP_GetNumInputs;

}

