#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_CheckTransformRagdollBoneData

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_CheckTransformRagdollBoneData.F_CheckTransformRagdollBoneData
// 0x0050 (0x0050 - 0x0000)
struct FF_CheckTransformRagdollBoneData final
{
public:
	class FName                                   BoneName_5_5973DF424BA861BF9E8D86B02488DC8F;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceAttackTraceType                          ShapeType_4_9E7662EF4BFB396856C64FAD1424FF26;      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Radius_10_5E894FE04E5B84AB389D2D817352B1A5;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HalfLength_11_2A9954D04B2056DDC079CEACE78B1D43;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Center_16_08FC908244EEFADA00526AAFC28DE0DF;        // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rotation_17_72BFAB9747F0081ACB2BE4A037DC1622;      // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FF_CheckTransformRagdollBoneData;

}

