#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HealthMonitor

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HealthMonitor.GA_HealthMonitor_C
// 0x00E8 (0x04B8 - 0x03D0)
class UGA_HealthMonitor_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayAttribute                     Attribute_Health;                                  // 0x03D8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                     Attribute_MaxHealth;                               // 0x0410(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_HealthHandle;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_HealthFull;                                     // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 GE_HealthFine;                                     // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_HealthDanger;                                   // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DangerRatio;                                       // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_HealthDead;                                     // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FSoftObjectPath                        Audio_PLHealth_RTPC_SL;                            // 0x0480(0x0020)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UNoceSanityComponent*                   NoceSanity;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceInvincibleComponent*               NoceInvincible;                                    // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_HealthFullHandle;                               // 0x04B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Audio_SetRTPC(double RTPC_Value, const struct FSoftObjectPath& RTPC);
	void EventReceived_743FE96B489A21FEB97EFDB24BD3BF6E(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_HealthMonitor(int32 EntryPoint);
	double GetHealth();
	double GetMaxHealth();
	void HandleDead();
	void K2_ActivateAbility();
	void OnChange_345CB37847E1F134228D4FA96810052D();
	void UpdateHealthStateTag();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_HealthMonitor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_HealthMonitor_C")
	}
	static class UGA_HealthMonitor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HealthMonitor_C>();
	}
};
DUMPER7_ASSERTS_UGA_HealthMonitor_C;

}

