#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NavLink_Jump

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_NavLink_Jump.GA_NavLink_Jump_C
// 0x0108 (0x04D8 - 0x03D0)
class UGA_NavLink_Jump_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_EmBase_NoceEnemyCharacter_C*        EnmChar;                                           // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ANoceAIController*                      EnmController;                                     // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Destination;                                       // 0x03E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UAnimMontage*>        JumpMontage;                                       // 0x0400(0x0050)(Edit, BlueprintVisible)
	struct FVector                                LaunchVelocity;                                    // 0x0450(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpDistance;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               JumpRotation;                                      // 0x0470(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        JumpHeight;                                        // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpDuration;                                      // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ENoceNavLinkJumpType                          JumpType;                                          // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNoceNavLinkJumpSetting                JumpSetting;                                       // 0x04A4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UAbilityTask_ApplyRootMotionJumpForce*  JumpTask;                                          // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          TookDamage;                                        // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceAsyncTaskAttributeChanged*         ListenHPTask;                                      // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LockHealthTag;                                     // 0x04D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CalculateVel(const struct FVector& End, const struct FVector& Start, double duration);
	void ExecuteUbergraph_GA_NavLink_Jump(int32 EntryPoint);
	void FindJumpMontage(class UAnimMontage** Montage_0);
	void GetTurnMontage(class UAnimMontage** Montage_0);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAttributeChanged_36561E7D4C1B689312D9B698BCE89929(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnBlendOut_631DBE6043C5B2FC311301B93852E19C(class FName NotifyName);
	void OnBlendOut_B46CE6E3498E0C2819B0A587CDD8004C(class FName NotifyName);
	void OnBlendOut_DF054A9D4452E490D27539BDC817E8A3(class FName NotifyName);
	void OnBlendOut_F7B852FA411B71F267C327AC8EAFD4E3(class FName NotifyName);
	void OnCompleted_631DBE6043C5B2FC311301B93852E19C(class FName NotifyName);
	void OnCompleted_B46CE6E3498E0C2819B0A587CDD8004C(class FName NotifyName);
	void OnCompleted_DF054A9D4452E490D27539BDC817E8A3(class FName NotifyName);
	void OnCompleted_F7B852FA411B71F267C327AC8EAFD4E3(class FName NotifyName);
	void OnFinish_A3D86B2D4D68F867F15C1EA6EEC682C9();
	void OnInterrupted_631DBE6043C5B2FC311301B93852E19C(class FName NotifyName);
	void OnInterrupted_B46CE6E3498E0C2819B0A587CDD8004C(class FName NotifyName);
	void OnInterrupted_DF054A9D4452E490D27539BDC817E8A3(class FName NotifyName);
	void OnInterrupted_F7B852FA411B71F267C327AC8EAFD4E3(class FName NotifyName);
	void OnLanded_A3D86B2D4D68F867F15C1EA6EEC682C9();
	void OnNotifyBegin_631DBE6043C5B2FC311301B93852E19C(class FName NotifyName);
	void OnNotifyBegin_B46CE6E3498E0C2819B0A587CDD8004C(class FName NotifyName);
	void OnNotifyBegin_DF054A9D4452E490D27539BDC817E8A3(class FName NotifyName);
	void OnNotifyBegin_F7B852FA411B71F267C327AC8EAFD4E3(class FName NotifyName);
	void OnNotifyEnd_631DBE6043C5B2FC311301B93852E19C(class FName NotifyName);
	void OnNotifyEnd_B46CE6E3498E0C2819B0A587CDD8004C(class FName NotifyName);
	void OnNotifyEnd_DF054A9D4452E490D27539BDC817E8A3(class FName NotifyName);
	void OnNotifyEnd_F7B852FA411B71F267C327AC8EAFD4E3(class FName NotifyName);
	void SetColResponse(bool Enable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_NavLink_Jump_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_NavLink_Jump_C")
	}
	static class UGA_NavLink_Jump_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_NavLink_Jump_C>();
	}
};
DUMPER7_ASSERTS_UGA_NavLink_Jump_C;

}

