#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pl_ConsumableMonitor

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Pl_ConsumableMonitor.GA_Pl_ConsumableMonitor_C
// 0x0100 (0x04D0 - 0x03D0)
class UGA_Pl_ConsumableMonitor_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNoceAbilitySystemComponent*            AbilitySystemComponent;                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Attribute_CurrentMaxSanity;                        // 0x03E0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                     Attribute_MaxSanity;                               // 0x0418(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_SanityFull;                                     // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UNoceAsyncTaskAttributeChanged*         AsyncTask_CurrentMaxSanity;                        // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UClass*, double>                   EffectRemainTimeMap;                               // 0x0460(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         BuffEfffects;                                      // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         BuffRegenEffects;                                  // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void EventReceived_0142D5A14C161C4CDEE5FA91307C879C(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Pl_ConsumableMonitor(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAttributeChanged_00E8CD10428EF53606FB6FA15B1CE1A1(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnEnterEvent();
	void OnExitEvent();
	void OnGameplayTagChanged(const struct FGameplayTag& Tag, bool TagExists);
	void Record_Effect_Remain_Time();
	void RemoveAllBuffEffects();
	void RestoreEffectRemainTime();
	void UpdateCurrentMaxSanityTag();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pl_ConsumableMonitor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pl_ConsumableMonitor_C")
	}
	static class UGA_Pl_ConsumableMonitor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pl_ConsumableMonitor_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pl_ConsumableMonitor_C;

}

