#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pl_CorruptionDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Pl_CorruptionDamage.GA_Pl_CorruptionDamage_C
// 0x00B8 (0x0488 - 0x03D0)
class UGA_Pl_CorruptionDamage_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANocePlayerCharacter*                   NocePlayerCharacter;                               // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StaminaCostValue;                                  // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HealthDamageValue;                                 // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNoceAbilitySystemComponent*            AbilitySystemComponent;                            // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        StaminaDamageValue;                                // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSanityDamageValue;                              // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_CorruptionStaminaCostPeriodSetByCaller;         // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              GE_EffectSpecStaminaCost;                          // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            GE_HandleStaminaCost;                              // 0x0420(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         OverlappedUnits;                                   // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         StartGrabbedUnits;                                 // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UMotionWarpingComponent*                MotionWarpComponent;                               // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        WarpTraceDistance;                                 // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WarpTraceDegree;                                   // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WarpTraceRadius;                                   // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            HealthDamageRatioTable;                            // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            StaminaDamageRatioTable;                           // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            SanityDamageRatioTable;                            // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitDamageState;                                   // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_180188DB478349E06C36F5A3811F4BA3();
	void ApplyCorruptionDamage();
	void ApplyGrab(bool InApply);
	void BeginCostStamina();
	double ComputeHealthDamageValue();
	double ComputeMaxSanityDamageValue();
	double ComputeStaminaDamageValue();
	void EndCostStamina();
	void EventReceived_1CFDBCC642682163F22CE4BED0C8341A(const struct FGameplayEventData& Payload);
	void EventReceived_2D67805B47DC4200A173D4AA8D6AE6C8(const struct FGameplayEventData& Payload);
	void EventReceived_ABEB6D1141B8A8C3BA3B4A817662B477(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Pl_CorruptionDamage(int32 EntryPoint);
	void FindWrapYawDegree(struct FRotator* OutRotator);
	bool HasOverlappedUnit();
	void K2_ActivateAbility();
	void OnFinish_9994B6094E90442A7541D5B862862083();
	void Removed_29A452034615F60357FE5ABA13614C74();
	void Removed_5430AE4C4D2855C98ECD048A5A0E431E();
	void Removed_6B2914E64991DC1ABEA66C9B62CEAC4B();
	void Removed_965174654BBF10D0E980278D8DCCAEAC();
	void Removed_E51F70A2416C05909E06059DFC68873D();
	void Removed_E6DF51A44C04618EB75E1D8E77B358EB();
	void Removed_E8CF7FF74601E70F65C420B3A34AE042();
	void Removed_FF084C1A43CAFA88610B85A38DA0C18E();
	void Removed_FFEA49EF4A81DD26FF5A3693C5105810();
	void SetupCostStamina();
	void SetupGrabAnimID();
	void SetupWrapRotation(const struct FRotator& InRotator);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pl_CorruptionDamage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pl_CorruptionDamage_C")
	}
	static class UGA_Pl_CorruptionDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pl_CorruptionDamage_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pl_CorruptionDamage_C;

}

