#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pl_HellModeDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Pl_HellModeDamage.GA_Pl_HellModeDamage_C
// 0x0070 (0x0440 - 0x03D0)
class UGA_Pl_HellModeDamage_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ANocePlayerCharacter*                   NocePlayerCharacter;                               // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageToPlay;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNoceHellModeDataAsset*                 DataAsset;                                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        SanityToHealthRatio;                               // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               Trigger_ID;                                        // 0x0400(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UClass*                                 GE_HellModeDamageMotion;                           // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimPlusBankComponent*                 AnimPlusBank;                                      // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HealthDamageEffectedByDamageRatio;                 // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HealthDamageApplyGutsCheck;                        // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNocePlayerDamageHandleComponent*       PlayerDamageHandler;                               // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNeoAudioSoundComponent*                SoundComponent;                                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HealthDamageCheckOmamoriKagami;                    // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HealthDamageCheckSuperArmor;                       // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x2];                                      // 0x0432(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MontageStartingPosition;                           // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimID;                                            // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupMontageToPlay(ENoceHellModeAnimType HellModeType);
	void Setup();
	void SetStateAndTag(bool IsEnable);
	void OnNotifyEnd_ADCB7E3747B6193FC4F1F1A25CD3C9A7(class FName NotifyName);
	void OnNotifyBegin_ADCB7E3747B6193FC4F1F1A25CD3C9A7(class FName NotifyName);
	void OnInterrupted_ADCB7E3747B6193FC4F1F1A25CD3C9A7(class FName NotifyName);
	void OnCompleted_ADCB7E3747B6193FC4F1F1A25CD3C9A7(class FName NotifyName);
	void OnBlendOut_ADCB7E3747B6193FC4F1F1A25CD3C9A7(class FName NotifyName);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void HandleStopMontage();
	void HandleEndAbility();
	void GetDamageAmount(double* Damage);
	void GetAnimType(ENoceHellModeAnimType* Anim_Type);
	void ExecuteUbergraph_GA_Pl_HellModeDamage(int32 EntryPoint);
	void EventReceived_E3548C234535DB8FB2A644ADCAE16A0C(const struct FGameplayEventData& Payload);
	void EventReceived_B3856E7A497A0E521D79DD93D2CFCE9B(const struct FGameplayEventData& Payload);
	void EventReceived_4D5473664741A582183C0E9F987F534D(const struct FGameplayEventData& Payload);
	void ApplyMontage(ENoceHellModeAnimType HellModeType);
	void ApplyGameplayEffect();
	void ApplyGameplayCue();
	void ApplyDamage(ENoceHellModeAnimType DamageType);
	void Added_22CE182040C8D3B82E1B8D9421275A94();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pl_HellModeDamage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pl_HellModeDamage_C")
	}
	static class UGA_Pl_HellModeDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pl_HellModeDamage_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pl_HellModeDamage_C;

}

