#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pl_ClawGTransformToClaw

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Pl_ClawGTransformToClaw.GA_Pl_ClawGTransformToClaw_C
// 0x0040 (0x0410 - 0x03D0)
class UGA_Pl_ClawGTransformToClaw_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ANocePlayerCharacter*                   PlayerCharacter;                                   // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageToPlay;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_NoStaminaRegen;                                 // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_BattleStatusTimerTick;                          // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            GE_ClawGTransformToClawMotion;                     // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimPlusBankComponent*                 AnimPlusBankComponent;                             // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Added_2AF970014ABD80EEB1B765984FB3259F();
	void EndTransform();
	void ExecuteUbergraph_GA_Pl_ClawGTransformToClaw(int32 EntryPoint);
	void HandleClawTransform();
	void HandleEndAbility();
	void HandleStopMontage();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_E2FB0F6648ABCBAC9F2B3CBBD5D01904(class FName NotifyName);
	void OnCompleted_E2FB0F6648ABCBAC9F2B3CBBD5D01904(class FName NotifyName);
	void OnInterrupted_E2FB0F6648ABCBAC9F2B3CBBD5D01904(class FName NotifyName);
	void OnNotifyBegin_E2FB0F6648ABCBAC9F2B3CBBD5D01904(class FName NotifyName);
	void OnNotifyEnd_E2FB0F6648ABCBAC9F2B3CBBD5D01904(class FName NotifyName);
	void Removed_80B8B6A44E235FA2914717BE7CC057EA();
	void Setup();
	void StartTransform();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pl_ClawGTransformToClaw_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pl_ClawGTransformToClaw_C")
	}
	static class UGA_Pl_ClawGTransformToClaw_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pl_ClawGTransformToClaw_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pl_ClawGTransformToClaw_C;

}

