#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pl_OmamoriHelper

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "NeoAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Pl_OmamoriHelper.GA_Pl_OmamoriHelper_C
// 0x0100 (0x04D0 - 0x03D0)
class UGA_Pl_OmamoriHelper_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANocePlayerCharacter*                   PlayerCharacter;                                   // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceSanityComponent*                   SanityComponent;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Goat_DamageRatioBase;                              // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Racoon_AddWeaponDurability;                        // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Swallow_AttackRatioAdd;                            // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AppliedCounter_ScorpionIn;                         // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         NewItemWidgetPath;                                 // 0x0410(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UNocePlayerInventoryComponent*          PlayerInventoryComp;                               // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     AttributeHealth;                                   // 0x0438(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                     AttributeCurrentMaxSanity;                         // 0x0470(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          AppliedCounter_Swordfish;                          // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AppliedCounter_Swallow;                            // 0x04A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA[0x2];                                      // 0x04AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNeoAudioTriggerIdHandle               Kagami_Sound;                                      // 0x04AC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FNeoAudioTriggerIdHandle               PeonyRecover_Sound;                                // 0x04B4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CachedAttackBuffAccumulateRatio;                   // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CachedUICountWolf;                                 // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CachedDiffUICountBear;                             // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_00DFA92746219A0C9BF214AC24035146();
	void Added_2ED2F7D245956C0E978958BE09D5A223();
	void Added_D6492FC747F2B6BCCCB3198F78AFA4EB();
	void EventReceived_8A5412F1465F8CFD8CAD478A51F51CB5(const struct FGameplayEventData& Payload);
	void EventReceived_E4F222FC4C23C3A1D2A59C864DC5362A(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Pl_OmamoriHelper(int32 EntryPoint);
	void HandleOmamoriBear(class ANoceWeapon* InWeapon);
	void HandleOmamoriGoat();
	void HandleOmamoriKagami();
	void HandleOmamoriSnake();
	void HandleOmamoriSwallow();
	void HandleOmamoriWolf(class ANoceWeapon* InWeapon);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAttackBuffAccumulateValueChanged(float InRatio);
	void OnEnemyDamaged(class AActor* InHitActor, float InDamage, bool InIsDead);
	void OnEnemyInSightNumberChanged(int32 InNumber);
	void OnJustDodge();
	void OnPickupItem(ENoceInventoryType InventoryType, class FName ID, bool PlaySystemHintVO);
	void OnPlayerPreDamageHitHandler(float InHealthDamage, float InMaxSanityDamage);
	void OnPreviewEnd(ENoceInventoryType Type, class FName ID);
	void OnShowWeaponDurabilityHint(bool InShowOnUI, class FName InWeaponName, float InDurability, bool InIsDiscarded);
	void OnWeaponChanged(class ANoceWeapon* NewWeapon);
	void Removed_17FD41F047A0EB3E7396FA88D5A2448F();
	void Removed_2B61B5A447946793A3821895715F73E0();
	void Removed_41BF2CE64FAFD2778AE0BB8402E96610();
	void Removed_A5AFC2774D1DC887F0CB6E979CEFCC6D();
	void Removed_C1DA71C84F338CB9D9D15FA323DBFA33();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pl_OmamoriHelper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pl_OmamoriHelper_C")
	}
	static class UGA_Pl_OmamoriHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pl_OmamoriHelper_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pl_OmamoriHelper_C;

}

