#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pl_ShiromukuRevive2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Pl_ShiromukuRevive2.GA_Pl_ShiromukuRevive2_C
// 0x0050 (0x0420 - 0x03D0)
class UGA_Pl_ShiromukuRevive2_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANocePlayerCharacter*                   PlayerCharacter;                                   // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CapsuleName;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CapsuleQuantity;                                   // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 GhostShellMeshRef;                                 // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   WeaponName;                                        // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EndProgressTag;                                    // 0x0408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_WaitPlayerBeginPlay;                   // 0x0410(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PPIndex;                                           // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_4CBE619A4F00078B0A7835B6A4D05300();
	void Added_7CF5812947BD1AD6ABCB2BACA7A73AEB();
	void CustomEvent(class AActor* Attacker, class FName ComboName, float InHealthDamage);
	void EndRevive2PPBinding();
	void EventReceived_1492FCCE47F29AB35FDC859ED134BC5C(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Pl_ShiromukuRevive2(int32 EntryPoint);
	void HandleOnGameProgressChanged(const struct FGameplayTag& NewTag);
	void HandleWaitPlayerBeginPlay();
	void HandleWeapon();
	void InitRevive2PPBinding();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void Removed_364D888741E533A0150F24B87602049C();
	void Removed_DCC8668A4DAF5528F14353BC8A40064F();
	void Revive2PPWep(class ANoceWeapon* NewWeapon);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pl_ShiromukuRevive2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pl_ShiromukuRevive2_C")
	}
	static class UGA_Pl_ShiromukuRevive2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pl_ShiromukuRevive2_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pl_ShiromukuRevive2_C;

}

