#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pl_DetectEnemyInSight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Pl_DetectEnemyInSight.GA_Pl_DetectEnemyInSight_C
// 0x0028 (0x0468 - 0x0440)
class UGA_Pl_DetectEnemyInSight_C final : public UNoceGA_DetectEnemyInSight
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 GE_EnemyInSight;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_EnemyInSightHandle;                             // 0x0450(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_SeeingEnemy;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_SeeingEnemyHandle;                              // 0x0460(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnSeeingEnemyChanged(bool NewSeeingEnemey);
	void OnEnemyInSightChanged(bool NewEnemyInSight);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void HandleSeeingResurrectEnemies();
	void HandleCombatWave();
	void HandleCombatEscaped();
	void HandleCombatEngaged();
	void HandleCombatEnded();
	void HandleCombatAmbushed();
	void ExecuteUbergraph_GA_Pl_DetectEnemyInSight(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pl_DetectEnemyInSight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pl_DetectEnemyInSight_C")
	}
	static class UGA_Pl_DetectEnemyInSight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pl_DetectEnemyInSight_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pl_DetectEnemyInSight_C;

}

