#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Pl_PlayLinkMotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Pl_PlayLinkMotion.GA_Pl_PlayLinkMotion_C
// 0x0060 (0x0430 - 0x03D0)
class UGA_Pl_PlayLinkMotion_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimPlusBankComponent*                 AnimPlusBank;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNoceLinkMotionComponent*               MyLinkMotion;                                      // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           StartMontage;                                      // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNoceMontageStateMonitorComponent*      MontageStateMonitor;                               // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ANocePlayerCharacter*                   NocePlayerCharacter;                               // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNoceSanityComponent*                   SanityComponent;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerStaminaComponent*            StaminaComponent;                                  // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          EverRemoveInvincible;                              // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExecution;                                       // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimPlusBankComponent*                 OwnerAnimBank;                                     // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRobbed;                                          // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNeoAudioTriggerIdHandle               ClawTransformEndTrigger;                           // 0x0424(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Added_2412053E4BDE83DFE153AE86FEC65FE8();
	void EventReceived_304AD90F4FC2116C0733AFB99DD0098C(const struct FGameplayEventData& Payload);
	void EventReceived_56F0826D4D06E547C0EBD2A306DE5D41(const struct FGameplayEventData& Payload);
	void EventReceived_6106023D42D4ACB5C0E4E493FE05E390(const struct FGameplayEventData& Payload);
	void EventReceived_8AD21EFB415DD078E4B998AC5FF50AD9(const struct FGameplayEventData& Payload);
	void EventReceived_ACA8532A4D79A194C2976498F7196974(const struct FGameplayEventData& Payload);
	void EventReceived_EAE04AE147C044E745CA299076905BF7(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Pl_PlayLinkMotion(int32 EntryPoint);
	void HandleCameraLookAtEnemy(const struct FGameplayEventData& EventData);
	void HandleCameraLookAtPlayer();
	void HandleCameraRotationToActorYaw();
	void HandleClawGToClaw();
	void HandleInvincible(bool ApplyInvincible);
	void HandleMontageInterrupted();
	void HandleReceiveInterruptEvent();
	void HandleReceiveRobbedEvent();
	void Initialize(bool* Success);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_32DD26AA46ACF273DC5A7899E925EB97();
	void OnCancelled_32DD26AA46ACF273DC5A7899E925EB97();
	void OnCompleted_32DD26AA46ACF273DC5A7899E925EB97();
	void OnInterrupted_32DD26AA46ACF273DC5A7899E925EB97();
	void ProcessDelayEndAbility();
	void ProcessPlayerSwitch(bool SWITCH);
	void Remove_Gameplay_Effect();
	void SetupGameplayEffect();
	void SetupLinkTriggerGrabGlobalCooldown();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Pl_PlayLinkMotion_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Pl_PlayLinkMotion_C")
	}
	static class UGA_Pl_PlayLinkMotion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Pl_PlayLinkMotion_C>();
	}
};
DUMPER7_ASSERTS_UGA_Pl_PlayLinkMotion_C;

}

