#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ShowShortcutItemUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ShowShortcutItemUI.GA_ShowShortcutItemUI_C
// 0x0058 (0x0428 - 0x03D0)
class UGA_ShowShortcutItemUI_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNoceAnimWidget*                        GamepadUI;                                         // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         GamepadUIPath;                                     // 0x03E0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UNoceAnimWidget*                        KBUI;                                              // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         KBUIPath;                                          // 0x0408(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void EventReceived_4C09BABC46EF22D8A0A7839F61BC4A90(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_ShowShortcutItemUI(int32 EntryPoint);
	void HandleEvent(const struct FGameplayEventData& Payload);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnTryToUseItem();
	void OnUIClose();
	void SetupAndShowUI(class UNoceAnimWidget*& Widget, const struct FSoftClassPath& Path);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ShowShortcutItemUI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ShowShortcutItemUI_C")
	}
	static class UGA_ShowShortcutItemUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ShowShortcutItemUI_C>();
	}
};
DUMPER7_ASSERTS_UGA_ShowShortcutItemUI_C;

}

