#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_StaminaMonitor

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_StaminaMonitor.GA_StaminaMonitor_C
// 0x00E0 (0x04B0 - 0x03D0)
class UGA_StaminaMonitor_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayAttribute                     Attribute_Stamina;                                 // 0x03D8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                     Attribute_MaxStamina;                              // 0x0410(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_StaminaHandle;                                  // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_StaminaTiredTimerHandle;                        // 0x0450(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_StaminaFull;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_StaminaFine;                                    // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_StaminaTired;                                   // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_StaminaRegen;                                   // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_StaminaTiredTimerTick;                          // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerAnimInstance*                NocePlayerAnimInstance;                            // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FSoftObjectPath                        RTPC;                                              // 0x0490(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Audio_SetRTPC(const struct FSoftObjectPath& RTPC_0, double RTPC_Value);
	void ExecuteUbergraph_GA_StaminaMonitor(int32 EntryPoint);
	double GetMaxStamina();
	double GetStamina();
	void K2_ActivateAbility();
	void OnChange_95F876E24A0671F43803078D86BB06EF();
	void QueueStaminaState();
	void UpdateStaminaStatus();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_StaminaMonitor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_StaminaMonitor_C")
	}
	static class UGA_StaminaMonitor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_StaminaMonitor_C>();
	}
};
DUMPER7_ASSERTS_UGA_StaminaMonitor_C;

}

