#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_UseShortcutItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_UseShortcutItem.GA_UseShortcutItem_C
// 0x0070 (0x0440 - 0x03D0)
class UGA_UseShortcutItem_C final : public UNoceGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANocePlayerCharacter*                   PlayerCharacter;                                   // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ConsumableName;                                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageToPlay;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimPlusBankComponent*                 AnimPlus;                                          // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimID;                                            // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OrigialBattleStatusTime;                           // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RemainBattleStatuTimer;                            // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNocePlayerClawTransformComponent*      PlayClawTransformComp;                             // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Audio_Delay;                                       // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               Audio_Recover;                                     // 0x0424(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      Task_LinkMotion;                                   // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      Task_Damage;                                       // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_56658ABA48C875E1638DE48DD1BE9FB6();
	void Added_C990A1A9465DA2D40614CEA8FBED3BEA();
	void Added_FFE0D6DC4931E72BADCD359091FE99C8();
	void ApplyBattleStatusTimerTick();
	void Audio_SetItemTy_pe(const struct FGameplayTag& SwitchValue);
	void CanUseItem(class FName InConsumableName, bool* OutValue);
	void ExecuteUbergraph_GA_UseShortcutItem(int32 EntryPoint);
	int32 GetConsumableNum(class FName InConsumableName);
	void HandleEndAbility();
	void HandleStopMontage();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_F91FDD4446A72D785CE466BDD8C04CA2(class FName NotifyName);
	void OnCompleted_F91FDD4446A72D785CE466BDD8C04CA2(class FName NotifyName);
	void OnInterrupted_F91FDD4446A72D785CE466BDD8C04CA2(class FName NotifyName);
	void OnNotifyBegin_F91FDD4446A72D785CE466BDD8C04CA2(class FName NotifyName);
	void OnNotifyEnd_F91FDD4446A72D785CE466BDD8C04CA2(class FName NotifyName);
	void Removed_86E546BD4B0383EAC0840397EDFD618D();
	void Removed_EEB3AC4645686CF43519A189CC71A45F();
	void SetBattleStatusTime(float InMagnitude);
	void SetupForBattleStatusTimerTick();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_UseShortcutItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_UseShortcutItem_C")
	}
	static class UGA_UseShortcutItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_UseShortcutItem_C>();
	}
};
DUMPER7_ASSERTS_UGA_UseShortcutItem_C;

}

