#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameSettings

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "GameSettings_structs.hpp"


namespace SDK::Params
{

// Function GameSettings.GameSetting.GetDisabledReason
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetDisabledReason final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDisabledReason;

// Function GameSettings.GameSetting.GetDisplayNameVisibility
// 0x0001 (0x0001 - 0x0000)
struct GameSetting_GetDisplayNameVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDisplayNameVisibility;

// Function GameSettings.GameSetting.GetIsDisable
// 0x0001 (0x0001 - 0x0000)
struct GameSetting_GetIsDisable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetIsDisable;

// Function GameSettings.GameSetting.GetDescriptionRichText
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetDescriptionRichText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDescriptionRichText;

// Function GameSettings.GameSetting.GetDevName
// 0x0008 (0x0008 - 0x0000)
struct GameSetting_GetDevName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDevName;

// Function GameSettings.GameSetting.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDisplayName;

// Function GameSettings.GameSetting.GetDynamicDetails
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetDynamicDetails final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDynamicDetails;

// Function GameSettings.GameSetting.GetTags
// 0x0020 (0x0020 - 0x0000)
struct GameSetting_GetTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetTags;

// Function GameSettings.GameSetting.GetWarningRichText
// 0x0010 (0x0010 - 0x0000)
struct GameSetting_GetWarningRichText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetWarningRichText;

// Function GameSettings.GameSettingAction.GetActionText
// 0x0010 (0x0010 - 0x0000)
struct GameSettingAction_GetActionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingAction_GetActionText;

// Function GameSettings.GameSettingAction.GetNamedAction
// 0x0008 (0x0008 - 0x0000)
struct GameSettingAction_GetNamedAction final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingAction_GetNamedAction;

// Function GameSettings.GameSettingValueDiscrete.SetDiscreteOptionByIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDiscrete_SetDiscreteOptionByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDiscrete_SetDiscreteOptionByIndex;

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptionDefaultIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptionDefaultIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDiscrete_GetDiscreteOptionDefaultIndex;

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptionIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDiscrete_GetDiscreteOptionIndex;

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptions
// 0x0010 (0x0010 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptions final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDiscrete_GetDiscreteOptions;

// Function GameSettings.GameSettingValueScalar.SetValue
// 0x0010 (0x0010 - 0x0000)
struct GameSettingValueScalar_SetValue final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameSettingChangeReason                      Reason;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameSettingValueScalar_SetValue;

// Function GameSettings.GameSettingValueScalar.SetValueNormalized
// 0x0008 (0x0008 - 0x0000)
struct GameSettingValueScalar_SetValueNormalized final
{
public:
	double                                        NormalizedValue;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueScalar_SetValueNormalized;

// Function GameSettings.GameSettingValueScalar.GetFormattedText
// 0x0010 (0x0010 - 0x0000)
struct GameSettingValueScalar_GetFormattedText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueScalar_GetFormattedText;

// Function GameSettings.GameSettingValueScalar.GetNormalizedStepSize
// 0x0008 (0x0008 - 0x0000)
struct GameSettingValueScalar_GetNormalizedStepSize final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueScalar_GetNormalizedStepSize;

// Function GameSettings.GameSettingValueScalar.GetValueNormalized
// 0x0008 (0x0008 - 0x0000)
struct GameSettingValueScalar_GetValueNormalized final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueScalar_GetValueNormalized;

}

