#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameNoce

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "NeoAudio_structs.hpp"
#include "GameNoce_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SMSystem_classes.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "NeoCheater_classes.hpp"
#include "Gauntlet_classes.hpp"
#include "MovieScene_classes.hpp"
#include "Niagara_structs.hpp"
#include "Niagara_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "GameSettings_structs.hpp"
#include "GameSettings_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AdvancedThirdPersonCamera_structs.hpp"
#include "AdvancedThirdPersonCamera_classes.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "NBControlRig_structs.hpp"
#include "AudioMixer_structs.hpp"
#include "NavigationSystem_classes.hpp"
#include "NoceBase_structs.hpp"


namespace SDK
{

// Class GameNoce.NoceUserWidgetBase
// 0x0020 (0x0300 - 0x02E0)
class UNoceUserWidgetBase : public UUserWidget
{
public:
	uint8                                         Pad_2E0[0x20];                                     // 0x02E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToInputDeviceUpdateList(class UWidget* InWidget);
	void ClearResource(bool* NoUse);
	void OnInputDeviceChanged();
	void OnLanguageChanged();
	void OnSynchronizeProperties();
	void PlayUIAnimation(class UWidgetAnimation* InAnimation, bool IsLoop, bool IsRestorable);
	void PlayUISound(const struct FNeoAudioTriggerIdHandle& TriggerId);
	void StopUIAnimations(const TArray<class UWidgetAnimation*>& InAnimations);
	void SynchronizeProperties();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceUserWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceUserWidgetBase")
	}
	static class UNoceUserWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceUserWidgetBase>();
	}
};
DUMPER7_ASSERTS_UNoceUserWidgetBase;

// Class GameNoce.NoceSelectItemWidget
// 0x0078 (0x0378 - 0x0300)
class UNoceSelectItemWidget : public UNoceUserWidgetBase
{
public:
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Default;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Focus;                                             // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Select;                                            // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Unfocus;                                           // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Disable;                                           // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       DisableFocus;                                      // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       DisableSelect;                                     // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       DisableUnfocus;                                    // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Decide;                                            // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       DisableDecide;                                     // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                Container;                                         // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UWidgetAnimation*>               SelectAnimations;                                  // 0x0360(0x0010)(BlueprintVisible, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          IsDisable;                                         // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidgetAnimation* GetAnimation(class UWidgetAnimation* NormalAnim, class UWidgetAnimation* DisableAnim);
	void OnDecideCompleted();
	void OnFocusCompleted();
	void OnUnfocusCompleted();
	void StopSelectAnimations();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceSelectItemWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceSelectItemWidget")
	}
	static class UNoceSelectItemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceSelectItemWidget>();
	}
};
DUMPER7_ASSERTS_UNoceSelectItemWidget;

// Class GameNoce.NoceScrollItemWidget
// 0x0048 (0x03C0 - 0x0378)
class UNoceScrollItemWidget : public UNoceSelectItemWidget
{
public:
	uint8                                         Pad_378[0x28];                                     // 0x0378(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               SelectingAnimations;                               // 0x03A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UWidgetAnimation*>               UnSelectingAnimations;                             // 0x03B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	bool GetIsSelected();
	void RefreshObject(class UObject* Object);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceScrollItemWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceScrollItemWidget")
	}
	static class UNoceScrollItemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceScrollItemWidget>();
	}
};
DUMPER7_ASSERTS_UNoceScrollItemWidget;

// Class GameNoce.NoceSaveLoadListItemWidget
// 0x0020 (0x03E0 - 0x03C0)
class UNoceSaveLoadListItemWidget final : public UNoceScrollItemWidget
{
public:
	class UWidgetAnimation*                       Empty;                                             // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       EmptyFocus;                                        // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       EmptySelect;                                       // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       EmptyUnfocus;                                      // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceSaveLoadListItemWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceSaveLoadListItemWidget")
	}
	static class UNoceSaveLoadListItemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceSaveLoadListItemWidget>();
	}
};
DUMPER7_ASSERTS_UNoceSaveLoadListItemWidget;

// Class GameNoce.NoceANS_BodyPartGroup
// 0x0048 (0x0078 - 0x0030)
class UNoceANS_BodyPartGroup final : public UAnimNotifyState
{
public:
	bool                                          DebugLog;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BeginAddBodyPartGroups;                            // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           BeginRemoveBodyPartGroups;                         // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           EndAddBodyPartGroups;                              // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           EndRemoveBodyPartGroups;                           // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceANS_BodyPartGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceANS_BodyPartGroup")
	}
	static class UNoceANS_BodyPartGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceANS_BodyPartGroup>();
	}
};
DUMPER7_ASSERTS_UNoceANS_BodyPartGroup;

// Class GameNoce.AsyncActionHandleNoceStorage
// 0x0030 (0x0060 - 0x0030)
class UAsyncActionHandleNoceStorage final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class USaveGame* SaveGame, bool bSuccess)> Completed;              // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              SaveGameObject;                                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAsyncActionHandleNoceStorage* NoceAsyncLoadGameFromSlot(class UObject* WorldContextObject, const int32 SlotIndex);
	static class UAsyncActionHandleNoceStorage* NoceAsyncSaveClearGameToSlot(class UObject* WorldContextObject, const int32 SlotIndex, ENoceEndingType ClearEndingType, bool ClearProgress);
	static class UAsyncActionHandleNoceStorage* NoceAsyncSaveGameToSlot(class UObject* WorldContextObject, const int32 SlotIndex, class FName LocationName, class AActor* InActor);
	static class UAsyncActionHandleNoceStorage* NoceAsyncSaveSystemSave(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncActionHandleNoceStorage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncActionHandleNoceStorage")
	}
	static class UAsyncActionHandleNoceStorage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncActionHandleNoceStorage>();
	}
};
DUMPER7_ASSERTS_UAsyncActionHandleNoceStorage;

// Class GameNoce.NoceANS_ApplyGameplayEffect
// 0x0020 (0x0050 - 0x0030)
class UNoceANS_ApplyGameplayEffect : public UAnimNotifyState
{
public:
	int32                                         GameplayEffectLevel;                               // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UGameplayEffect>>    GameplayEffects;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          RemoveAtEnd;                                       // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceANS_ApplyGameplayEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceANS_ApplyGameplayEffect")
	}
	static class UNoceANS_ApplyGameplayEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceANS_ApplyGameplayEffect>();
	}
};
DUMPER7_ASSERTS_UNoceANS_ApplyGameplayEffect;

// Class GameNoce.NoceCheatLevelExtension
// 0x0070 (0x0158 - 0x00E8)
class UNoceCheatLevelExtension final : public UNeoCheatManagerExtension
{
public:
	int32                                         LastMapGroupIndex;                                 // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastMapIndex;                                      // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastMapIconIndex;                                  // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastMapIconChapter;                                // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastMapIconIndexV2;                                // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastSpecialTagIndex;                               // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FText>                           CurrentMapGroups;                                  // 0x0100(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<ENoceMapLocation>                      CurrentMapLocations;                               // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<ENoceDynamicMapIconType>               CurrentMapIcons;                                   // 0x0120(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          IsAddMap;                                          // 0x0130(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ENoceDynamicMapIconChapterType>        CurrentMapIconChapters;                            // 0x0138(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<ENoceDynamicMapIconIndexType>          CurrentMapIconIndexes;                             // 0x0148(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	bool AddSpecialTag();
	void Debug_AddAllMapLocationIDs();
	void Debug_AddMapLocationID();
	void Debug_AddRemoveMapIcon();
	void Debug_AddSpecialTag();
	void Debug_RemoveMapLocationID();
	TArray<class FText> GetSpecialTags(int32 Index_0);
	void OnAddSpecialTagWindowDecided(const struct FNeoCheatPopWindowOutputParam& Result);
	void OnMapIconDecided(const struct FNeoCheatPopWindowOutputParam& Result);
	void OnMapIconDecidedV2(const struct FNeoCheatPopWindowOutputParam& Result);
	void OnMapWindowDecided(const struct FNeoCheatPopWindowOutputParam& Result);
	void RefreshMinimap();
	void ToggleMinimap();
	void ZoomInMinimap();
	void ZoomOutMinimap();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceCheatLevelExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceCheatLevelExtension")
	}
	static class UNoceCheatLevelExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceCheatLevelExtension>();
	}
};
DUMPER7_ASSERTS_UNoceCheatLevelExtension;

// Class GameNoce.NoceBodyPartGroupHealth
// 0x0028 (0x02B8 - 0x0290)
class ANoceBodyPartGroupHealth final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        ActorRootComponent;                                // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNoceAbilitySystemComponent*            AbilitySystemComponent;                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNoceBodyPartGroupAttributeSet*         AttributeSet;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceBodyPartGroupHealth")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceBodyPartGroupHealth")
	}
	static class ANoceBodyPartGroupHealth* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANoceBodyPartGroupHealth>();
	}
};
DUMPER7_ASSERTS_ANoceBodyPartGroupHealth;

// Class GameNoce.BTDecorator_NoceAI_TagCooldown
// 0x0008 (0x0080 - 0x0078)
class UBTDecorator_NoceAI_TagCooldown final : public UBTDecorator_TagCooldown
{
public:
	float                                         RandomDeviation;                                   // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_NoceAI_TagCooldown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_NoceAI_TagCooldown")
	}
	static class UBTDecorator_NoceAI_TagCooldown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_NoceAI_TagCooldown>();
	}
};
DUMPER7_ASSERTS_UBTDecorator_NoceAI_TagCooldown;

// Class GameNoce.NoceAnimNotify
// 0x0000 (0x0038 - 0x0038)
class UNoceAnimNotify : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceAnimNotify")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceAnimNotify")
	}
	static class UNoceAnimNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceAnimNotify>();
	}
};
DUMPER7_ASSERTS_UNoceAnimNotify;

// Class GameNoce.NoceCharacterMovementComponent
// 0x0030 (0x0FB0 - 0x0F80)
class UNoceCharacterMovementComponent final : public UCharacterMovementComponent
{
public:
	class UNoceGameplayTagDataAsset*              TagDataAsset;                                      // 0x0F78(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANocePlayerCharacter*                   PlayerCharacter;                                   // 0x0F80(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSpeedRatio;                                    // 0x0F88(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SprintSpeedMultiplier;                             // 0x0F8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WalkSpeedMultiplier;                               // 0x0F90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TiredSprintSpeedMultiplier;                        // 0x0F94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TiredWalkSpeedMultiplier;                          // 0x0F98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SlopeSprintSpeedMultiplier;                        // 0x0F9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SlopeWalkSpeedMultiplier;                          // 0x0FA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FA4[0xC];                                      // 0x0FA4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMoveSpeedRatio(float InValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceCharacterMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceCharacterMovementComponent")
	}
	static class UNoceCharacterMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceCharacterMovementComponent>();
	}
};
DUMPER7_ASSERTS_UNoceCharacterMovementComponent;

// Class GameNoce.BTTask_NoceAI_Base
// 0x0030 (0x00A0 - 0x0070)
class UBTTask_NoceAI_Base : public UBTTaskNode
{
public:
	uint8                                         bShowPropertyDetails : 1;                          // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_71[0x17];                                      // 0x0071(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIOwner;                                           // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 ActorOwner;                                        // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APawn*                                  AIOwnerPawn;                                       // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_NoceAI_Base")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_NoceAI_Base")
	}
	static class UBTTask_NoceAI_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_NoceAI_Base>();
	}
};
DUMPER7_ASSERTS_UBTTask_NoceAI_Base;

// Class GameNoce.BTTask_NoceAI_ActivateAbility
// 0x0028 (0x00C8 - 0x00A0)
class UBTTask_NoceAI_ActivateAbility final : public UBTTask_NoceAI_Base
{
public:
	TSubclassOf<class UGameplayAbility>           AbilityClass;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_NoceAI_ActivateAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_NoceAI_ActivateAbility")
	}
	static class UBTTask_NoceAI_ActivateAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_NoceAI_ActivateAbility>();
	}
};
DUMPER7_ASSERTS_UBTTask_NoceAI_ActivateAbility;

// Class GameNoce.NoceANS_AttackTraceEnvironment
// 0x0040 (0x0070 - 0x0030)
class UNoceANS_AttackTraceEnvironment final : public UAnimNotifyState
{
public:
	struct FGameplayTagContainer                  AnyMatchingGameplayTags;                           // 0x0030(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FName                                   ComboName;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           AttackTraceNames;                                  // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceANS_AttackTraceEnvironment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceANS_AttackTraceEnvironment")
	}
	static class UNoceANS_AttackTraceEnvironment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceANS_AttackTraceEnvironment>();
	}
};
DUMPER7_ASSERTS_UNoceANS_AttackTraceEnvironment;

// Class GameNoce.NoceCheatTitleUIExtension
// 0x0000 (0x00E8 - 0x00E8)
class UNoceCheatTitleUIExtension final : public UNeoCheatManagerExtension
{
public:
	void Debug_AutoSwitchInputIcon(bool InEnable);
	void Debug_HideDevInfo(bool InValue);
	void Debug_SetSkipLogo(bool InValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceCheatTitleUIExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceCheatTitleUIExtension")
	}
	static class UNoceCheatTitleUIExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceCheatTitleUIExtension>();
	}
};
DUMPER7_ASSERTS_UNoceCheatTitleUIExtension;

// Class GameNoce.ChooseSkinListObject
// 0x00F0 (0x0118 - 0x0028)
class UChooseSkinListObject final : public UObject
{
public:
	struct FNoceUIChooseSkinData                  Data;                                              // 0x0028(0x00E8)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          IsEquipped;                                        // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooseSkinListObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooseSkinListObject")
	}
	static class UChooseSkinListObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooseSkinListObject>();
	}
};
DUMPER7_ASSERTS_UChooseSkinListObject;

// Class GameNoce.CollectibleListObject
// 0x0050 (0x0078 - 0x0028)
class UCollectibleListObject final : public UObject
{
public:
	class FName                                   ID;                                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   NameText;                                          // 0x0030(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ImagePath;                                         // 0x0040(0x0020)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsNew;                                             // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutoUpdateNew;                                   // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  IsNewLetter;                                       // 0x0068(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CollectibleListObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CollectibleListObject")
	}
	static class UCollectibleListObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectibleListObject>();
	}
};
DUMPER7_ASSERTS_UCollectibleListObject;

// Class GameNoce.NoceChunkInstance
// 0x00D8 (0x0108 - 0x0030)
class UNoceChunkInstance : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnQueryDLCCompletedDelegate;                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bChunk1NewlyInstalled;                             // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OnlineSubsystemName;                               // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             ChunkDataTable;                                    // 0x0058(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         OwnedDLCList;                                      // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0x28];                                      // 0x0070(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          HasQueriedDLC;                                     // 0x0098(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsQueryDLCCompleted;                               // 0x0099(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsTryingLogin;                                     // 0x009A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          DebugShowChunk;                                    // 0x009B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUsingChunkDebugData;                             // 0x009C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x6B];                                      // 0x009D(0x006B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckDownloadableContentByRowName(class FName InRowName, bool* OutIsChunkInstalled, bool* OutIsOwnedDLC);
	void Initialize_BP();
	void SetupDebugData_BP();
	void SetUsingChunkDebugData(bool InIsEnable);
	void ShowCheckDLCResult_BP(class FName InRowName, bool IsChunkInstalled, bool IsOwnedDLC);
	void StartQueryDLC();
	void StopQueryDLC();
	bool UpdateChunkDebugData(class FName InRowName, ENoceChunkDebugType InType, ENoceChunkDebugAction InAction);

	bool DoesChunkFileExist(int32 InChunkID) const;
	struct FNoceChunkDataRow GetChunkDataByName(class FName InName) const;
	TArray<class FName> GetChunkDataRowNames() const;
	int32 GetChunkIDFromDataRow(const struct FNoceChunkDataRow& InDataRow) const;
	bool GetDebugDataByType(class FName InRowName, ENoceChunkDebugType InType) const;
	class FString GetDownloadContentIDFromDataRow(const struct FNoceChunkDataRow& InDataRow) const;
	bool IsChunkInstalled(int32 InChunkID) const;
	bool IsChunkInstalledByRowName(class FName InRowName) const;
	bool IsOwnedDLCByID(const class FString& InDLCID) const;
	bool IsOwnedDLCByRowName(class FName InRowName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceChunkInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceChunkInstance")
	}
	static class UNoceChunkInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceChunkInstance>();
	}
};
DUMPER7_ASSERTS_UNoceChunkInstance;

// Class GameNoce.NoceShowByProgressBaseComponent
// 0x0090 (0x0130 - 0x00A0)
class UNoceShowByProgressBaseComponent : public UActorComponent
{
public:
	struct FGameplayTagContainer                  ProgressCondition;                                 // 0x00A0(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          NeedExactProgress;                                 // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AdditionalTags;                                    // 0x00C8(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          AllAdditionalTags;                                 // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeedAdditionalTagNum;                              // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  WithOutAdditionalTags;                             // 0x00F0(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          WithoutAllAdditionalTags;                          // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RoundBitmask;                                      // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         EndingBitmask;                                     // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ValidRoundBitmask;                                 // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0x10];                                     // 0x0120(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAdditionalTagChanged(const struct FGameplayTag& InTag);
	void OnProgressChanged(const struct FGameplayTag& InTag);
	void OnProgressInitialized(const struct FGameplayTag& InTag);
	void OnProgressOrTagChanged_BP();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceShowByProgressBaseComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceShowByProgressBaseComponent")
	}
	static class UNoceShowByProgressBaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceShowByProgressBaseComponent>();
	}
};
DUMPER7_ASSERTS_UNoceShowByProgressBaseComponent;

// Class GameNoce.NoceNiagaraByProgressComponent
// 0x0108 (0x0238 - 0x0130)
class UNoceNiagaraByProgressComponent final : public UNoceShowByProgressBaseComponent
{
public:
	bool                                          BlendVariable;                                     // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      ScalarParams;                                      // 0x0138(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            BlendCurve;                                        // 0x0188(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlendTime;                                         // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ActivateOnConditionMatch;                          // 0x0194(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetComponentTag;                                // 0x0198(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(float Alpha)>   OnBlendingFinish;                                  // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x01B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, float>                      OriginalScalarParams;                              // 0x01B8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	bool                                          IsBlending;                                        // 0x0208(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentBlendDuration;                              // 0x020C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TargetAlpha;                                       // 0x0210(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SourceAlpha;                                       // 0x0214(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_218[0x10];                                     // 0x0218(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          DrawDebug;                                         // 0x0228(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0xF];                                      // 0x0229(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceNiagaraByProgressComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceNiagaraByProgressComponent")
	}
	static class UNoceNiagaraByProgressComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceNiagaraByProgressComponent>();
	}
};
DUMPER7_ASSERTS_UNoceNiagaraByProgressComponent;

// Class GameNoce.FrameworkFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFrameworkFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class ANoceWorldSettings* GetNoceWorldSettings(const class UObject* WorldContextObject);
	static bool IsGameMode(const class UObject* WorldContextObject, TSubclassOf<class AGameModeBase> GameModeClass);
	static bool IsNoceGameMode(const class UObject* WorldContextObject);
	static bool IsNoceTitleGameMode(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FrameworkFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FrameworkFunctionLibrary")
	}
	static class UFrameworkFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrameworkFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UFrameworkFunctionLibrary;

// Class GameNoce.GameNoceGameModeBase
// 0x0040 (0x0368 - 0x0328)
class AGameNoceGameModeBase : public AGameModeBase
{
public:
	TMulticastInlineDelegate<void(ENoceEndingType NewEndingType)> OnStoryEndingChanged;              // 0x0328(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ENocePlayerOutfit NewPlayerOutfit)> OnPlayerOutfitChanged;         // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ENocePlayerType InPlayerType, class FName InCharMeshRowName)> OnUpdatePlayerCharMeshType; // 0x0348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	ENoceActionLevel                              GameActionLevel;                                   // 0x0358(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENoceRiddleLevel                              GameRiddleLevel;                                   // 0x0359(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENoceRoundType                                GameRoundType;                                     // 0x035A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35B[0x1];                                      // 0x035B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SimulateStoryClearBitMask;                         // 0x035C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENoceEndingType                               GameEndingType;                                    // 0x0360(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENocePlayerOutfit                             PlayerOutfitValue;                                 // 0x0361(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ENoceActionLevel GetActionLevel();
	ENocePlayerOutfit GetPlayerOutfitValue();
	ENocePlayerOutfit GetPlayerSaveGameOutfit();
	ENoceRiddleLevel GetRiddleLevel();
	ENoceRoundType GetRoundType();
	ENoceRoundType GetSaveGameRoundType();
	int32 GetSimulateStoryClearBitmask();
	ENoceEndingType GetStoryEndingType();
	void HandleUpdatePlayerCharMeshType(ENocePlayerType InPlayerType, class FName InCharMeshRowName);
	void OnSystemSaveLoaded(class UNoceSystemSaveGame* SystemSave);
	void OnSystemSaveSaved(class UNoceSystemSaveGame* SystemSave);
	void SetActionLevel(ENoceActionLevel ActionLevel);
	void SetPlayerOutfitValue(ENocePlayerOutfit InType);
	void SetRiddleLevel(ENoceRiddleLevel RiddleLevel);
	void SetSimulateRoundType(ENoceRoundType DebugRoundType);
	void SetSimulateStoryClearBitmask(int32 BitMask);
	void SetStoryEndingType(ENoceEndingType EndingType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameNoceGameModeBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameNoceGameModeBase")
	}
	static class AGameNoceGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameNoceGameModeBase>();
	}
};
DUMPER7_ASSERTS_AGameNoceGameModeBase;

// Class GameNoce.NoceTestBaseController
// 0x00B0 (0x00E0 - 0x0030)
class UNoceTestBaseController : public UGauntletTestController
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMemReportIntervalChanged();
	void OnMemReportTimerExpired();
	void TryEarlyExec(const class UWorld* World);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceTestBaseController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceTestBaseController")
	}
	static class UNoceTestBaseController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceTestBaseController>();
	}
};
DUMPER7_ASSERTS_UNoceTestBaseController;

// Class GameNoce.GameNoceSettings
// 0x0188 (0x01C0 - 0x0038)
class UGameNoceSettings final : public UDeveloperSettings
{
public:
	class FString                                 AfterDofMatPostfix;                                // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WorldTransDissolvePostfix;                         // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<ENoceWorldTransTimeGroup, class FName>   WorldTransTimeMatParameters;                       // 0x0058(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MultiRoundSeqTableList;                            // 0x00A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            SolveLumenGhostingCmds;                            // 0x00C8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            GlobalCmdsForHQLQ;                                 // 0x0118(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UObject>>         RootCutSceneAssets;                                // 0x0168(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           RootCutSceneClasses;                               // 0x0178(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UObject>>         RootDataTables;                                    // 0x0188(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ProfilingActorClass;                               // 0x0198(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameNoceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameNoceSettings")
	}
	static class UGameNoceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameNoceSettings>();
	}
};
DUMPER7_ASSERTS_UGameNoceSettings;

// Class GameNoce.InventoryItemListObject
// 0x0048 (0x0070 - 0x0028)
class UInventoryItemListObject final : public UObject
{
public:
	ENoceInventoryType                            Type;                                              // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   NameText;                                          // 0x0038(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ImagePath;                                         // 0x0048(0x0020)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEquipped;                                        // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsNew;                                             // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsShowQuantity;                                    // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBlank;                                           // 0x006B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFaithItem;                                       // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InventoryItemListObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InventoryItemListObject")
	}
	static class UInventoryItemListObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryItemListObject>();
	}
};
DUMPER7_ASSERTS_UInventoryItemListObject;

// Class GameNoce.NoceANS_ApplyGESetByCaller
// 0x0010 (0x0040 - 0x0030)
class UNoceANS_ApplyGESetByCaller final : public UAnimNotifyState
{
public:
	TArray<struct FNoceApplyGESetByCaller>        GameplayEffects;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceANS_ApplyGESetByCaller")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceANS_ApplyGESetByCaller")
	}
	static class UNoceANS_ApplyGESetByCaller* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceANS_ApplyGESetByCaller>();
	}
};
DUMPER7_ASSERTS_UNoceANS_ApplyGESetByCaller;

// Class GameNoce.NoceCheatManagerBase
// 0x0000 (0x02A0 - 0x02A0)
class UNoceCheatManagerBase : public UNeoCheatManager
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceCheatManagerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceCheatManagerBase")
	}
	static class UNoceCheatManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceCheatManagerBase>();
	}
};
DUMPER7_ASSERTS_UNoceCheatManagerBase;

// Class GameNoce.NoceCheatManager
// 0x01E8 (0x0488 - 0x02A0)
class UNoceCheatManager : public UNoceCheatManagerBase
{
public:
	bool                                          FreeCameraRotate;                                  // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanToggleDebugCamera;                              // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayerAttackRatio;                                 // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerWinceRatio;                                  // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerDeflectRatio;                                // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeaponDurabilityCostRatio;                         // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnemyAttackRatio;                                  // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnemyNoAttack;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowEnemyHealthBar;                                // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkipEnemyCounterableCheck;                         // 0x02BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
