#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstanceDamageSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum InstanceDamageSystem.EInstanceVisibilityInstigatorType
// NumValues: 0x000A
enum class EInstanceVisibilityInstigatorType : uint8
{
	None                                     = 0,
	SystemReset                              = 1,
	MarkRenderDirty                          = 2,
	Respawn                                  = 3,
	WorldActor                               = 4,
	UndamagedSwitch                          = 5,
	Replication                              = 6,
	ForceUpdate                              = 7,
	SaveRestore                              = 8,
	EInstanceVisibilityInstigatorType_MAX    = 9,
};

// Enum InstanceDamageSystem.EDestructibleRemovalHandling
// NumValues: 0x0004
enum class EDestructibleRemovalHandling : uint8
{
	RemoveIfOutOfRange                       = 0,
	AlwaysRemove                             = 1,
	NeverRemove                              = 2,
	EDestructibleRemovalHandling_MAX         = 3,
};

// ScriptStruct InstanceDamageSystem.InstanceID
// 0x0030 (0x0030 - 0x0000)
struct FInstanceID final
{
public:
	TSoftObjectPtr<class UInstancedStaticMeshComponent> InstancedMesh;                               // 0x0000(0x0028)(Edit, BlueprintVisible, ExportObject, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceIndex;                                     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FInstanceID;

// ScriptStruct InstanceDamageSystem.IDSSetupInfo
// 0x0080 (0x0088 - 0x0008)
struct FIDSSetupInfo final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x0008(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0030(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    CustomData;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         PoolSize;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDestructibleRemovalHandling                  RemovalHandling;                                   // 0x006C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LifeSpan;                                          // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HiddenOffset;                                      // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemovalDistance;                                   // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RespawnDistance;                                   // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             RadialDmgPreventionChannel;                        // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIDSSetupInfo;

// ScriptStruct InstanceDamageSystem.HiddenInstancesInfo
// 0x0038 (0x0038 - 0x0000)
struct FHiddenInstancesInfo final
{
public:
	TSoftObjectPtr<class UInstancedStaticMeshComponent> InstancedMesh;                               // 0x0000(0x0028)(Edit, BlueprintVisible, ExportObject, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 InstanceIndexes;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHiddenInstancesInfo;

}

