#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NBControlRig

#include "Basic.hpp"

#include "NBControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NBControlRig.ANS_FullBodyIKBase.OnUpdateFullBodyIKContext
// 0x0020 (0x0020 - 0x0000)
struct ANS_FullBodyIKBase_OnUpdateFullBodyIKContext final
{
public:
	struct FFullBodyIKContext                     FullBodyIKCtxU;                                    // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ANS_FullBodyIKBase_OnUpdateFullBodyIKContext;

// Function NBControlRig.IKControllerComponent.CalculateCustomAimTargetPosition
// 0x0038 (0x0038 - 0x0000)
struct IKControllerComponent_CalculateCustomAimTargetPosition final
{
public:
	struct FVector                                InAimTargetPosition;                               // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutAimTargetPosition;                              // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdated;                                          // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IKControllerComponent_CalculateCustomAimTargetPosition;

// Function NBControlRig.IKControllerComponent.CanApplyFullBodyIK
// 0x0001 (0x0001 - 0x0000)
struct IKControllerComponent_CanApplyFullBodyIK final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IKControllerComponent_CanApplyFullBodyIK;

// Function NBControlRig.IKControllerComponent.DisableIK
// 0x0010 (0x0010 - 0x0000)
struct IKControllerComponent_DisableIK final
{
public:
	const class UAnimNotifyState*                 InAnimNotifyState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EIKType                                       IKType;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendOutTime;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IKControllerComponent_DisableIK;

// Function NBControlRig.IKControllerComponent.EnableIK
// 0x0078 (0x0078 - 0x0000)
struct IKControllerComponent_EnableIK final
{
public:
	const class UAnimNotifyState*                 InAnimNotifyState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EIKType                                       IKType;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIKContext                             IKContext;                                         // 0x0010(0x0068)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IKControllerComponent_EnableIK;

// Function NBControlRig.IKControllerComponent.SetUpdateAimTargetPosition
// 0x0001 (0x0001 - 0x0000)
struct IKControllerComponent_SetUpdateAimTargetPosition final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IKControllerComponent_SetUpdateAimTargetPosition;

}

