#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NBMaterialLibrary

#include "Basic.hpp"

#include "NBMaterialLibrary_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NBMaterialLibrary.PreviewSceneManager.LoadLevelInstance
// 0x0088 (0x0088 - 0x0000)
struct PreviewSceneManager_LoadLevelInstance final
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0040(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOutSuccess;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionalLevelNameOverride;                         // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULevelStreamingDynamic>     OptionalLevelStreamingClass;                       // 0x0070(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadAsTempPackage;                                // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 ReturnValue;                                       // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PreviewSceneManager_LoadLevelInstance;

// Function NBMaterialLibrary.PreviewSceneManager.UpdatePreviewScene
// 0x0010 (0x0010 - 0x0000)
struct PreviewSceneManager_UpdatePreviewScene final
{
public:
	struct FPreviewSceneData                      InData;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PreviewSceneManager_UpdatePreviewScene;

// Function NBMaterialLibrary.PreviewSceneManager.IsPackage
// 0x0001 (0x0001 - 0x0000)
struct PreviewSceneManager_IsPackage final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PreviewSceneManager_IsPackage;

}

