#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeoAudio

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "NeoAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function NeoAudio.NeoAudioAcousticPortalVolume.GetCurrentState
// 0x0001 (0x0001 - 0x0000)
struct NeoAudioAcousticPortalVolume_GetCurrentState final
{
public:
	ENeoAudioAcousticPortalState                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioAcousticPortalVolume_GetCurrentState;

// Function NeoAudio.NeoAudioAmbientSound.GetCachedAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioAmbientSound_GetCachedAudioComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioAmbientSound_GetCachedAudioComponent;

// Function NeoAudio.NeoAudioAnimNotify_SendSoundTrigger.CanReportNoise
// 0x0018 (0x0018 - 0x0000)
struct NeoAudioAnimNotify_SendSoundTrigger_CanReportNoise final
{
public:
	class AActor*                                 InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InCanelReportGameplayTag;                          // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioAnimNotify_SendSoundTrigger_CanReportNoise;

// Function NeoAudio.NeoAudioAnimNotify_SendSoundTrigger.HandleLoudness
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioAnimNotify_SendSoundTrigger_HandleLoudness final
{
public:
	class AActor*                                 InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InOriginalLoudness;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioAnimNotify_SendSoundTrigger_HandleLoudness;

// Function NeoAudio.NeoAudioAnimNotify_SendSoundTrigger.ReportNoiseData
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioAnimNotify_SendSoundTrigger_ReportNoiseData final
{
public:
	class AActor*                                 InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioAnimNotify_SendSoundTrigger_ReportNoiseData;

// Function NeoAudio.NeoAudioAnimNotify_SendSoundTrigger.RunCustomCheck
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioAnimNotify_SendSoundTrigger_RunCustomCheck final
{
public:
	class AActor*                                 InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioAnimNotify_SendSoundTrigger_RunCustomCheck;

// Function NeoAudio.NeoAudioAutoTriggerMonitor.AddDataPoint
// 0x0004 (0x0004 - 0x0000)
struct NeoAudioAutoTriggerMonitor_AddDataPoint final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioAutoTriggerMonitor_AddDataPoint;

// Function NeoAudio.NeoAudioContactTriggerComponent.OnContact
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioContactTriggerComponent_OnContact final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioContactTriggerComponent_OnContact;

// Function NeoAudio.NeoAudioContactTriggerComponent.SetOwnerSoundComponent
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioContactTriggerComponent_SetOwnerSoundComponent final
{
public:
	class UNeoAudioSoundComponent*                SoundComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioContactTriggerComponent_SetOwnerSoundComponent;

// Function NeoAudio.NeoAudioCueReceiver.GetSoundComponent
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioCueReceiver_GetSoundComponent final
{
public:
	class UNeoAudioSoundComponent*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioCueReceiver_GetSoundComponent;

// Function NeoAudio.NeoAudioGameplayTagTrigger.SendGameplayTagTrigger
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioGameplayTagTrigger_SendGameplayTagTrigger final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameplayTagTrigger_SendGameplayTagTrigger;

// Function NeoAudio.NeoAudioGameSyncSystem.Deinitialize_BP
// 0x0001 (0x0001 - 0x0000)
struct NeoAudioGameSyncSystem_Deinitialize_BP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_Deinitialize_BP;

// Function NeoAudio.NeoAudioGameSyncSystem.GetStateInitialized
// 0x0001 (0x0001 - 0x0000)
struct NeoAudioGameSyncSystem_GetStateInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_GetStateInitialized;

// Function NeoAudio.NeoAudioGameSyncSystem.Initialize_BP
// 0x0001 (0x0001 - 0x0000)
struct NeoAudioGameSyncSystem_Initialize_BP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_Initialize_BP;

// Function NeoAudio.NeoAudioGameSyncSystem.PostDialogEvent
// 0x0020 (0x0020 - 0x0000)
struct NeoAudioGameSyncSystem_PostDialogEvent final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioTriggerIdHandle               TriggerId;                                         // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FNeoAudioPostDialogResult              ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_PostDialogEvent;

// Function NeoAudio.NeoAudioGameSyncSystem.PostInitialize_BP
// 0x0001 (0x0001 - 0x0000)
struct NeoAudioGameSyncSystem_PostInitialize_BP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_PostInitialize_BP;

// Function NeoAudio.NeoAudioGameSyncSystem.SetAudioProfile
// 0x0001 (0x0001 - 0x0000)
struct NeoAudioGameSyncSystem_SetAudioProfile final
{
public:
	uint8                                         Culture;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_SetAudioProfile;

// Function NeoAudio.NeoAudioGameSyncSystem.SetCulture
// 0x0004 (0x0004 - 0x0000)
struct NeoAudioGameSyncSystem_SetCulture final
{
public:
	int32                                         Culture;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_SetCulture;

// Function NeoAudio.NeoAudioGameSyncSystem.SetStateInitialized
// 0x0001 (0x0001 - 0x0000)
struct NeoAudioGameSyncSystem_SetStateInitialized final
{
public:
	bool                                          B;                                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_SetStateInitialized;

// Function NeoAudio.NeoAudioGameSyncSystem.Tick_BP
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioGameSyncSystem_Tick_BP final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioGameSyncSystem_Tick_BP;

// Function NeoAudio.NeoAudioInterface.OnEndAudioEvent
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioInterface_OnEndAudioEvent final
{
public:
	class USceneComponent*                        AttachToComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioInterface_OnEndAudioEvent;

// Function NeoAudio.NeoAudioInterface.OnStartAudioEvent
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioInterface_OnStartAudioEvent final
{
public:
	class USceneComponent*                        AttachToComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioInterface_OnStartAudioEvent;

// Function NeoAudio.NeoAudioLibrary.AddAudioOutput
// 0x0018 (0x0018 - 0x0000)
struct NeoAudioLibrary_AddAudioOutput final
{
public:
	class FString                                 OutputName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeviceID;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_AddAudioOutput;

// Function NeoAudio.NeoAudioLibrary.PostBGMEvent
// 0x0080 (0x0080 - 0x0000)
struct NeoAudioLibrary_PostBGMEvent final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioPostEventParam                InAudioPostEventParam;                             // 0x0008(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_PostBGMEvent;

// Function NeoAudio.NeoAudioLibrary.PostEvent
// 0x0098 (0x0098 - 0x0000)
struct NeoAudioLibrary_PostEvent final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioPostEventParam                InAudioPostEventParam;                             // 0x0008(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0078(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InAudioContext;                                    // 0x0080(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCache;                                      // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_PostEvent;

// Function NeoAudio.NeoAudioLibrary.PostEventAtComponent
// 0x00A8 (0x00A8 - 0x0000)
struct NeoAudioLibrary_PostEventAtComponent final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioPostEventParam                InAudioPostEventParam;                             // 0x0008(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USceneComponent*                        InAttachToComponent;                               // 0x0078(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InAttachName;                                      // 0x0080(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFollow;                                         // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InAudioContext;                                    // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCache;                                      // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_PostEventAtComponent;

// Function NeoAudio.NeoAudioLibrary.PostEventAtComponentLocally
// 0x00A8 (0x00A8 - 0x0000)
struct NeoAudioLibrary_PostEventAtComponentLocally final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioPostEventParam                InAudioPostEventParam;                             // 0x0008(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USceneComponent*                        InAttachToComponent;                               // 0x0078(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InAttachName;                                      // 0x0080(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFollow;                                         // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InAudioContext;                                    // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCache;                                      // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_PostEventAtComponentLocally;

// Function NeoAudio.NeoAudioLibrary.PostEventAtLocation
// 0x00C0 (0x00C0 - 0x0000)
struct NeoAudioLibrary_PostEventAtLocation final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioPostEventParam                InAudioPostEventParam;                             // 0x0008(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0078(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InOrientation;                                     // 0x0090(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                InAudioContext;                                    // 0x00A8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCache;                                      // 0x00B0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x00B8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_PostEventAtLocation;

// Function NeoAudio.NeoAudioLibrary.RemoveDefaultListener
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioLibrary_RemoveDefaultListener final
{
public:
	class UActorComponent*                        in_pListener;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_RemoveDefaultListener;

// Function NeoAudio.NeoAudioLibrary.ReplaceMainOutput
// 0x0018 (0x0018 - 0x0000)
struct NeoAudioLibrary_ReplaceMainOutput final
{
public:
	class FString                                 AudioDeviceShareSetName;                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IdDevice;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioLibrary_ReplaceMainOutput;

// Function NeoAudio.NeoAudioLibrary.SendTriggerFromTable
// 0x0018 (0x0018 - 0x0000)
struct NeoAudioLibrary_SendTriggerFromTable final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             InSoundTriggerTable;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioTriggerIdHandle               InTriggerID;                                       // 0x0010(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_SendTriggerFromTable;

// Function NeoAudio.NeoAudioLibrary.SetRTPCValue
// 0x0040 (0x0040 - 0x0000)
struct NeoAudioLibrary_SetRTPCValue final
{
public:
	struct FNeoAudioRTPCParam                     InAudioRTPCParam;                                  // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_SetRTPCValue;

// Function NeoAudio.NeoAudioLibrary.SetRTPCValueBySceneComponent
// 0x0048 (0x0048 - 0x0000)
struct NeoAudioLibrary_SetRTPCValueBySceneComponent final
{
public:
	struct FNeoAudioRTPCParam                     InAudioRTPCParam;                                  // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USceneComponent*                        InSceneComponent;                                  // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InAttachPointName;                                 // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_SetRTPCValueBySceneComponent;

// Function NeoAudio.NeoAudioLibrary.SetState
// 0x0038 (0x0038 - 0x0000)
struct NeoAudioLibrary_SetState final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioStateParam                    InAudioStateParam;                                 // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_SetState;

// Function NeoAudio.NeoAudioLibrary.SetStateByGameplayTag
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioLibrary_SetStateByGameplayTag final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InAudioState;                                      // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_SetStateByGameplayTag;

// Function NeoAudio.NeoAudioLibrary.SetSwitch
// 0x0038 (0x0038 - 0x0000)
struct NeoAudioLibrary_SetSwitch final
{
public:
	struct FNeoAudioSwitchParam                   InAudioSwitchParam;                                // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_SetSwitch;

// Function NeoAudio.NeoAudioLibrary.SetSwitchBySceneComponent
// 0x0040 (0x0040 - 0x0000)
struct NeoAudioLibrary_SetSwitchBySceneComponent final
{
public:
	struct FNeoAudioSwitchParam                   InAudioSwitchParam;                                // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USceneComponent*                        InSceneComponent;                                  // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InAttachPointName;                                 // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioLibrary_SetSwitchBySceneComponent;

// Function NeoAudio.NeoAudioSoundComponent.GetEventObjectFromTable
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSoundComponent_GetEventObjectFromTable final
{
public:
	struct FNeoAudioTriggerIdHandle               TriggerId;                                         // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSoundComponent_GetEventObjectFromTable;

// Function NeoAudio.NeoAudioSoundComponent.GetSwitch
// 0x000C (0x000C - 0x0000)
struct NeoAudioSoundComponent_GetSwitch final
{
public:
	ENeoAudioSwitchType                           SwitchType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSoundComponent_GetSwitch;

// Function NeoAudio.NeoAudioSoundComponent.SendSoundTrigger
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSoundComponent_SendSoundTrigger final
{
public:
	struct FNeoAudioTriggerIdHandle               TriggerId;                                         // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSoundComponent_SendSoundTrigger;

// Function NeoAudio.NeoAudioSoundComponent.SendSoundTriggerAtLocation
// 0x0028 (0x0028 - 0x0000)
struct NeoAudioSoundComponent_SendSoundTriggerAtLocation final
{
public:
	struct FNeoAudioTriggerIdHandle               TriggerId;                                         // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSoundComponent_SendSoundTriggerAtLocation;

// Function NeoAudio.NeoAudioSoundComponent.SetCue
// 0x000C (0x000C - 0x0000)
struct NeoAudioSoundComponent_SetCue final
{
public:
	ENeoAudioCueGroup                             CueGroup;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CueName;                                           // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSoundComponent_SetCue;

// Function NeoAudio.NeoAudioSoundComponent.SetEndCue
// 0x000C (0x000C - 0x0000)
struct NeoAudioSoundComponent_SetEndCue final
{
public:
	ENeoAudioCueGroup                             CueGroup;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CueName;                                           // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSoundComponent_SetEndCue;

// Function NeoAudio.NeoAudioSoundComponent.SetPhysicalSurfaceSwitch
// 0x0002 (0x0002 - 0x0000)
struct NeoAudioSoundComponent_SetPhysicalSurfaceSwitch final
{
public:
	ENeoAudioSwitchType                           SwitchType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              SurfaceType;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSoundComponent_SetPhysicalSurfaceSwitch;

// Function NeoAudio.NeoAudioSoundComponent.SetSwitch
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSoundComponent_SetSwitch final
{
public:
	struct FGameplayTag                           SwitchValue;                                       // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSoundComponent_SetSwitch;

// Function NeoAudio.NeoAudioSpaceSubsystem.GetCurrentSpatialAudioVolume
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSpaceSubsystem_GetCurrentSpatialAudioVolume final
{
public:
	class ANeoAudioSpatialAudioVolume*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSpaceSubsystem_GetCurrentSpatialAudioVolume;

// Function NeoAudio.NeoAudioSpaceSubsystem.ReCheckCurrentSpaceVolume
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSpaceSubsystem_ReCheckCurrentSpaceVolume final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSpaceSubsystem_ReCheckCurrentSpaceVolume;

// Function NeoAudio.NeoAudioSpatialAudioVolume.OnOverlapBegin
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSpatialAudioVolume_OnOverlapBegin final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSpatialAudioVolume_OnOverlapBegin;

// Function NeoAudio.NeoAudioSpatialAudioVolume.OnOverlapEnd
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSpatialAudioVolume_OnOverlapEnd final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSpatialAudioVolume_OnOverlapEnd;

// Function NeoAudio.NeoAudioSystem.ForceStopBGM
// 0x0001 (0x0001 - 0x0000)
struct NeoAudioSystem_ForceStopBGM final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_ForceStopBGM;

// Function NeoAudio.NeoAudioSystem.GetBGMLevelProgressState
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSystem_GetBGMLevelProgressState final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_GetBGMLevelProgressState;

// Function NeoAudio.NeoAudioSystem.GetBGMPosition
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSystem_GetBGMPosition final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioSystem_GetBGMPosition;

// Function NeoAudio.NeoAudioSystem.GetCurrGameFlowState
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSystem_GetCurrGameFlowState final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_GetCurrGameFlowState;

// Function NeoAudio.NeoAudioSystem.GetStackGameFlowState
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSystem_GetStackGameFlowState final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_GetStackGameFlowState;

// Function NeoAudio.NeoAudioSystem.PlayBGM
// 0x0018 (0x0018 - 0x0000)
struct NeoAudioSystem_PlayBGM final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpecifiedName;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopPrevious;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioSystem_PlayBGM;

// Function NeoAudio.NeoAudioSystem.PlayBGMByTag
// 0x0018 (0x0018 - 0x0000)
struct NeoAudioSystem_PlayBGMByTag final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InTag;                                             // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopPrevious;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioSystem_PlayBGMByTag;

// Function NeoAudio.NeoAudioSystem.PlayUISound
// 0x0018 (0x0018 - 0x0000)
struct NeoAudioSystem_PlayUISound final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioTriggerIdHandle               TriggerId;                                         // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioSystem_PlayUISound;

// Function NeoAudio.NeoAudioSystem.SeekBGMPosition
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSystem_SeekBGMPosition final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         position;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_SeekBGMPosition;

// Function NeoAudio.NeoAudioSystem.SendGameplayTagTrigger
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSystem_SendGameplayTagTrigger final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_SendGameplayTagTrigger;

// Function NeoAudio.NeoAudioSystem.SetBGMLevelProgressState
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSystem_SetBGMLevelProgressState final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_SetBGMLevelProgressState;

// Function NeoAudio.NeoAudioSystem.SetCurrGameFlowState
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSystem_SetCurrGameFlowState final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_SetCurrGameFlowState;

// Function NeoAudio.NeoAudioSystem.SetGlobalRTPC
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSystem_SetGlobalRTPC final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BypassInternalValueInterpolation;                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioSystem_SetGlobalRTPC;

// Function NeoAudio.NeoAudioSystem.SetGlobalRTPCCached
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSystem_SetGlobalRTPCCached final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BypassInternalValueInterpolation;                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioSystem_SetGlobalRTPCCached;

// Function NeoAudio.NeoAudioSystem.SetGlobalState
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSystem_SetGlobalState final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_SetGlobalState;

// Function NeoAudio.NeoAudioSystem.SetStackGameFlowState
// 0x0008 (0x0008 - 0x0000)
struct NeoAudioSystem_SetStackGameFlowState final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoAudioSystem_SetStackGameFlowState;

// Function NeoAudio.NeoAudioSystem.StopBGM
// 0x0010 (0x0010 - 0x0000)
struct NeoAudioSystem_StopBGM final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoAudioSystem_StopBGM;

// Function NeoAudio.SourcePlayPositionTest.GetPlayPostion
// 0x0004 (0x0004 - 0x0000)
struct SourcePlayPositionTest_GetPlayPostion final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SourcePlayPositionTest_GetPlayPostion;

// Function NeoAudio.SourcePlayPositionTest.PostEvent
// 0x0004 (0x0004 - 0x0000)
struct SourcePlayPositionTest_PostEvent final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SourcePlayPositionTest_PostEvent;

// Function NeoAudio.SourcePlayPositionTest.SeekPostion
// 0x0008 (0x0008 - 0x0000)
struct SourcePlayPositionTest_SeekPostion final
{
public:
	int32                                         position;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SourcePlayPositionTest_SeekPostion;

}

