#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeoAudio

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DataTablePlus_structs.hpp"


namespace SDK
{

// Enum NeoAudio.ENeoAudioAcousticPortalState
// NumValues: 0x0003
enum class ENeoAudioAcousticPortalState : uint8
{
	Closed                                   = 0,
	Open                                     = 1,
	ENeoAudioAcousticPortalState_MAX         = 2,
};

// Enum NeoAudio.ENeoAudioMeshType
// NumValues: 0x0003
enum class ENeoAudioMeshType : uint8
{
	StaticMesh                               = 0,
	CollisionMesh                            = 1,
	ENeoAudioMeshType_MAX                    = 2,
};

// Enum NeoAudio.ENeoAudioCurveInterpolation
// NumValues: 0x000C
enum class ENeoAudioCurveInterpolation : uint8
{
	Log3                                     = 0,
	Sine                                     = 1,
	Log1                                     = 2,
	InvSCurve                                = 3,
	Linear                                   = 4,
	SCurve                                   = 5,
	Exp1                                     = 6,
	SineRecip                                = 7,
	Exp3                                     = 8,
	LastFadeCurve                            = 8,
	Constant                                 = 9,
	ENeoAudioCurveInterpolation_MAX          = 10,
};

// Enum NeoAudio.ENeoAudioEventFilterType
// NumValues: 0x0003
enum class ENeoAudioEventFilterType : uint8
{
	ShowResult                               = 0,
	HideResult                               = 1,
	ENeoAudioEventFilterType_MAX             = 2,
};

// Enum NeoAudio.ENeoAudioFitToGeometryMode
// NumValues: 0x0004
enum class ENeoAudioFitToGeometryMode : uint8
{
	OrientedBox                              = 0,
	AlignedBox                               = 1,
	ConvexPolyhedron                         = 2,
	ENeoAudioFitToGeometryMode_MAX           = 3,
};

// Enum NeoAudio.ENeoAudioSwitchType
// NumValues: 0x0012
enum class ENeoAudioSwitchType : uint8
{
	INVALID                                  = 0,
	AnimationType                            = 1,
	BreathType                               = 2,
	CharDamageHitType                        = 3,
	DoorStatus                               = 4,
	DoorSpeedType                            = 5,
	EmCrawlHasBuff                           = 6,
	EmHasMask                                = 7,
	EmShiroCorruption                        = 8,
	EnemyType                                = 9,
	FloorType                                = 10,
	FootStep                                 = 11,
	HitSurfaceType                           = 12,
	PlayerType                               = 13,
	UIUseItemsType                           = 14,
	WeaponEquipType                          = 15,
	WeaponType                               = 16,
	ENeoAudioSwitchType_MAX                  = 17,
};

// Enum NeoAudio.ENeoAudioCueGroup
// NumValues: 0x000A
enum class ENeoAudioCueGroup : uint8
{
	INVALID                                  = 0,
	MV_Auto                                  = 1,
	VO_Auto                                  = 2,
	FT_Switch                                = 3,
	SE_Trigger                               = 4,
	FOOTSTEP_ONSTOP_Trigger                  = 5,
	TOUCH_CO_Trigger                         = 6,
	LAND_CO_Trigger                          = 7,
	Breath_Switch                            = 8,
	ENeoAudioCueGroup_MAX                    = 9,
};

// ScriptStruct NeoAudio.NeoAudioAutoTriggerSettingElement
// 0x0008 (0x0008 - 0x0000)
struct FNeoAudioAutoTriggerSettingElement final
{
public:
	class FName                                   EnableName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioAutoTriggerSettingElement;

// ScriptStruct NeoAudio.NeoAudioTriggerIdHandle
// 0x0008 (0x0008 - 0x0000)
struct FNeoAudioTriggerIdHandle final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioTriggerIdHandle;

// ScriptStruct NeoAudio.NeoAudioActorSpawnerDataElement
// 0x0038 (0x0038 - 0x0000)
struct FNeoAudioActorSpawnerDataElement final
{
public:
	class FName                                   CueName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   TargetActor;                                       // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioActorSpawnerDataElement;

// ScriptStruct NeoAudio.NeoAudioActorSpawnerData
// 0x0010 (0x0010 - 0x0000)
struct FNeoAudioActorSpawnerData final
{
public:
	TArray<struct FNeoAudioActorSpawnerDataElement> ActorParam;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioActorSpawnerData;

// ScriptStruct NeoAudio.NeoAudioPostEventParam
// 0x0070 (0x0070 - 0x0000)
struct FNeoAudioPostEventParam
{
public:
	struct FSoftObjectPath                        SoundEventRef;                                     // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseLocation;                                       // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachJoint;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Follow;                                            // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseCooldown;                                       // 0x0049(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CoolDownTime;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioPostEventParam;

// ScriptStruct NeoAudio.NeoAudioBGMTableRow
// 0x0098 (0x00A0 - 0x0008)
struct FNeoAudioBGMTableRow final : public FTableRowBase
{
public:
	class FName                                   LevelName;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  LevelTag;                                          // 0x0010(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FNeoAudioPostEventParam                AudioEvent;                                        // 0x0030(0x0070)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioBGMTableRow;

// ScriptStruct NeoAudio.NeoAudioCueAutoTriggerElement
// 0x0028 (0x0028 - 0x0000)
struct FNeoAudioCueAutoTriggerElement final
{
public:
	class FName                                   CueName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioAutoTriggerSettingElement> VelocityTrigger;                               // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioAutoTriggerSettingElement> JointAngleTrigger;                             // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioCueAutoTriggerElement;

// ScriptStruct NeoAudio.NeoAudioCueAutoTriggerGroup
// 0x0018 (0x0018 - 0x0000)
struct FNeoAudioCueAutoTriggerGroup final
{
public:
	ENeoAudioCueGroup                             CueGroup;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNeoAudioCueAutoTriggerElement> AutoTriggerList;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioCueAutoTriggerGroup;

// ScriptStruct NeoAudio.ActiveAutoVelTrig
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FActiveAutoVelTrig final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActiveAutoVelTrig;

// ScriptStruct NeoAudio.ActiveAutoAngleTrig
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FActiveAutoAngleTrig final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActiveAutoAngleTrig;

// ScriptStruct NeoAudio.NeoAudioOnStopTriggerSettingElement
// 0x0008 (0x0008 - 0x0000)
struct FNeoAudioOnStopTriggerSettingElement final
{
public:
	class FName                                   EnableName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioOnStopTriggerSettingElement;

// ScriptStruct NeoAudio.NeoAudioCueOnStopTriggerElement
// 0x0018 (0x0018 - 0x0000)
struct FNeoAudioCueOnStopTriggerElement final
{
public:
	class FName                                   CueName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioOnStopTriggerSettingElement> OnStopTrigger;                               // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioCueOnStopTriggerElement;

// ScriptStruct NeoAudio.NeoAudioCueOnStopTriggerGroup
// 0x0018 (0x0018 - 0x0000)
struct FNeoAudioCueOnStopTriggerGroup final
{
public:
	ENeoAudioCueGroup                             CueGroup;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNeoAudioCueOnStopTriggerElement> OnStopTriggerList;                               // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioCueOnStopTriggerGroup;

// ScriptStruct NeoAudio.ActiveOnStopTrig
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FActiveOnStopTrig final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActiveOnStopTrig;

// ScriptStruct NeoAudio.NeoAudioCueElement
// 0x000C (0x000C - 0x0000)
struct FNeoAudioCueElement final
{
public:
	ENeoAudioCueGroup                             CueGroup;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CueName;                                           // 0x0004(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioCueElement;

// ScriptStruct NeoAudio.NeoAudioCue
// 0x000C (0x000C - 0x0000)
struct FNeoAudioCue final
{
public:
	ENeoAudioCueGroup                             CueGroup;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CueName;                                           // 0x0004(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioCue;

// ScriptStruct NeoAudio.CueToSwitchElement
// 0x0014 (0x0014 - 0x0000)
struct FCueToSwitchElement final
{
public:
	class FName                                   CueName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENeoAudioSwitchType                           SwitchType;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SwitchValue;                                       // 0x000C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCueToSwitchElement;

// ScriptStruct NeoAudio.CueToSwitchGroup
// 0x0018 (0x0018 - 0x0000)
struct FCueToSwitchGroup final
{
public:
	ENeoAudioCueGroup                             CueGroup;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCueToSwitchElement>            CueSwitchList;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCueToSwitchGroup;

// ScriptStruct NeoAudio.CueToTriggerElement
// 0x0020 (0x0020 - 0x0000)
struct FCueToTriggerElement final
{
public:
	class FName                                   CueName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioTriggerIdHandle               Trigger;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioTriggerIdHandle>       Triggers;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCueToTriggerElement;

// ScriptStruct NeoAudio.CueToTriggerGroup
// 0x0018 (0x0018 - 0x0000)
struct FCueToTriggerGroup final
{
public:
	ENeoAudioCueGroup                             CueGroup;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCueToTriggerElement>           CueTriggerList;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCueToTriggerGroup;

// ScriptStruct NeoAudio.NeoAudioAutoTriggerParam
// 0x0014 (0x0014 - 0x0000)
struct FNeoAudioAutoTriggerParam final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          EnableMonitor;                                     // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Threshold;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioTriggerIdHandle               SoundTrigger;                                      // 0x000C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioAutoTriggerParam;

// ScriptStruct NeoAudio.NeoAudioJointAngleTriggerData
// 0x0030 (0x0030 - 0x0000)
struct FNeoAudioJointAngleTriggerData final
{
public:
	class FName                                   JointCenterName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JointAName;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JointBName;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AntiRepeatingTimer;                                // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNeoAudioAutoTriggerParam>      TriggerParam;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioJointAngleTriggerData;

// ScriptStruct NeoAudio.NeoAudioVelocityTriggerData
// 0x0020 (0x0020 - 0x0000)
struct FNeoAudioVelocityTriggerData final
{
public:
	class FName                                   JointName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AntiRepeatingTimer;                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNeoAudioAutoTriggerParam>      TriggerParam;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioVelocityTriggerData;

// ScriptStruct NeoAudio.NeoAudioOnStopTriggerData
// 0x0020 (0x0020 - 0x0000)
struct FNeoAudioOnStopTriggerData final
{
public:
	bool                                          EnableMonitor;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   JointName;                                         // 0x0004(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AntiRepeatingTimer;                                // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopVelocity;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveVelocity;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioTriggerIdHandle               SoundTrigger;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioOnStopTriggerData;

// ScriptStruct NeoAudio.NeoAudioSoundContainerInfo
// 0x0008 (0x0008 - 0x0000)
struct FNeoAudioSoundContainerInfo final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioSoundContainerInfo;

// ScriptStruct NeoAudio.NeoAudioStateTableRow
// 0x0028 (0x0030 - 0x0008)
struct FNeoAudioStateTableRow final : public FTableRowBase
{
public:
	struct FGameplayTag                           StateTag;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        StateAsset;                                        // 0x0010(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioStateTableRow;

// ScriptStruct NeoAudio.NeoAudioTriggerTableRow
// 0x0090 (0x00B8 - 0x0028)
struct FNeoAudioTriggerTableRow final : public FNeoEditableCompositeTableRow
{
public:
	struct FGameplayTag                           TriggerGroup;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TriggerName;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioPostEventParam                PostEventParam;                                    // 0x0038(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 ExtraDatas;                                        // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioTriggerTableRow;

// ScriptStruct NeoAudio.NeoAudioAcousticTextureParams
// 0x0030 (0x0030 - 0x0000)
struct FNeoAudioAcousticTextureParams final
{
public:
	struct FVector4                               AbsorptionValues;                                  // 0x0000(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioAcousticTextureParams;

// ScriptStruct NeoAudio.NeoAudioPoly
// 0x0030 (0x0030 - 0x0000)
struct FNeoAudioPoly final
{
public:
	struct FSoftObjectPath                        TextureRef;                                        // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Occlusion;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSurface;                                     // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SurfaceArea;                                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioPoly;

// ScriptStruct NeoAudio.NeoAudioEdgeInfo
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FNeoAudioEdgeInfo final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioEdgeInfo;

// ScriptStruct NeoAudio.NeoAudioSurfaceProperties
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FNeoAudioSurfaceProperties final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioSurfaceProperties;

// ScriptStruct NeoAudio.NeoAudioFacePlane
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FNeoAudioFacePlane final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioFacePlane;

// ScriptStruct NeoAudio.NeoAudioSubtitleParam
// 0x0018 (0x0018 - 0x0000)
struct FNeoAudioSubtitleParam final
{
public:
	TArray<struct FSubtitleCue>                   Subtitles;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SubtitlePriority;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bManualWordWrap : 1;                               // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSingleLine : 1;                                   // 0x0014(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioSubtitleParam;

// ScriptStruct NeoAudio.NeoAudioPostedEventInfo
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FNeoAudioPostedEventInfo final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioPostedEventInfo;

// ScriptStruct NeoAudio.NeoAudioCooldownEventInfo
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FNeoAudioCooldownEventInfo final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioCooldownEventInfo;

// ScriptStruct NeoAudio.NeoAudioAmbientSoundParam
// 0x03F0 (0x0460 - 0x0070)
struct FNeoAudioAmbientSoundParam final : public FNeoAudioPostEventParam
{
public:
	class FName                                   AttachName;                                        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      AttenuationSettings;                               // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundAttenuationSettings              AttenuationOverrides;                              // 0x0080(0x03D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         bStopWhenOwnerDestroyed : 1;                       // 0x0450(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeOutTime;                                       // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENeoAudioCurveInterpolation                   FadeCurve;                                         // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoActivate : 1;                                 // 0x0459(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideAttenuation : 1;                          // 0x0459(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioAmbientSoundParam;

// ScriptStruct NeoAudio.NeoAudioReverbParam
// 0x0040 (0x0040 - 0x0000)
struct FNeoAudioReverbParam final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SendLevel;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeRate;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoAssignAuxBus;                                 // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        ReverbEffectRef;                                   // 0x0018(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioReverbParam;

// ScriptStruct NeoAudio.NeoAudioSurfaceReflectorParam
// 0x0020 (0x0020 - 0x0000)
struct FNeoAudioSurfaceReflectorParam final
{
public:
	uint8                                         bEnableSurfaceReflectors : 1;                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableDiffraction : 1;                            // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableDiffractionOnBoundaryEdges : 1;             // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AssociatedRoom;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioPoly>                  AcousticPolys;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioSurfaceReflectorParam;

// ScriptStruct NeoAudio.NeoAudioRoomParam
// 0x0018 (0x0088 - 0x0070)
struct FNeoAudioRoomParam final : public FNeoAudioPostEventParam
{
public:
	uint8                                         bEnable : 1;                                       // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDynamic;                                          // 0x0074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoPost;                                          // 0x0075(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Priority;                                          // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WallOcclusion;                                     // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AuxSendLevel;                                      // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioRoomParam;

// ScriptStruct NeoAudio.NeoAudioRTPCParam
// 0x0038 (0x0038 - 0x0000)
struct FNeoAudioRTPCParam final
{
public:
	struct FSoftObjectPath                        RtpcValue;                                         // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InterpolationTimeMs;                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BypassInternalValueInterpolation;                  // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RTPC;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioRTPCParam;

// ScriptStruct NeoAudio.NeoAudioSwitchParam
// 0x0030 (0x0030 - 0x0000)
struct FNeoAudioSwitchParam final
{
public:
	struct FSoftObjectPath                        SwitchValue;                                       // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SwitchGroup;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SwitchState;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioSwitchParam;

// ScriptStruct NeoAudio.NeoAudioStateParam
// 0x0030 (0x0030 - 0x0000)
struct FNeoAudioStateParam final
{
public:
	struct FSoftObjectPath                        StateValue;                                        // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StateGroup;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   State;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioStateParam;

// ScriptStruct NeoAudio.NeoAudioGameplayTagTriggerParam
// 0x0028 (0x0028 - 0x0000)
struct FNeoAudioGameplayTagTriggerParam final
{
public:
	struct FNeoAudioTriggerIdHandle               TriggerId;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseLocation;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioGameplayTagTriggerParam;

// ScriptStruct NeoAudio.NeoAudioNoiseParam
// 0x001C (0x001C - 0x0000)
struct FNeoAudioNoiseParam final
{
public:
	float                                         Loudness;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CancelReportGameplayTag;                           // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseLineTrace;                                      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             TraceChannel;                                      // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioNoiseParam;

// ScriptStruct NeoAudio.NeoAudioPortalParam
// 0x0008 (0x0008 - 0x0000)
struct FNeoAudioPortalParam final
{
public:
	bool                                          bDynamic;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENeoAudioAcousticPortalState                  InitialState;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionRefreshInterval;                        // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioPortalParam;

// ScriptStruct NeoAudio.NeoAudioSpotReflectorParam
// 0x0058 (0x0058 - 0x0000)
struct FNeoAudioSpotReflectorParam final
{
public:
	struct FSoftObjectPath                        EarlyReflectionAuxBus;                             // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EarlyReflectionAuxBusName;                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AcousticTexture;                                   // 0x0030(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceScalingFactor;                             // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioSpotReflectorParam;

// ScriptStruct NeoAudio.NeoAudioGeometrySurfaceOverride
// 0x0030 (0x0030 - 0x0000)
struct FNeoAudioGeometrySurfaceOverride final
{
public:
	struct FSoftObjectPath                        AcousticTextureRef;                                // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableOcclusionOverride : 1;                      // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OcclusionValue;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SurfaceArea;                                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioGeometrySurfaceOverride;

// ScriptStruct NeoAudio.NeoAudioGeometryParam
// 0x00A0 (0x00A0 - 0x0000)
struct FNeoAudioGeometryParam final
{
public:
	ENeoAudioMeshType                             MeshType;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LOD;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeldingThreshold;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UMaterialInterface*, struct FNeoAudioGeometrySurfaceOverride> StaticMeshSurfaceOverride; // 0x0010(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FNeoAudioGeometrySurfaceOverride       CollisionMeshSurfaceOverride;                      // 0x0060(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         bEnableDiffraction : 1;                            // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableDiffractionOnBoundaryEdges : 1;             // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AssociatedRoom;                                    // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNeoAudioGeometryParam;

// ScriptStruct NeoAudio.NeoAudioPostDialogResult
// 0x0010 (0x0010 - 0x0000)
struct FNeoAudioPostDialogResult final
{
public:
	class UObject*                                EventObject;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNeoAudioPostDialogResult;

}

