#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeoAudio

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "NeoAudio_structs.hpp"
#include "UMG_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "AkAudio_classes.hpp"
#include "DataTablePlus_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class NeoAudio.NeoAudioAcousticPortalVolume
// 0x0008 (0x02D0 - 0x02C8)
class ANeoAudioAcousticPortalVolume final : public AVolume
{
public:
	class UNeoAudioPortalComponent*               PortalComponent;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClosePortal();
	void OpenPortal();

	ENeoAudioAcousticPortalState GetCurrentState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioAcousticPortalVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioAcousticPortalVolume")
	}
	static class ANeoAudioAcousticPortalVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoAudioAcousticPortalVolume>();
	}
};
DUMPER7_ASSERTS_ANeoAudioAcousticPortalVolume;

// Class NeoAudio.NeoAudioActorSpawnerDataAsset
// 0x0050 (0x0080 - 0x0030)
class UNeoAudioActorSpawnerDataAsset final : public UDataAsset
{
public:
	TMap<ENeoAudioCueGroup, struct FNeoAudioActorSpawnerData> ActorGroup;                            // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioActorSpawnerDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioActorSpawnerDataAsset")
	}
	static class UNeoAudioActorSpawnerDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioActorSpawnerDataAsset>();
	}
};
DUMPER7_ASSERTS_UNeoAudioActorSpawnerDataAsset;

// Class NeoAudio.NeoAudioAmbientSound
// 0x0468 (0x06F8 - 0x0290)
class ANeoAudioAmbientSound : public AActor
{
public:
	struct FNeoAudioAmbientSoundParam             AmbientSoundParam;                                 // 0x0290(0x0460)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USceneComponent*                        AudioComponent;                                    // 0x06F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class USceneComponent* GetCachedAudioComponent();
	void StartAmbientSound();
	void StopAmbientSound();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioAmbientSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioAmbientSound")
	}
	static class ANeoAudioAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoAudioAmbientSound>();
	}
};
DUMPER7_ASSERTS_ANeoAudioAmbientSound;

// Class NeoAudio.NeoAudioAnimNotify_PostEvent
// 0x0080 (0x00B8 - 0x0038)
class UNeoAudioAnimNotify_PostEvent final : public UAnimNotify
{
public:
	class FName                                   AttachName;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNeoAudioPostEventParam                AudioParam;                                        // 0x0040(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bFollow;                                           // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalOnly;                                        // 0x00B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioAnimNotify_PostEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioAnimNotify_PostEvent")
	}
	static class UNeoAudioAnimNotify_PostEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioAnimNotify_PostEvent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioAnimNotify_PostEvent;

// Class NeoAudio.NeoAudioAnimNotify_SendSoundTrigger
// 0x0030 (0x0068 - 0x0038)
class UNeoAudioAnimNotify_SendSoundTrigger : public UAnimNotify
{
public:
	class FString                                 DisplayName;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioTriggerIdHandle>       SoundTriggers;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bLocalOnly;                                        // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReportNoise;                                       // 0x0059(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNeoAudioNoiseData*                     NoiseData;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool CanReportNoise(class AActor* InOwner, const struct FGameplayTag& InCanelReportGameplayTag) const;
	float HandleLoudness(class AActor* InOwner, float InOriginalLoudness) const;
	void ReportNoiseData(class AActor* InOwner) const;
	bool RunCustomCheck(class AActor* InOwner) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioAnimNotify_SendSoundTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioAnimNotify_SendSoundTrigger")
	}
	static class UNeoAudioAnimNotify_SendSoundTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioAnimNotify_SendSoundTrigger>();
	}
};
DUMPER7_ASSERTS_UNeoAudioAnimNotify_SendSoundTrigger;

// Class NeoAudio.NeoAudioAssetManager
// 0x0000 (0x04D0 - 0x04D0)
class UNeoAudioAssetManager final : public UAssetManager
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioAssetManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioAssetManager")
	}
	static class UNeoAudioAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioAssetManager>();
	}
};
DUMPER7_ASSERTS_UNeoAudioAssetManager;

// Class NeoAudio.NeoAudioAutoTriggerMonitor
// 0x0000 (0x02E0 - 0x02E0)
class UNeoAudioAutoTriggerMonitor final : public UUserWidget
{
public:
	void AddDataPoint(float Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioAutoTriggerMonitor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioAutoTriggerMonitor")
	}
	static class UNeoAudioAutoTriggerMonitor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioAutoTriggerMonitor>();
	}
};
DUMPER7_ASSERTS_UNeoAudioAutoTriggerMonitor;

// Class NeoAudio.NeoAudioBGMActor
// 0x0028 (0x02B8 - 0x0290)
class ANeoAudioBGMActor final : public AActor
{
public:
	class UNeoAudioBGMComponent*                  AudioBGMComponent;                                 // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CurrentGameFlowState;                              // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StackGameFlowState;                                // 0x02A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BGMLevelProgressState;                             // 0x02A8(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioBGMActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioBGMActor")
	}
	static class ANeoAudioBGMActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoAudioBGMActor>();
	}
};
DUMPER7_ASSERTS_ANeoAudioBGMActor;

// Class NeoAudio.NeoAudioBGMComponent
// 0x0000 (0x0400 - 0x0400)
class UNeoAudioBGMComponent final : public UAkComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioBGMComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioBGMComponent")
	}
	static class UNeoAudioBGMComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioBGMComponent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioBGMComponent;

// Class NeoAudio.NeoAudioContactTriggerComponent
// 0x0030 (0x0260 - 0x0230)
class UNeoAudioContactTriggerComponent final : public USceneComponent
{
public:
	class UNeoAudioSoundComponent*                OwnerSoundComponent;                               // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNeoAudioTriggerIdHandle               TriggerId;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseLimit;                                         // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ContactLimit;                                      // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_248[0xC];                                      // 0x0248(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AntiRepeatTimer;                                   // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartIgnoreTimer;                                  // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnContact(class AActor* OtherActor);
	void SetOwnerSoundComponent(class UNeoAudioSoundComponent* SoundComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioContactTriggerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioContactTriggerComponent")
	}
	static class UNeoAudioContactTriggerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioContactTriggerComponent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioContactTriggerComponent;

// Class NeoAudio.NeoAudioCueReceiver
// 0x0018 (0x00B8 - 0x00A0)
class UNeoAudioCueReceiver : public UActorComponent
{
public:
	TArray<struct FNeoAudioCueElement>            TagElementList;                                    // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UNeoAudioSoundComponent* GetSoundComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioCueReceiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioCueReceiver")
	}
	static class UNeoAudioCueReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioCueReceiver>();
	}
};
DUMPER7_ASSERTS_UNeoAudioCueReceiver;

// Class NeoAudio.NeoAudioCueActorSpawner
// 0x0060 (0x0118 - 0x00B8)
class UNeoAudioCueActorSpawner final : public UNeoAudioCueReceiver
{
public:
	class UNeoAudioActorSpawnerDataAsset*         DataAsset;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x58];                                      // 0x00C0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioCueActorSpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioCueActorSpawner")
	}
	static class UNeoAudioCueActorSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioCueActorSpawner>();
	}
};
DUMPER7_ASSERTS_UNeoAudioCueActorSpawner;

// Class NeoAudio.NeoAudioCueAutoTrigger
// 0x0060 (0x0118 - 0x00B8)
class UNeoAudioCueAutoTrigger final : public UNeoAudioCueReceiver
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UseValueMonitorWidget;                             // 0x00C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x37];                                      // 0x00C1(0x0037)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNeoAudioCueAutoTriggerGroup>   AutoTriggerGroup;                                  // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UNeoAudioJointVelocityDataAsset*        VelocityTriggerData;                               // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNeoAudioJointAngleDataAsset*           JointAngleTriggerData;                             // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioCueAutoTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioCueAutoTrigger")
	}
	static class UNeoAudioCueAutoTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioCueAutoTrigger>();
	}
};
DUMPER7_ASSERTS_UNeoAudioCueAutoTrigger;

// Class NeoAudio.NeoAudioCueOnStopTrigger
// 0x0040 (0x00F8 - 0x00B8)
class UNeoAudioCueOnStopTrigger final : public UNeoAudioCueReceiver
{
public:
	uint8                                         Pad_B8[0x28];                                      // 0x00B8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNeoAudioCueOnStopTriggerGroup> OnStopTriggerGroup;                                // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UNeoAudioOnStopDataAsset*               OnStopTriggerData;                                 // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioCueOnStopTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioCueOnStopTrigger")
	}
	static class UNeoAudioCueOnStopTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioCueOnStopTrigger>();
	}
};
DUMPER7_ASSERTS_UNeoAudioCueOnStopTrigger;

// Class NeoAudio.NeoAudioCueSender
// 0x0020 (0x0050 - 0x0030)
class UNeoAudioCueSender final : public UAnimNotifyState
{
public:
	TArray<struct FNeoAudioCue>                   EnterCue;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioCue>                   EndCue;                                            // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioCueSender")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioCueSender")
	}
	static class UNeoAudioCueSender* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioCueSender>();
	}
};
DUMPER7_ASSERTS_UNeoAudioCueSender;

// Class NeoAudio.NeoAudioCueToSwitch
// 0x0010 (0x00C8 - 0x00B8)
class UNeoAudioCueToSwitch final : public UNeoAudioCueReceiver
{
public:
	TArray<struct FCueToSwitchGroup>              CueSwitchGroup;                                    // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioCueToSwitch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioCueToSwitch")
	}
	static class UNeoAudioCueToSwitch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioCueToSwitch>();
	}
};
DUMPER7_ASSERTS_UNeoAudioCueToSwitch;

// Class NeoAudio.NeoAudioCueToTrigger
// 0x0010 (0x00C8 - 0x00B8)
class UNeoAudioCueToTrigger final : public UNeoAudioCueReceiver
{
public:
	TArray<struct FCueToTriggerGroup>             CueTriggerGroup;                                   // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioCueToTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioCueToTrigger")
	}
	static class UNeoAudioCueToTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioCueToTrigger>();
	}
};
DUMPER7_ASSERTS_UNeoAudioCueToTrigger;

// Class NeoAudio.NeoAudioDataTable
// 0x0000 (0x00D8 - 0x00D8)
class UNeoAudioDataTable final : public UNeoEditableCompositeDataTable
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioDataTable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioDataTable")
	}
	static class UNeoAudioDataTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioDataTable>();
	}
};
DUMPER7_ASSERTS_UNeoAudioDataTable;

// Class NeoAudio.NeoAudioExtraDataInterface
// 0x0000 (0x0000 - 0x0000)
class INeoAudioExtraDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioExtraDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioExtraDataInterface")
	}
	static class INeoAudioExtraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<INeoAudioExtraDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_INeoAudioExtraDataInterface;

// Class NeoAudio.NeoAudioGameplayTagTrigger
// 0x0058 (0x02E8 - 0x0290)
class ANeoAudioGameplayTagTrigger : public AActor
{
public:
	TMap<struct FGameplayTag, struct FNeoAudioGameplayTagTriggerParam> Triggers;                     // 0x0290(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UNeoAudioSoundComponent*                SoundComponent;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SendGameplayTagTrigger(const struct FGameplayTag& Tag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioGameplayTagTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioGameplayTagTrigger")
	}
	static class ANeoAudioGameplayTagTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoAudioGameplayTagTrigger>();
	}
};
DUMPER7_ASSERTS_ANeoAudioGameplayTagTrigger;

// Class NeoAudio.NeoAudioGameSyncSystem
// 0x0010 (0x0050 - 0x0040)
class UNeoAudioGameSyncSystem : public UTickableWorldSubsystem
{
public:
	TArray<struct FGameplayTag>                   InitStates;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	bool Deinitialize_BP();
	const bool GetStateInitialized();
	bool Initialize_BP();
	struct FNeoAudioPostDialogResult PostDialogEvent(class UActorComponent* Component, const struct FNeoAudioTriggerIdHandle& TriggerId);
	bool PostInitialize_BP();
	void SetAudioProfile(uint8 Culture);
	void SetCulture(int32 Culture);
	void SetStateInitialized(bool B);
	bool Tick_BP(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioGameSyncSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioGameSyncSystem")
	}
	static class UNeoAudioGameSyncSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioGameSyncSystem>();
	}
};
DUMPER7_ASSERTS_UNeoAudioGameSyncSystem;

// Class NeoAudio.NeoAudioGeometryBox
// 0x0008 (0x02D0 - 0x02C8)
class ANeoAudioGeometryBox final : public AVolume
{
public:
	class UNeoAudioGeometryComponent*             AudioGeometryComponent;                            // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioGeometryBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioGeometryBox")
	}
	static class ANeoAudioGeometryBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoAudioGeometryBox>();
	}
};
DUMPER7_ASSERTS_ANeoAudioGeometryBox;

// Class NeoAudio.NeoAudioGeometryComponent
// 0x00B0 (0x02E0 - 0x0230)
class UNeoAudioGeometryComponent final : public USceneComponent
{
public:
	struct FNeoAudioGeometryParam                 GeometryParam;                                     // 0x0230(0x00A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USceneComponent*                        GeometryComponentImpl;                             // 0x02D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioGeometryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioGeometryComponent")
	}
	static class UNeoAudioGeometryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioGeometryComponent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioGeometryComponent;

// Class NeoAudio.NeoAudioInterface
// 0x0000 (0x0000 - 0x0000)
class INeoAudioInterface final
{
public:
	void OnEndAudioEvent(class USceneComponent* AttachToComponent, class FName AttachName);
	void OnStartAudioEvent(class USceneComponent* AttachToComponent, class FName AttachName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioInterface")
	}
	static class INeoAudioInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<INeoAudioInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_INeoAudioInterface;

// Class NeoAudio.NeoAudioJointAngleDataAsset
// 0x0050 (0x0080 - 0x0030)
class UNeoAudioJointAngleDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FNeoAudioJointAngleTriggerData> JointAngleTrigger;                      // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioJointAngleDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioJointAngleDataAsset")
	}
	static class UNeoAudioJointAngleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioJointAngleDataAsset>();
	}
};
DUMPER7_ASSERTS_UNeoAudioJointAngleDataAsset;

// Class NeoAudio.NeoAudioJointVelocityDataAsset
// 0x0050 (0x0080 - 0x0030)
class UNeoAudioJointVelocityDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FNeoAudioVelocityTriggerData> VelocityTrigger;                          // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioJointVelocityDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioJointVelocityDataAsset")
	}
	static class UNeoAudioJointVelocityDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioJointVelocityDataAsset>();
	}
};
DUMPER7_ASSERTS_UNeoAudioJointVelocityDataAsset;

// Class NeoAudio.NeoAudioLateReverbComponent
// 0x0050 (0x0280 - 0x0230)
class UNeoAudioLateReverbComponent final : public USceneComponent
{
public:
	struct FNeoAudioReverbParam                   ReverbParam;                                       // 0x0230(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USceneComponent*                        ReverbComponentImpl;                               // 0x0270(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioLateReverbComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioLateReverbComponent")
	}
	static class UNeoAudioLateReverbComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioLateReverbComponent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioLateReverbComponent;

// Class NeoAudio.NeoAudioLibrary
// 0x0000 (0x0028 - 0x0028)
class UNeoAudioLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 AddAudioOutput(const class FString& OutputName, int32 DeviceID);
	static class UObject* PostBGMEvent(class UObject* InWorldContextObject, const struct FNeoAudioPostEventParam& InAudioPostEventParam);
	static class UObject* PostEvent(class UObject* InWorldContextObject, const struct FNeoAudioPostEventParam& InAudioPostEventParam, class AActor* InActor, class UObject* InAudioContext, bool bShouldCache);
	static class UObject* PostEventAtComponent(class UObject* InWorldContextObject, const struct FNeoAudioPostEventParam& InAudioPostEventParam, class USceneComponent* InAttachToComponent, class FName InAttachName, bool bIsFollow, class UObject* InAudioContext, bool bShouldCache);
	static class UObject* PostEventAtComponentLocally(class UObject* InWorldContextObject, const struct FNeoAudioPostEventParam& InAudioPostEventParam, class USceneComponent* InAttachToComponent, class FName InAttachName, bool bIsFollow, class UObject* InAudioContext, bool bShouldCache);
	static class UObject* PostEventAtLocation(class UObject* InWorldContextObject, const struct FNeoAudioPostEventParam& InAudioPostEventParam, const struct FVector& InLocation, const struct FRotator& InOrientation, class UObject* InAudioContext, bool bShouldCache);
	static void RemoveDefaultListener(class UActorComponent* in_pListener);
	static void ReplaceMainOutput(const class FString& AudioDeviceShareSetName, int32 IdDevice);
	static void SendTriggerFromTable(class AActor* InActor, class UDataTable* InSoundTriggerTable, const struct FNeoAudioTriggerIdHandle& InTriggerID);
	static void SetRTPCValue(const struct FNeoAudioRTPCParam& InAudioRTPCParam, class AActor* InActor);
	static void SetRTPCValueBySceneComponent(const struct FNeoAudioRTPCParam& InAudioRTPCParam, class USceneComponent* InSceneComponent, class FName InAttachPointName);
	static void SetState(class UObject* InWorldContextObject, const struct FNeoAudioStateParam& InAudioStateParam);
	static void SetStateByGameplayTag(class UObject* InWorldContextObject, const struct FGameplayTag& InAudioState);
	static void SetSwitch(const struct FNeoAudioSwitchParam& InAudioSwitchParam, class AActor* InActor);
	static void SetSwitchBySceneComponent(const struct FNeoAudioSwitchParam& InAudioSwitchParam, class USceneComponent* InSceneComponent, class FName InAttachPointName);
	static void StopAll();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioLibrary")
	}
	static class UNeoAudioLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioLibrary>();
	}
};
DUMPER7_ASSERTS_UNeoAudioLibrary;

// Class NeoAudio.NeoAudioNoiseData
// 0x0020 (0x0050 - 0x0030)
class UNeoAudioNoiseData final : public UDataAsset
{
public:
	struct FNeoAudioNoiseParam                    NoiseParam;                                        // 0x0030(0x001C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioNoiseData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioNoiseData")
	}
	static class UNeoAudioNoiseData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioNoiseData>();
	}
};
DUMPER7_ASSERTS_UNeoAudioNoiseData;

// Class NeoAudio.NeoAudioOnStopDataAsset
// 0x0050 (0x0080 - 0x0030)
class UNeoAudioOnStopDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FNeoAudioOnStopTriggerData> OnStopTrigger;                              // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioOnStopDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioOnStopDataAsset")
	}
	static class UNeoAudioOnStopDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioOnStopDataAsset>();
	}
};
DUMPER7_ASSERTS_UNeoAudioOnStopDataAsset;

// Class NeoAudio.NeoAudioPhysicalSurfaceData
// 0x0050 (0x0080 - 0x0030)
class UNeoAudioPhysicalSurfaceData final : public UDataAsset
{
public:
	TMap<EPhysicalSurface, struct FGameplayTag>   PhysicalSurfaceMap;                                // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioPhysicalSurfaceData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioPhysicalSurfaceData")
	}
	static class UNeoAudioPhysicalSurfaceData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioPhysicalSurfaceData>();
	}
};
DUMPER7_ASSERTS_UNeoAudioPhysicalSurfaceData;

// Class NeoAudio.NeoAudioPortalComponent
// 0x0010 (0x0240 - 0x0230)
class UNeoAudioPortalComponent final : public USceneComponent
{
public:
	struct FNeoAudioPortalParam                   PortalParam;                                       // 0x0230(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class USceneComponent*                        PortalComponentImpl;                               // 0x0238(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClosePortal();
	void OpenPortal();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioPortalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioPortalComponent")
	}
	static class UNeoAudioPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioPortalComponent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioPortalComponent;

// Class NeoAudio.NeoAudioReverbVolume
// 0x0008 (0x02D0 - 0x02C8)
class ANeoAudioReverbVolume final : public AVolume
{
public:
	class UNeoAudioLateReverbComponent*           LateReverbComponent;                               // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioReverbVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioReverbVolume")
	}
	static class ANeoAudioReverbVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoAudioReverbVolume>();
	}
};
DUMPER7_ASSERTS_ANeoAudioReverbVolume;

// Class NeoAudio.NeoAudioRoomComponent
// 0x0090 (0x02C0 - 0x0230)
class UNeoAudioRoomComponent final : public USceneComponent
{
public:
	struct FNeoAudioRoomParam                     RoomParam;                                         // 0x0230(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USceneComponent*                        RoomComponentImpl;                                 // 0x02B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioRoomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioRoomComponent")
	}
	static class UNeoAudioRoomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioRoomComponent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioRoomComponent;

// Class NeoAudio.NeoAudioRtpcData
// 0x0050 (0x0080 - 0x0030)
class UNeoAudioRtpcData final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FSoftObjectPath> RtpcAssetMap;                                  // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioRtpcData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioRtpcData")
	}
	static class UNeoAudioRtpcData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioRtpcData>();
	}
};
DUMPER7_ASSERTS_UNeoAudioRtpcData;

// Class NeoAudio.NeoAudioSetting
// 0x0048 (0x0070 - 0x0028)
class UNeoAudioSetting final : public UObject
{
public:
	int32                                         LRUCacheMaxSize;                                   // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         GameplayTagTriggerHandle;                          // 0x0030(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioStateParam>            IndoorSpaceAudioState;                             // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FNeoAudioStateParam>            OutdoorSpaceAudioState;                            // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSetting")
	}
	static class UNeoAudioSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioSetting>();
	}
};
DUMPER7_ASSERTS_UNeoAudioSetting;

// Class NeoAudio.NeoAudioSoundComponent
// 0x01D8 (0x0278 - 0x00A0)
class UNeoAudioSoundComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             SoundTriggerTable;                                 // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UDataTable*>                     DynamicSoundTriggerTables;                         // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	bool                                          PreloadSoundEvent;                                 // 0x0108(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ENeoAudioSwitchType, class UNeoAudioSwitchData*> SwitchContainer;                           // 0x0110(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<ENeoAudioSwitchType, class UNeoAudioPhysicalSurfaceData*> PhysicalSurfaceMapping;           // 0x0160(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                   DefaultSwitchValue;                                // 0x01B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<ENeoAudioSwitchType, struct FGameplayTag> CurrentSwitchValue;                               // 0x01C0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)
	class UMeshComponent*                         MyMesh;                                            // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        LoadedSounEvents;                                  // 0x0218(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_228[0x50];                                     // 0x0228(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearDynamicSoundTriggerTable();
	class UObject* GetEventObjectFromTable(const struct FNeoAudioTriggerIdHandle& TriggerId);
	struct FGameplayTag GetSwitch(ENeoAudioSwitchType SwitchType);
	class UObject* SendSoundTrigger(const struct FNeoAudioTriggerIdHandle& TriggerId);
	class UObject* SendSoundTriggerAtLocation(const struct FNeoAudioTriggerIdHandle& TriggerId, const struct FVector& Location);
	void SetCue(ENeoAudioCueGroup CueGroup, class FName CueName);
	void SetEndCue(ENeoAudioCueGroup CueGroup, class FName CueName);
	void SetPhysicalSurfaceSwitch(ENeoAudioSwitchType SwitchType, EPhysicalSurface SurfaceType);
	void SetSwitch(const struct FGameplayTag& SwitchValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSoundComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSoundComponent")
	}
	static class UNeoAudioSoundComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioSoundComponent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioSoundComponent;

// Class NeoAudio.NeoAudioSoundContainer
// 0x0010 (0x0040 - 0x0030)
class UNeoAudioSoundContainer final : public UDataAsset
{
public:
	TArray<struct FNeoAudioSoundContainerInfo>    ContainerInfoList;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSoundContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSoundContainer")
	}
	static class UNeoAudioSoundContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioSoundContainer>();
	}
};
DUMPER7_ASSERTS_UNeoAudioSoundContainer;

// Class NeoAudio.NeoAudioSpaceSubsystem
// 0x0078 (0x00B8 - 0x0040)
class UNeoAudioSpaceSubsystem final : public UTickableWorldSubsystem
{
public:
	TMap<class FName, class ANeoAudioSpatialAudioVolume*> SpaceMap;                                  // 0x0040(0x0050)(Edit, NativeAccessSpecifierPublic)
	bool                                          DebugDrawSpaceName;                                // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x17];                                      // 0x0091(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class ANeoAudioSpatialAudioVolume*            PrevSpaceVolume;                                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ANeoAudioSpatialAudioVolume*            CurrSpaceVolume;                                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class ANeoAudioSpatialAudioVolume* GetCurrentSpatialAudioVolume();
	void ReCheckCurrentSpaceVolume(class AActor* TargetActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSpaceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSpaceSubsystem")
	}
	static class UNeoAudioSpaceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioSpaceSubsystem>();
	}
};
DUMPER7_ASSERTS_UNeoAudioSpaceSubsystem;

// Class NeoAudio.NeoAudioSpatialAudioVolume
// 0x0090 (0x0358 - 0x02C8)
class ANeoAudioSpatialAudioVolume final : public AVolume
{
public:
	class UNeoAudioSurfaceReflectorSetComponent*  SurfaceReflectorSetComponent;                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNeoAudioLateReverbComponent*           LateReverbComponent;                               // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNeoAudioRoomComponent*                 RoomComponent;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpaceName;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsIndoor;                                          // 0x02E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNeoAudioStateParam>            AudioState;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ANeoAudioAmbientSound*>          SoundList;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_310[0x38];                                     // 0x0310(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CachedObjectes;                                    // 0x0348(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void OnOverlapBegin(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnOverlapEnd(class AActor* OverlappedActor, class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSpatialAudioVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSpatialAudioVolume")
	}
	static class ANeoAudioSpatialAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoAudioSpatialAudioVolume>();
	}
};
DUMPER7_ASSERTS_ANeoAudioSpatialAudioVolume;

// Class NeoAudio.NeoAudioSpotReflector
// 0x0060 (0x02F0 - 0x0290)
class ANeoAudioSpotReflector final : public AActor
{
public:
	struct FNeoAudioSpotReflectorParam            SpotReflectorParam;                                // 0x0290(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USceneComponent*                        SpotReflectorComponent;                            // 0x02E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSpotReflector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSpotReflector")
	}
	static class ANeoAudioSpotReflector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANeoAudioSpotReflector>();
	}
};
DUMPER7_ASSERTS_ANeoAudioSpotReflector;

// Class NeoAudio.NeoAudioStateData
// 0x0050 (0x0080 - 0x0030)
class UNeoAudioStateData final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FSoftObjectPath> StateAssetMap;                                 // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioStateData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioStateData")
	}
	static class UNeoAudioStateData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioStateData>();
	}
};
DUMPER7_ASSERTS_UNeoAudioStateData;

// Class NeoAudio.NeoAudioSurfaceReflectorSetComponent
// 0x0030 (0x0260 - 0x0230)
class UNeoAudioSurfaceReflectorSetComponent final : public USceneComponent
{
public:
	struct FNeoAudioSurfaceReflectorParam         SurfaceReflectorParam;                             // 0x0230(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USceneComponent*                        SurfaceReflectorSetImpl;                           // 0x0250(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSurfaceReflectorSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSurfaceReflectorSetComponent")
	}
	static class UNeoAudioSurfaceReflectorSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioSurfaceReflectorSetComponent>();
	}
};
DUMPER7_ASSERTS_UNeoAudioSurfaceReflectorSetComponent;

// Class NeoAudio.NeoAudioSwitchData
// 0x0050 (0x0080 - 0x0030)
class UNeoAudioSwitchData final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FSoftObjectPath> SwitchAssetMap;                                // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSwitchData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSwitchData")
	}
	static class UNeoAudioSwitchData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioSwitchData>();
	}
};
DUMPER7_ASSERTS_UNeoAudioSwitchData;

// Class NeoAudio.NeoAudioSystem
// 0x0328 (0x0358 - 0x0030)
class UNeoAudioSystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x2];                                       // 0x0030(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          DrawListener;                                      // 0x0032(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawPostedEvents;                                  // 0x0033(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENeoAudioEventFilterType                      FilterType;                                        // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EventOwnerNameFilter;                              // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventNameFilter;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawSphere;                                        // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawPosition;                                      // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawDistance;                                      // 0x005A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x1D];                                      // 0x005B(0x001D)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FName>                CurrentStateValues;                                // 0x0078(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	class UAudioComponent*                        AudioComponent_BGM;                                // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0xB8];                                      // 0x00D0(0x00B8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNeoAudioCooldownEventInfo>     CooldownEvents;                                    // 0x0188(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0x70];                                     // 0x0198(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class ANeoAudioBGMActor*                      BGMActor;                                          // 0x0208(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              LevelToMusicTableSoft;                             // 0x0210(0x0028)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             LevelToMusicTable;                                 // 0x0238(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              UISoundTableSoft;                                  // 0x0240(0x0028)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             UISoundTable;                                      // 0x0268(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UNeoAudioStateData>      GlobalStateDataSoft;                               // 0x0270(0x0028)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNeoAudioStateData*                     GlobalStateData;                                   // 0x0298(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              GlobalStateDataTableSoft;                          // 0x02A0(0x0028)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             GlobalStateDataTable;                              // 0x02C8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UNeoAudioRtpcData>       GlobalRtpcDataSoft;                                // 0x02D0(0x0028)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNeoAudioRtpcData*                      GlobalRtpcData;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UAkRtpc*>     CachedRtpcAssets;                                  // 0x0300(0x0050)(Transient, NativeAccessSpecifierPrivate)
	class ANeoAudioGameplayTagTrigger*            GameplayTagTriggerHandle;                          // 0x0350(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CreateGameplayTagTriggerHandle();
	bool ForceStopBGM();
	struct FGameplayTag GetBGMLevelProgressState();
	int32 GetBGMPosition(const class UObject* WorldContextObject);
	struct FGameplayTag GetCurrGameFlowState();
	struct FGameplayTag GetStackGameFlowState();
	bool PlayBGM(const class UObject* WorldContextObject, class FName SpecifiedName, bool StopPrevious);
	bool PlayBGMByTag(const class UObject* WorldContextObject, const struct FGameplayTag& InTag, bool StopPrevious);
	bool PlayUISound(const class UObject* WorldContextObject, const struct FNeoAudioTriggerIdHandle& TriggerId);
	int32 SeekBGMPosition(const class UObject* WorldContextObject, int32 position);
	void SendGameplayTagTrigger(const struct FGameplayTag& Key);
	void SetBGMLevelProgressState(const struct FGameplayTag& Key);
	void SetCurrGameFlowState(const struct FGameplayTag& Key);
	void SetGlobalRTPC(const struct FGameplayTag& Key, float Value, bool BypassInternalValueInterpolation);
	void SetGlobalRTPCCached(const struct FGameplayTag& Key, float Value, bool BypassInternalValueInterpolation);
	void SetGlobalState(const struct FGameplayTag& Key);
	void SetStackGameFlowState(const struct FGameplayTag& Key);
	void StackCurrGameFlowState();
	bool StopBGM(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioSystem")
	}
	static class UNeoAudioSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioSystem>();
	}
};
DUMPER7_ASSERTS_UNeoAudioSystem;

// Class NeoAudio.SourcePlayPositionTest
// 0x0010 (0x02A0 - 0x0290)
class ASourcePlayPositionTest final : public AActor
{
public:
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayPosition;                                      // 0x0298(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x029C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	int32 GetPlayPostion();
	int32 PostEvent();
	int32 SeekPostion(int32 position);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SourcePlayPositionTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SourcePlayPositionTest")
	}
	static class ASourcePlayPositionTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASourcePlayPositionTest>();
	}
};
DUMPER7_ASSERTS_ASourcePlayPositionTest;

// Class NeoAudio.NeoAudioNiagaraSoundPlayer
// 0x0078 (0x00B0 - 0x0038)
class UNeoAudioNiagaraSoundPlayer final : public UNiagaraDataInterface
{
public:
	struct FNeoAudioPostEventParam                SoundToPlay;                                       // 0x0038(0x0070)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bStopWhenComponentIsDestroyed;                     // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoAudioNiagaraSoundPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoAudioNiagaraSoundPlayer")
	}
	static class UNeoAudioNiagaraSoundPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoAudioNiagaraSoundPlayer>();
	}
};
