#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeoCorruptor

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class NeoCorruptor.NeoCorruptorMapComponent
// 0x0040 (0x00E0 - 0x00A0)
class UNeoCorruptorMapComponent final : public UActorComponent
{
public:
	class UTextureRenderTarget2D*                 CorruptorMapRT;                                    // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>      CorruptorMapMaterialAsset;                         // 0x00A8(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               CorruptorMapMaterialDynamic;                       // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          EnableUpdate;                                      // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearCorruptorMap();
	void DrawPatternToCorruptorMap();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeoCorruptorMapComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeoCorruptorMapComponent")
	}
	static class UNeoCorruptorMapComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeoCorruptorMapComponent>();
	}
};
DUMPER7_ASSERTS_UNeoCorruptorMapComponent;

}

