#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeoEasyFog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NeoEasyFog.NeoEasyFogActor.Init
// 0x0001 (0x0001 - 0x0000)
struct NeoEasyFogActor_Init final
{
public:
	bool                                          bRecreatMat;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_Init;

// Function NeoEasyFog.NeoEasyFogActor.SetBaseColorContrast
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetBaseColorContrast final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetBaseColorContrast;

// Function NeoEasyFog.NeoEasyFogActor.SetBaseColorIntensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetBaseColorIntensity final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetBaseColorIntensity;

// Function NeoEasyFog.NeoEasyFogActor.SetBaseColorTint
// 0x0010 (0x0010 - 0x0000)
struct NeoEasyFogActor_SetBaseColorTint final
{
public:
	struct FLinearColor                           bValue;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetBaseColorTint;

// Function NeoEasyFog.NeoEasyFogActor.SetCameraFadingDistance
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetCameraFadingDistance final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetCameraFadingDistance;

// Function NeoEasyFog.NeoEasyFogActor.SetCastShadow
// 0x0001 (0x0001 - 0x0000)
struct NeoEasyFogActor_SetCastShadow final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetCastShadow;

// Function NeoEasyFog.NeoEasyFogActor.SetEmissiveIntensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetEmissiveIntensity final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetEmissiveIntensity;

// Function NeoEasyFog.NeoEasyFogActor.SetEyeAdaptionSwitch
// 0x0001 (0x0001 - 0x0000)
struct NeoEasyFogActor_SetEyeAdaptionSwitch final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetEyeAdaptionSwitch;

// Function NeoEasyFog.NeoEasyFogActor.SetFogDensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetFogDensity final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetFogDensity;

// Function NeoEasyFog.NeoEasyFogActor.SetGeometryFadingDistance
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetGeometryFadingDistance final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetGeometryFadingDistance;

// Function NeoEasyFog.NeoEasyFogActor.SetNormalMapIntensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetNormalMapIntensity final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetNormalMapIntensity;

// Function NeoEasyFog.NeoEasyFogActor.SetPathtracerToggle
// 0x0001 (0x0001 - 0x0000)
struct NeoEasyFogActor_SetPathtracerToggle final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetPathtracerToggle;

// Function NeoEasyFog.NeoEasyFogActor.SetViewAngleFade
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetViewAngleFade final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetViewAngleFade;

// Function NeoEasyFog.NeoEasyFogActor.SetWindIntensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetWindIntensity final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetWindIntensity;

// Function NeoEasyFog.NeoEasyFogActor.SetWindNoiseContrast
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetWindNoiseContrast final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetWindNoiseContrast;

// Function NeoEasyFog.NeoEasyFogActor.SetWindNoiseTiling
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetWindNoiseTiling final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetWindNoiseTiling;

// Function NeoEasyFog.NeoEasyFogActor.SetWindSpeedX
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetWindSpeedX final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetWindSpeedX;

// Function NeoEasyFog.NeoEasyFogActor.SetWindSpeedY
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_SetWindSpeedY final
{
public:
	float                                         bValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_SetWindSpeedY;

// Function NeoEasyFog.NeoEasyFogActor.GetBaseColorContrast
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetBaseColorContrast final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetBaseColorContrast;

// Function NeoEasyFog.NeoEasyFogActor.GetBaseColorIntensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetBaseColorIntensity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetBaseColorIntensity;

// Function NeoEasyFog.NeoEasyFogActor.GetBaseColorTint
// 0x0010 (0x0010 - 0x0000)
struct NeoEasyFogActor_GetBaseColorTint final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetBaseColorTint;

// Function NeoEasyFog.NeoEasyFogActor.GetCameraFadingDistance
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetCameraFadingDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetCameraFadingDistance;

// Function NeoEasyFog.NeoEasyFogActor.GetCastShadow
// 0x0001 (0x0001 - 0x0000)
struct NeoEasyFogActor_GetCastShadow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetCastShadow;

// Function NeoEasyFog.NeoEasyFogActor.GetEmissiveIntensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetEmissiveIntensity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetEmissiveIntensity;

// Function NeoEasyFog.NeoEasyFogActor.GetEyeAdaptionSwitch
// 0x0001 (0x0001 - 0x0000)
struct NeoEasyFogActor_GetEyeAdaptionSwitch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetEyeAdaptionSwitch;

// Function NeoEasyFog.NeoEasyFogActor.GetFogDensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetFogDensity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetFogDensity;

// Function NeoEasyFog.NeoEasyFogActor.GetGeometryFadingDistance
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetGeometryFadingDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetGeometryFadingDistance;

// Function NeoEasyFog.NeoEasyFogActor.GetNormalMapIntensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetNormalMapIntensity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetNormalMapIntensity;

// Function NeoEasyFog.NeoEasyFogActor.GetPathtracerToggle
// 0x0001 (0x0001 - 0x0000)
struct NeoEasyFogActor_GetPathtracerToggle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetPathtracerToggle;

// Function NeoEasyFog.NeoEasyFogActor.GetViewAngleFade
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetViewAngleFade final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetViewAngleFade;

// Function NeoEasyFog.NeoEasyFogActor.GetWindIntensity
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetWindIntensity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetWindIntensity;

// Function NeoEasyFog.NeoEasyFogActor.GetWindNoiseContrast
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetWindNoiseContrast final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetWindNoiseContrast;

// Function NeoEasyFog.NeoEasyFogActor.GetWindNoiseTiling
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetWindNoiseTiling final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetWindNoiseTiling;

// Function NeoEasyFog.NeoEasyFogActor.GetWindSpeedX
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetWindSpeedX final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetWindSpeedX;

// Function NeoEasyFog.NeoEasyFogActor.GetWindSpeedY
// 0x0004 (0x0004 - 0x0000)
struct NeoEasyFogActor_GetWindSpeedY final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoEasyFogActor_GetWindSpeedY;

}

