#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NeoVFX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "NeoVFX_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NeoVFX.NeoInteractiveMapComponent.AddExtraFluid2DInput
// 0x0058 (0x0058 - 0x0000)
struct NeoInteractiveMapComponent_AddExtraFluid2DInput final
{
public:
	struct FNeoSimInput                           Input;                                             // 0x0000(0x0058)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_AddExtraFluid2DInput;

// Function NeoVFX.NeoInteractiveMapComponent.AddExtraFluid3DInput
// 0x0058 (0x0058 - 0x0000)
struct NeoInteractiveMapComponent_AddExtraFluid3DInput final
{
public:
	struct FNeoSimInput                           Input;                                             // 0x0000(0x0058)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_AddExtraFluid3DInput;

// Function NeoVFX.NeoInteractiveMapComponent.AddExtraInfluence2DInput
// 0x0058 (0x0058 - 0x0000)
struct NeoInteractiveMapComponent_AddExtraInfluence2DInput final
{
public:
	struct FNeoSimInput                           Input;                                             // 0x0000(0x0058)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_AddExtraInfluence2DInput;

// Function NeoVFX.NeoInteractiveMapComponent.AddExtraWave2DInput
// 0x0058 (0x0058 - 0x0000)
struct NeoInteractiveMapComponent_AddExtraWave2DInput final
{
public:
	struct FNeoSimInput                           Input;                                             // 0x0000(0x0058)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_AddExtraWave2DInput;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid2DInputDensity
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid2DInputDensity final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDensity;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid2DInputDensity;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid2DInputEnable
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid2DInputEnable final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid2DInputEnable;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid2DInputEnableCache
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid2DInputEnableCache final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid2DInputEnableCache;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid2DInputRadius
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid2DInputRadius final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InRadius;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid2DInputRadius;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid2DInputVelocity
// 0x0020 (0x0020 - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid2DInputVelocity final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InVelocity;                                        // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid2DInputVelocity;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid2DInputVelocityCache
// 0x0020 (0x0020 - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid2DInputVelocityCache final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InVelocity;                                        // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid2DInputVelocityCache;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid2DInputVelocityScale
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid2DInputVelocityScale final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InVelocityScale;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid2DInputVelocityScale;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid3DInputDensity
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid3DInputDensity final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDensity;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid3DInputDensity;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid3DInputEnable
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid3DInputEnable final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid3DInputEnable;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid3DInputRadius
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid3DInputRadius final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InRadius;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid3DInputRadius;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid3DInputVelocity
// 0x0020 (0x0020 - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid3DInputVelocity final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InVelocity;                                        // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid3DInputVelocity;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideFluid3DInputVelocityScale
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideFluid3DInputVelocityScale final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InVelocityScale;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideFluid3DInputVelocityScale;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideWave2DInputDensity
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideWave2DInputDensity final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDensity;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideWave2DInputDensity;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideWave2DInputEnable
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideWave2DInputEnable final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideWave2DInputEnable;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideWave2DInputRadius
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideWave2DInputRadius final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InRadius;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideWave2DInputRadius;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideWave2DInputVelocity
// 0x0020 (0x0020 - 0x0000)
struct NeoInteractiveMapComponent_OverrideWave2DInputVelocity final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InVelocity;                                        // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideWave2DInputVelocity;

// Function NeoVFX.NeoInteractiveMapComponent.OverrideWave2DInputVelocityScale
// 0x000C (0x000C - 0x0000)
struct NeoInteractiveMapComponent_OverrideWave2DInputVelocityScale final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InVelocityScale;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_OverrideWave2DInputVelocityScale;

// Function NeoVFX.NeoInteractiveMapComponent.VolumeTriggerBegin
// 0x0010 (0x0010 - 0x0000)
struct NeoInteractiveMapComponent_VolumeTriggerBegin final
{
public:
	ESimulationMethod                             InMethod;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNeoInteractiveMapVolumeComponent*      OverrideVolume;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_VolumeTriggerBegin;

// Function NeoVFX.NeoInteractiveMapComponent.VolumeTriggerEnd
// 0x0004 (0x0004 - 0x0000)
struct NeoInteractiveMapComponent_VolumeTriggerEnd final
{
public:
	ESimulationMethod                             InMethod;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapComponent_VolumeTriggerEnd;

// Function NeoVFX.NeoInteractiveMapVolumeComponent.OnBeginOverlap
// 0x0118 (0x0118 - 0x0000)
struct NeoInteractiveMapVolumeComponent_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeoInteractiveMapVolumeComponent_OnBeginOverlap;

// Function NeoVFX.NeoInteractiveMapVolumeComponent.OnEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct NeoInteractiveMapVolumeComponent_OnEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NeoInteractiveMapVolumeComponent_OnEndOverlap;

}

