#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NoceBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "NoceBase_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NoceBase.NoceBaseFunctionLibrary.ClientTravel
// 0x0020 (0x0020 - 0x0000)
struct NoceBaseFunctionLibrary_ClientTravel final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETravelType                                   TravelType;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeamless;                                         // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_ClientTravel;

// Function NoceBase.NoceBaseFunctionLibrary.DrawWidgetToTarget
// 0x0030 (0x0030 - 0x0000)
struct NoceBaseFunctionLibrary_DrawWidgetToTarget final
{
public:
	class UTextureRenderTarget2D*                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            WidgetToRender;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              DrawSize;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseGamma;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureFilter                                Filter;                                            // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaTime;                                         // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_DrawWidgetToTarget;

// Function NoceBase.NoceBaseFunctionLibrary.ForceUpdateTextureStreamingByPos
// 0x0018 (0x0018 - 0x0000)
struct NoceBaseFunctionLibrary_ForceUpdateTextureStreamingByPos final
{
public:
	struct FVector                                InPos;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_ForceUpdateTextureStreamingByPos;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersion
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersion;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersion2
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersion2 final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersion2;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersion3
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersion3 final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersion3;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersion4
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersion4 final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersion4;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersion_Major
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersion_Major final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersion_Major;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersion_Minor
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersion_Minor final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersion_Minor;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersion_Patch
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersion_Patch final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersion_Patch;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersion_Revision
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersion_Revision final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersion_Revision;

// Function NoceBase.NoceBaseFunctionLibrary.GetBuildVersionAt
// 0x0008 (0x0008 - 0x0000)
struct NoceBaseFunctionLibrary_GetBuildVersionAt final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetBuildVersionAt;

// Function NoceBase.NoceBaseFunctionLibrary.GetGameResolution
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetGameResolution final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetGameResolution;

// Function NoceBase.NoceBaseFunctionLibrary.GetGameViewportSize
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetGameViewportSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetGameViewportSize;

// Function NoceBase.NoceBaseFunctionLibrary.GetLongPackageNameForTravel
// 0x0030 (0x0030 - 0x0000)
struct NoceBaseFunctionLibrary_GetLongPackageNameForTravel final
{
public:
	struct FSoftObjectPath                        InPath;                                            // 0x0000(0x0020)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetLongPackageNameForTravel;

// Function NoceBase.NoceBaseFunctionLibrary.GetNoceNearClipPlane
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_GetNoceNearClipPlane final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetNoceNearClipPlane;

// Function NoceBase.NoceBaseFunctionLibrary.GetPCType
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_GetPCType final
{
public:
	ENocePCType                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetPCType;

// Function NoceBase.NoceBaseFunctionLibrary.GetPlatformNetIdLocalString
// 0x0018 (0x0018 - 0x0000)
struct NoceBaseFunctionLibrary_GetPlatformNetIdLocalString final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetPlatformNetIdLocalString;

// Function NoceBase.NoceBaseFunctionLibrary.GetPlatformNetIdString
// 0x0018 (0x0018 - 0x0000)
struct NoceBaseFunctionLibrary_GetPlatformNetIdString final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetPlatformNetIdString;

// Function NoceBase.NoceBaseFunctionLibrary.GetPlatformType
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_GetPlatformType final
{
public:
	ENocePlatformType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetPlatformType;

// Function NoceBase.NoceBaseFunctionLibrary.GetRemainPSOTasks
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_GetRemainPSOTasks final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetRemainPSOTasks;

// Function NoceBase.NoceBaseFunctionLibrary.GetRobustWorld
// 0x0008 (0x0008 - 0x0000)
struct NoceBaseFunctionLibrary_GetRobustWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetRobustWorld;

// Function NoceBase.NoceBaseFunctionLibrary.GetSequenceFrameRate
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_GetSequenceFrameRate final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetSequenceFrameRate;

// Function NoceBase.NoceBaseFunctionLibrary.GetStreamingLevelPercentage
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetStreamingLevelPercentage final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetStreamingLevelPercentage;

// Function NoceBase.NoceBaseFunctionLibrary.GetSystemErrorMessage
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetSystemErrorMessage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetSystemErrorMessage;

// Function NoceBase.NoceBaseFunctionLibrary.GetSystemLastErrorCode
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_GetSystemLastErrorCode final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetSystemLastErrorCode;

// Function NoceBase.NoceBaseFunctionLibrary.GetUniquePlayerID
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_GetUniquePlayerID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_GetUniquePlayerID;

// Function NoceBase.NoceBaseFunctionLibrary.IsAnyStreamingLevelLoading
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_IsAnyStreamingLevelLoading final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsAnyStreamingLevelLoading;

// Function NoceBase.NoceBaseFunctionLibrary.IsAsyncLoadingThreadBusy
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsAsyncLoadingThreadBusy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsAsyncLoadingThreadBusy;

// Function NoceBase.NoceBaseFunctionLibrary.IsConsole
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsConsole final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsConsole;

// Function NoceBase.NoceBaseFunctionLibrary.IsConsoleLockhart
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsConsoleLockhart final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsConsoleLockhart;

// Function NoceBase.NoceBaseFunctionLibrary.IsEditor
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsEditor;

// Function NoceBase.NoceBaseFunctionLibrary.IsEpicGamesOnlineSystem
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsEpicGamesOnlineSystem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsEpicGamesOnlineSystem;

// Function NoceBase.NoceBaseFunctionLibrary.IsPlayStation5
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsPlayStation5 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsPlayStation5;

// Function NoceBase.NoceBaseFunctionLibrary.IsPS5Pro
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsPS5Pro final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsPS5Pro;

// Function NoceBase.NoceBaseFunctionLibrary.IsShippingBuild
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsShippingBuild final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsShippingBuild;

// Function NoceBase.NoceBaseFunctionLibrary.IsSimulatingInEditor
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsSimulatingInEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsSimulatingInEditor;

// Function NoceBase.NoceBaseFunctionLibrary.IsSteamOnlineSystem
// 0x0001 (0x0001 - 0x0000)
struct NoceBaseFunctionLibrary_IsSteamOnlineSystem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_IsSteamOnlineSystem;

// Function NoceBase.NoceBaseFunctionLibrary.LogError
// 0x0010 (0x0010 - 0x0000)
struct NoceBaseFunctionLibrary_LogError final
{
public:
	class FString                                 InStr;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_LogError;

// Function NoceBase.NoceBaseFunctionLibrary.ResetPerspectiveNearClipPlane
// 0x0008 (0x0008 - 0x0000)
struct NoceBaseFunctionLibrary_ResetPerspectiveNearClipPlane final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_ResetPerspectiveNearClipPlane;

// Function NoceBase.NoceBaseFunctionLibrary.SeamlessTravel
// 0x0020 (0x0020 - 0x0000)
struct NoceBaseFunctionLibrary_SeamlessTravel final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InURL;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsolute;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_SeamlessTravel;

// Function NoceBase.NoceBaseFunctionLibrary.ServerTravel
// 0x0020 (0x0020 - 0x0000)
struct NoceBaseFunctionLibrary_ServerTravel final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InURL;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsolute;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_ServerTravel;

// Function NoceBase.NoceBaseFunctionLibrary.SetNoceNearClipPlane
// 0x0004 (0x0004 - 0x0000)
struct NoceBaseFunctionLibrary_SetNoceNearClipPlane final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_SetNoceNearClipPlane;

// Function NoceBase.NoceBaseFunctionLibrary.ShowPlatformUserInfo
// 0x0008 (0x0008 - 0x0000)
struct NoceBaseFunctionLibrary_ShowPlatformUserInfo final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_ShowPlatformUserInfo;

// Function NoceBase.NoceBaseFunctionLibrary.SubstractDateTime
// 0x0018 (0x0018 - 0x0000)
struct NoceBaseFunctionLibrary_SubstractDateTime final
{
public:
	struct FDateTime                              InA;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              InB;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceBaseFunctionLibrary_SubstractDateTime;

// Function NoceBase.NoceFadeSubsystem.GetFadeInDebugInfo
// 0x0018 (0x0018 - 0x0000)
struct NoceFadeSubsystem_GetFadeInDebugInfo final
{
public:
	ENoceFadeType                                 FadeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_GetFadeInDebugInfo;

// Function NoceBase.NoceFadeSubsystem.GetFadeOutDebugInfo
// 0x0018 (0x0018 - 0x0000)
struct NoceFadeSubsystem_GetFadeOutDebugInfo final
{
public:
	ENoceFadeType                                 FadeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_GetFadeOutDebugInfo;

// Function NoceBase.NoceFadeSubsystem.IsAnyBusy
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeSubsystem_IsAnyBusy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_IsAnyBusy;

// Function NoceBase.NoceFadeSubsystem.IsAnyFadeOut
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeSubsystem_IsAnyFadeOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_IsAnyFadeOut;

// Function NoceBase.NoceFadeSubsystem.IsFadeBusy
// 0x0002 (0x0002 - 0x0000)
struct NoceFadeSubsystem_IsFadeBusy final
{
public:
	ENoceFadeType                                 FadeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_IsFadeBusy;

// Function NoceBase.NoceFadeSubsystem.IsFadeIn
// 0x0002 (0x0002 - 0x0000)
struct NoceFadeSubsystem_IsFadeIn final
{
public:
	ENoceFadeType                                 FadeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_IsFadeIn;

// Function NoceBase.NoceFadeSubsystem.IsFadeOut
// 0x0002 (0x0002 - 0x0000)
struct NoceFadeSubsystem_IsFadeOut final
{
public:
	ENoceFadeType                                 FadeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_IsFadeOut;

// Function NoceBase.NoceFadeSubsystem.RequestFadeIn
// 0x0018 (0x0018 - 0x0000)
struct NoceFadeSubsystem_RequestFadeIn final
{
public:
	ENoceFadeType                                 FadeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSecond;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequestInfo;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_RequestFadeIn;

// Function NoceBase.NoceFadeSubsystem.RequestFadeOutBlack
// 0x0018 (0x0018 - 0x0000)
struct NoceFadeSubsystem_RequestFadeOutBlack final
{
public:
	ENoceFadeType                                 FadeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSecond;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequestInfo;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_RequestFadeOutBlack;

// Function NoceBase.NoceFadeSubsystem.RequestFadeOutWhite
// 0x0018 (0x0018 - 0x0000)
struct NoceFadeSubsystem_RequestFadeOutWhite final
{
public:
	ENoceFadeType                                 FadeType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSecond;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequestInfo;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_RequestFadeOutWhite;

// Function NoceBase.NoceFadeSubsystem.ShowHideDebugInfo
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeSubsystem_ShowHideDebugInfo final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeSubsystem_ShowHideDebugInfo;

// Function NoceBase.NoceFadeWidget.FadeIn
// 0x0018 (0x0018 - 0x0000)
struct NoceFadeWidget_FadeIn final
{
public:
	float                                         TimeSecond;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InfoString;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeWidget_FadeIn;

// Function NoceBase.NoceFadeWidget.FadeOut
// 0x0018 (0x0018 - 0x0000)
struct NoceFadeWidget_FadeOut final
{
public:
	bool                                          IsBlack;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSecond;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InfoString;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeWidget_FadeOut;

// Function NoceBase.NoceFadeWidget.IsBusy
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeWidget_IsBusy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeWidget_IsBusy;

// Function NoceBase.NoceFadeWidget.IsFadeIn
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeWidget_IsFadeIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeWidget_IsFadeIn;

// Function NoceBase.NoceFadeWidget.IsFadeInComplete
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeWidget_IsFadeInComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeWidget_IsFadeInComplete;

// Function NoceBase.NoceFadeWidget.IsFadeOut
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeWidget_IsFadeOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeWidget_IsFadeOut;

// Function NoceBase.NoceFadeWidget.IsFadeOutComplete
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeWidget_IsFadeOutComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeWidget_IsFadeOutComplete;

// Function NoceBase.NoceFadeWidget.ShowHideDebugInfo
// 0x0001 (0x0001 - 0x0000)
struct NoceFadeWidget_ShowHideDebugInfo final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceFadeWidget_ShowHideDebugInfo;

}

