#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NoceLoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function NoceLoadingScreen.NoceLoadingScreenSystem.DebugHideLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct NoceLoadingScreenSystem_DebugHideLoadingScreen final
{
public:
	bool                                          IsHide;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceLoadingScreenSystem_DebugHideLoadingScreen;

// Function NoceLoadingScreen.NoceLoadingScreenSystem.Tick
// 0x0008 (0x0008 - 0x0000)
struct NoceLoadingScreenSystem_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NoceLoadingScreenSystem_Tick;

// Function NoceLoadingScreen.NoceLoadingScreenSystem.IsDisplayingLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct NoceLoadingScreenSystem_IsDisplayingLoadingScreen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NoceLoadingScreenSystem_IsDisplayingLoadingScreen;

}

