#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NoceBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NoceBase_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class NoceBase.NoceBaseFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNoceBaseFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClientTravel(class APlayerController* PlayerController, const class FString& URL, ETravelType TravelType, bool bSeamless);
	static bool DrawWidgetToTarget(class UTextureRenderTarget2D* Target, class UUserWidget* WidgetToRender, const struct FVector2D& DrawSize, bool UseGamma, ETextureFilter Filter, float DeltaTime);
	static void ForceStreamingOut();
	static void ForceUpdateTextureStreamingByPos(const struct FVector& InPos);
	static class FString GetBuildVersion();
	static class FString GetBuildVersion2();
	static class FString GetBuildVersion3();
	static class FString GetBuildVersion4();
	static int32 GetBuildVersion_Major();
	static int32 GetBuildVersion_Minor();
	static int32 GetBuildVersion_Patch();
	static int32 GetBuildVersion_Revision();
	static int32 GetBuildVersionAt(int32 InIndex);
	static struct FVector2D GetGameResolution();
	static struct FVector2D GetGameViewportSize();
	static class FString GetLongPackageNameForTravel(const struct FSoftObjectPath& InPath);
	static float GetNoceNearClipPlane();
	static ENocePCType GetPCType();
	static class FString GetPlatformNetIdLocalString(class APlayerController* PlayerController);
	static class FString GetPlatformNetIdString(class APlayerController* PlayerController);
	static ENocePlatformType GetPlatformType();
	static int32 GetRemainPSOTasks();
	static class UWorld* GetRobustWorld();
	static int32 GetSequenceFrameRate();
	static float GetStreamingLevelPercentage(const class UObject* WorldContextObject);
	static class FString GetSystemErrorMessage();
	static int32 GetSystemLastErrorCode();
	static class FString GetUniquePlayerID();
	static bool IsAnyStreamingLevelLoading(const class UObject* WorldContextObject);
	static bool IsAsyncLoadingThreadBusy();
	static bool IsConsole();
	static bool IsConsoleLockhart();
	static bool IsEditor();
	static bool IsEpicGamesOnlineSystem();
	static bool IsPlayStation5();
	static bool IsPS5Pro();
	static bool IsShippingBuild();
	static bool IsSimulatingInEditor();
	static bool IsSteamOnlineSystem();
	static void LogError(const class FString& InStr);
	static void PausePSOTasks();
	static void ResetPerspectiveNearClipPlane(class APlayerController* PlayerController);
	static void ResumePSOTasks();
	static void SeamlessTravel(class APlayerController* PlayerController, const class FString& InURL, bool bAbsolute);
	static void ServerTravel(class APlayerController* PlayerController, const class FString& InURL, bool bAbsolute);
	static void SetNoceNearClipPlane(float InValue);
	static void SetPSOBackgroundMode();
	static void SetPSOFastMode();
	static void ShowPlatformUserInfo(class APlayerController* PlayerController);
	static struct FTimespan SubstractDateTime(const struct FDateTime& InA, const struct FDateTime& InB);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceBaseFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceBaseFunctionLibrary")
	}
	static class UNoceBaseFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceBaseFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UNoceBaseFunctionLibrary;

// Class NoceBase.NoceBaseGameSetting
// 0x0D40 (0x0D68 - 0x0028)
class UNoceBaseGameSetting final : public UObject
{
public:
	struct FSoftObjectPath                        InputActionToKeyTable;                             // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        InputGamepadTypeDataTable;                         // 0x0048(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        InputMultiActionTable;                             // 0x0068(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        InputImageDataTable;                               // 0x0088(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        InputPCImageDataTable;                             // 0x00A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        WeaponCompositeTable;                              // 0x00C8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        OmamoriCompositeTable;                             // 0x00E8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ConsumableCompositeTable;                          // 0x0108(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        KeyItemCompositeTable;                             // 0x0128(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LetterGroupCompositeTable;                         // 0x0148(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LetterCompositeTable;                              // 0x0168(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        StageJumpDataTable;                                // 0x0188(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        TutorialDataTable;                                 // 0x01A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookCharacterNameDataTable;                    // 0x01C8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookEnemyNameDataTable;                        // 0x01E8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookInfoNameDataTable;                         // 0x0208(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookPuzzleNameDataTable;                       // 0x0228(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookTutorialNameDataTable;                     // 0x0248(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookCharacterPageDataTable;                    // 0x0268(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookEnemyPageDataTable;                        // 0x0288(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookInfoPageDataTable;                         // 0x02A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookPuzzlePageDataTable;                       // 0x02C8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookTutorialPageDataTable;                     // 0x02E8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookCharacterContentDataTable;                 // 0x0308(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookEnemyContentDataTable;                     // 0x0328(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookInfoContentDataTable;                      // 0x0348(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookPuzzleContentDataTable;                    // 0x0368(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        NotebookTutorialContentDataTable;                  // 0x0388(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ExpandInventoryDataTable;                          // 0x03A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LocationInfoDataTable;                             // 0x03C8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ChapterInfoDataTable;                              // 0x03E8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MissionHintDataTable;                              // 0x0408(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        OmamoriDrawingDataAsset;                           // 0x0428(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        KeyItemEmaDataTable;                               // 0x0448(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DLCRewardOmamoriName;                              // 0x0468(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        WidgetPathDataTable;                               // 0x0470(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         LoadingScreenWidgetClass;                          // 0x0490(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoadingScreenZOrder;                               // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         FadeWidgetClass;                                   // 0x04B8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FadeWidgetZOrder;                                  // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KeyboardInitRepeatDelay;                           // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KeyboardRepeatDelay;                               // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         SubtitleWidgetClass;                               // 0x04E8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         SubtitleWithSpeakerWidgetClass;                    // 0x0508(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         CinematicNoteWidgetClass;                          // 0x0528(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         CommonGuideWidgetClass;                            // 0x0548(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         InteractIconWidgetClass;                           // 0x0568(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         IndicatorWidgetClass;                              // 0x0588(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        TitleMapPath;                                      // 0x05A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        GameMapPath;                                       // 0x05C8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CombatTestMapPath;                                 // 0x05E8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LightFadeMaterialParameterCollection;              // 0x0608(0x0020)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HeightFogDataTable;                                // 0x0628(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        VolumetricFogDataTable;                            // 0x0648(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DirectionalLightDataTable;                         // 0x0668(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SweetLightDataTable;                               // 0x0688(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SkyLightDataTable;                                 // 0x06A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SkyAtmosphereDataTable;                            // 0x06C8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SkyDomeDataTable;                                  // 0x06E8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DarknessDataTable;                                 // 0x0708(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SSFSDataTable;                                     // 0x0728(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LanternNiagaraTable;                               // 0x0748(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        WindDataTable;                                     // 0x0768(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LumenTranslucencyTable;                            // 0x0788(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        FogNiagaraTable;                                   // 0x07A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        FogNiagaraParameterCollection;                     // 0x07C8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        EnvAreaAllFogNiagaraParameter;                     // 0x07E8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HellSmokeNiagaraParameter;                         // 0x0808(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HellSmokeMaterialParameter;                        // 0x0828(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        WorldTriggerTable;                                 // 0x0848(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        RegionDataLayerTable;                              // 0x0868(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DialogLineDataTable;                               // 0x0888(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DialogSetDataTable;                                // 0x08A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DialogSpeakerTable;                                // 0x08C8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DialogSpeakerNameTable;                            // 0x08E8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DialogSelfTalkTable;                               // 0x0908(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalDialogCoolDown;                              // 0x0928(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92C[0x4];                                      // 0x092C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        DialogDurationTable;                               // 0x0930(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DialogStyleTable;                                  // 0x0950(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AchievementTable;                                  // 0x0970(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        RecordNotebookTable;                               // 0x0990(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        GameEnemyRecord;                                   // 0x09B0(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        GameItemRecord;                                    // 0x09D0(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        GameProgressRecord;                                // 0x09F0(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        GameOtherRecord;                                   // 0x0A10(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SystemEnemyRecord;                                 // 0x0A30(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SystemItemRecord;                                  // 0x0A50(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SystemOtherRecord;                                 // 0x0A70(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNoceStorageSetting                    StorageSetting;                                    // 0x0A90(0x0178)(Edit, Config, NativeAccessSpecifierPublic)
	class FName                                   RedCapsuleName;                                    // 0x0C08(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HairOrnamentName;                                  // 0x0C10(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   KatanaWeaponName;                                  // 0x0C18(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   KatanaAlterWeaponName;                             // 0x0C20(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UFOWeaponName;                                     // 0x0C28(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           UFOWeaponRoundNames;                               // 0x0C30(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FName                                   ExorcismPotionName;                                // 0x0C40(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        PickupsDeployDataTable;                            // 0x0C48(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        PickupsConsumableDataTable;                        // 0x0C68(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        PickupsWeaponDataTable;                            // 0x0C88(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DynamicPickupsRuleDataAsset;                       // 0x0CA8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DynamicPickupsDataTable;                           // 0x0CC8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        PrepRoomPickupsRuleDataAsset;                      // 0x0CE8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HinaCharMeshTypeDataTable;                         // 0x0D08(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AnalyticsDataTable;                                // 0x0D28(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ChunkDataTable;                                    // 0x0D48(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceBaseGameSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceBaseGameSetting")
	}
	static class UNoceBaseGameSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceBaseGameSetting>();
	}
};
DUMPER7_ASSERTS_UNoceBaseGameSetting;

// Class NoceBase.NoceFadeSubsystem
// 0x0010 (0x0040 - 0x0030)
class UNoceFadeSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CleanFade();
	class FString GetFadeInDebugInfo(ENoceFadeType FadeType);
	class FString GetFadeOutDebugInfo(ENoceFadeType FadeType);
	bool IsAnyBusy();
	bool IsAnyFadeOut();
	bool IsFadeBusy(ENoceFadeType FadeType);
	bool IsFadeIn(ENoceFadeType FadeType);
	bool IsFadeOut(ENoceFadeType FadeType);
	void RequestFadeIn(ENoceFadeType FadeType, float TimeSecond, const class FString& RequestInfo);
	void RequestFadeOutBlack(ENoceFadeType FadeType, float TimeSecond, const class FString& RequestInfo);
	void RequestFadeOutWhite(ENoceFadeType FadeType, float TimeSecond, const class FString& RequestInfo);
	void ShowHideDebugInfo(bool Show);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceFadeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceFadeSubsystem")
	}
	static class UNoceFadeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceFadeSubsystem>();
	}
};
DUMPER7_ASSERTS_UNoceFadeSubsystem;

// Class NoceBase.NoceFadeWidget
// 0x0070 (0x0350 - 0x02E0)
class UNoceFadeWidget : public UUserWidget
{
public:
	struct FLinearColor                           ColorBlack;                                        // 0x02E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorWhite;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FadeOutInfoString;                                 // 0x0300(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FadeInInfoString;                                  // 0x0310(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ImageWidgetName;                                   // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InfoWidgetName;                                    // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_330[0x20];                                     // 0x0330(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FadeIn(float TimeSecond, const class FString& InfoString);
	void FadeOut(bool IsBlack, float TimeSecond, const class FString& InfoString);
	bool IsBusy();
	bool IsFadeIn();
	bool IsFadeInComplete();
	bool IsFadeOut();
	bool IsFadeOutComplete();
	void ResetMe();
	void ShowHideDebugInfo(bool Show);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NoceFadeWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceFadeWidget")
	}
	static class UNoceFadeWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceFadeWidget>();
	}
};
DUMPER7_ASSERTS_UNoceFadeWidget;

}

