#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NoceANS_HandAttachObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NoceANS_HandAttachObject.NoceANS_HandAttachObject_C
// 0x0100 (0x0130 - 0x0030)
class UNoceANS_HandAttachObject_C final : public UNoceAnimNotifyState
{
public:
	struct FTransform                             LeftHandOffsetTransform;                           // 0x0030(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RightHandOffsetTransform;                          // 0x0090(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_TraceStartOffset;                                // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                R_TraceStartOffset;                                // 0x0108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MatchToTargetSpeed;                                // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NoceANS_HandAttachObject_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NoceANS_HandAttachObject_C")
	}
	static class UNoceANS_HandAttachObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNoceANS_HandAttachObject_C>();
	}
};
DUMPER7_ASSERTS_UNoceANS_HandAttachObject_C;

}

