#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProInstanceToolsPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProInstanceToolsPlugin_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ProInstanceToolsPlugin.ProInstanceToolsParent
// 0x0300 (0x0590 - 0x0290)
class AProInstanceToolsParent : public AActor
{
public:
	class USceneComponent*                        Root;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBillboardComponent*                    Billboard;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProInstanceCurrentInstanceContainer   CurrentInstanceContainer;                          // 0x02A0(0x0020)(BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FProInstanceCurrentInstanceArrayContainer CurrentInstanceArrayContainer;                  // 0x02C0(0x0040)(BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FProInstanceInstance                   CurrentInstance;                                   // 0x0300(0x0130)(BlueprintVisible, NativeAccessSpecifierPublic)
	EProInstanceInstanceType                      InstanceType;                                      // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProInstanceInstance>           Instances;                                         // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FProInstanceInstanceSettings           InstancesSettings;                                 // 0x0448(0x0100)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableCollision;                                  // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProInstanceInstanceSelfOverlap               InstanceSelfOverlap;                               // 0x0549(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54A[0x2];                                      // 0x054A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x054C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             IndexVector;                                       // 0x0550(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartCullDistance;                                 // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndCullDistance;                                   // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRandomStream                          RandomStream;                                      // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSurfaceSnapping;                                  // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSurfaceAligning;                                  // 0x0571(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreSelfCollision;                              // 0x0572(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_573[0x1];                                      // 0x0573(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LineTracingDepth;                                  // 0x0574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bDrawDebugLine;                                    // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawTime;                                          // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BakeInstances();
	void CreateInstance(const struct FTransform& Transform);
	void DestroyComponents();
	void RandomizeSeed();
	void SetupInstances();
	void Update();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProInstanceToolsParent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProInstanceToolsParent")
	}
	static class AProInstanceToolsParent* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProInstanceToolsParent>();
	}
};
DUMPER7_ASSERTS_AProInstanceToolsParent;

// Class ProInstanceToolsPlugin.ProInstanceToolsCircle
// 0x0010 (0x05A0 - 0x0590)
class AProInstanceToolsCircle final : public AProInstanceToolsParent
{
public:
	int32                                         NumInstances;                                      // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProInstanceToolsCircleInstanceRotationType   RotationType;                                      // 0x059C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProInstanceToolsCircle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProInstanceToolsCircle")
	}
	static class AProInstanceToolsCircle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProInstanceToolsCircle>();
	}
};
DUMPER7_ASSERTS_AProInstanceToolsCircle;

// Class ProInstanceToolsPlugin.ProInstanceToolsGrid
// 0x0028 (0x05B8 - 0x0590)
class AProInstanceToolsGrid final : public AProInstanceToolsParent
{
public:
	struct FIntVector                             NumInstances;                                      // 0x0590(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Spacing;                                           // 0x05A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProInstanceToolsGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProInstanceToolsGrid")
	}
	static class AProInstanceToolsGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProInstanceToolsGrid>();
	}
};
DUMPER7_ASSERTS_AProInstanceToolsGrid;

// Class ProInstanceToolsPlugin.ProInstanceToolsPath
// 0x0020 (0x05B0 - 0x0590)
class AProInstanceToolsPath final : public AProInstanceToolsParent
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProInstanceToolsPathPlacementType            PlacementType;                                     // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Spacing;                                           // 0x059C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxInstances;                                      // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseInstanceLength;                                // 0x05A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFollowSplineRotation;                             // 0x05A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosedSpline;                                     // 0x05A6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A7[0x1];                                      // 0x05A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentDistance;                                   // 0x05A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentInstanceLength;                             // 0x05AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProInstanceToolsPath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProInstanceToolsPath")
	}
	static class AProInstanceToolsPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProInstanceToolsPath>();
	}
};
DUMPER7_ASSERTS_AProInstanceToolsPath;

// Class ProInstanceToolsPlugin.ProInstanceToolsPathScatter
// 0x0018 (0x05A8 - 0x0590)
class AProInstanceToolsPathScatter final : public AProInstanceToolsParent
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInstances;                                      // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSplineScale;                                   // 0x059C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFollowSplineRotation;                             // 0x059D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosedSpline;                                     // 0x059E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59F[0x1];                                      // 0x059F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentDistance;                                   // 0x05A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProInstanceToolsPathScatter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProInstanceToolsPathScatter")
	}
	static class AProInstanceToolsPathScatter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProInstanceToolsPathScatter>();
	}
};
DUMPER7_ASSERTS_AProInstanceToolsPathScatter;

// Class ProInstanceToolsPlugin.ProInstanceToolsScatter
// 0x0040 (0x05D0 - 0x0590)
class AProInstanceToolsScatter final : public AProInstanceToolsParent
{
public:
	int32                                         NumInstances;                                      // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProInstanceScatterPlacementType              PlacementType;                                     // 0x0594(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_595[0x3];                                      // 0x0595(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoxSize;                                           // 0x0598(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtent;                                         // 0x05B0(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProInstanceScatterBoxPivotPoint              BoxPivotPoint;                                     // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C9[0x3];                                      // 0x05C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SphereRadius;                                      // 0x05CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProInstanceToolsScatter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProInstanceToolsScatter")
	}
	static class AProInstanceToolsScatter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProInstanceToolsScatter>();
	}
};
DUMPER7_ASSERTS_AProInstanceToolsScatter;

}

