#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProInstanceToolsPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum ProInstanceToolsPlugin.EProInstanceToolsCircleInstanceRotationType
// NumValues: 0x0004
enum class EProInstanceToolsCircleInstanceRotationType : uint8
{
	CircleInstanceRotationType_Default       = 0,
	CircleInstanceRotationType_ToCenter      = 1,
	CircleInstanceRotationType_FromCenter    = 2,
	CircleInstanceRotationType_MAX           = 3,
};

// Enum ProInstanceToolsPlugin.EProInstanceInstanceType
// NumValues: 0x0005
enum class EProInstanceInstanceType : uint8
{
	InstanceType_StaticMesh                  = 0,
	InstanceType_ISM                         = 1,
	InstanceType_HISM                        = 2,
	InstanceType_ActorClass                  = 3,
	InstanceType_MAX                         = 4,
};

// Enum ProInstanceToolsPlugin.EProInstanceInstanceSelfOverlap
// NumValues: 0x0003
enum class EProInstanceInstanceSelfOverlap : uint8
{
	InstanceSelfOverlap_Ignore               = 0,
	InstanceSelfOverlap_Destroy              = 1,
	InstanceSelfOverlap_MAX                  = 2,
};

// Enum ProInstanceToolsPlugin.EProInstanceRotateToActorByAxes
// NumValues: 0x0004
enum class EProInstanceRotateToActorByAxes : uint8
{
	RotateToActorByAxes_XYZ                  = 0,
	RotateToActorByAxes_XY                   = 1,
	RotateToActorByAxes_Z                    = 2,
	RotateToActorByAxes_MAX                  = 3,
};

// Enum ProInstanceToolsPlugin.EProInstanceToolsPathPlacementType
// NumValues: 0x0003
enum class EProInstanceToolsPathPlacementType : uint8
{
	PathPlacementType_Distance               = 0,
	PathPlacementType_SplinePoint            = 1,
	PathPlacementType_MAX                    = 2,
};

// Enum ProInstanceToolsPlugin.EProInstanceScatterPlacementType
// NumValues: 0x0003
enum class EProInstanceScatterPlacementType : uint8
{
	ScatterPlacementType_Box                 = 0,
	ScatterPlacementType_Sphere              = 1,
	ScatterPlacementType_MAX                 = 2,
};

// Enum ProInstanceToolsPlugin.EProInstanceScatterBoxPivotPoint
// NumValues: 0x0003
enum class EProInstanceScatterBoxPivotPoint : uint8
{
	ScatterBoxPivotPoint_AtCenter            = 0,
	ScatterBoxPivotPoint_AtCorner            = 1,
	ScatterBoxPivotPoint_MAX                 = 2,
};

// ScriptStruct ProInstanceToolsPlugin.ProInstanceLocation
// 0x0048 (0x0048 - 0x0000)
struct FProInstanceLocation final
{
public:
	struct FVector                                LocationOffset;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationRangeMin;                                  // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationRangeMax;                                  // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProInstanceLocation;

// ScriptStruct ProInstanceToolsPlugin.ProInstanceRotation
// 0x0058 (0x0058 - 0x0000)
struct FProInstanceRotation final
{
public:
	struct FRotator                               RotationOffset;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RotationRangeMin;                                  // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RotationRangeMax;                                  // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 RotateToActor;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProInstanceRotateToActorByAxes               RotateToActorByAxes;                               // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FProInstanceRotation;

// ScriptStruct ProInstanceToolsPlugin.ProInstanceScale
// 0x0040 (0x0040 - 0x0000)
struct FProInstanceScale final
{
public:
	bool                                          bUniformScale;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinUniformScale;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxUniformScale;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MinScale;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxScale;                                          // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProInstanceScale;

// ScriptStruct ProInstanceToolsPlugin.ProInstanceCurrentInstanceContainer
// 0x0020 (0x0020 - 0x0000)
struct FProInstanceCurrentInstanceContainer final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInstancedStaticMeshComponent*          ISM;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHierarchicalInstancedStaticMeshComponent* HISM;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProInstanceCurrentInstanceContainer;

// ScriptStruct ProInstanceToolsPlugin.ProInstanceCurrentInstanceArrayContainer
// 0x0040 (0x0040 - 0x0000)
struct FProInstanceCurrentInstanceArrayContainer final
{
public:
	TArray<class UStaticMesh*>                    StaticMeshArray;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInstancedStaticMeshComponent*>  ISMArray;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> HISMArray;                              // 0x0020(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AActor>>             ActorClassArray;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProInstanceCurrentInstanceArrayContainer;

// ScriptStruct ProInstanceToolsPlugin.ProInstanceInstanceSettings
// 0x0100 (0x0100 - 0x0000)
struct FProInstanceInstanceSettings final
{
public:
	EComponentMobility                            Mobility;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProInstanceLocation                   Location;                                          // 0x0008(0x0048)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FProInstanceRotation                   Rotation;                                          // 0x0050(0x0058)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FProInstanceScale                      Scale;                                             // 0x00A8(0x0040)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCastShadows;                                      // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCustomCollision;                            // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomCollisionProfileName;                        // 0x00EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnChance;                                       // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InstanceLength;                                    // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FProInstanceInstanceSettings;

// ScriptStruct ProInstanceToolsPlugin.ProInstanceInstance
// 0x0130 (0x0130 - 0x0000)
struct FProInstanceInstance final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverwriteMaterials;                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             OverwriteMaterials;                                // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bInstanceSettings;                                 // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProInstanceInstanceSettings           InstanceSettings;                                  // 0x0030(0x0100)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProInstanceInstance;

}

