#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ArmCorrectorIKData

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_ArmCorrectorIKSetting_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ArmCorrectorIKData.S_ArmCorrectorIKData
// 0x00B0 (0x00B0 - 0x0000)
struct FS_ArmCorrectorIKData final
{
public:
	TMap<struct FGameplayTag, struct FS_ArmCorrectorIKSetting> WeaponSettings_46_151FC1034C284BD434F866A334A71991; // 0x0000(0x0050)(Edit, BlueprintVisible)
	bool                                          ShowDebug_51_280E13F640BA38F274ACC687D572E1A6;     // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BlendingTime_54_5ED61D064517B9173270B5970CF5C65A;  // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, struct FS_ArmCorrectorIKSetting>  Settings_67_FD21E2B64357561AE12274A2E8322715;      // 0x0060(0x0050)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FS_ArmCorrectorIKData;

}

