#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_AttachWallIKDataV2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_AttachWallIKDataV2.S_AttachWallIKDataV2
// 0x0050 (0x0050 - 0x0000)
struct FS_AttachWallIKDataV2 final
{
public:
	class FName                                   TargetBoneName_5_8C15A599447B9D3BCEEEFA8C42CF6425; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetTranslation_14_5987C9BB4424384AF9603F8A167590BE; // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OffsetRotation_16_20B0690D488FE4F5C00992969D0B9DB1; // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        DetectWallDistance_11_BC98F4B8489AA0E3DBF594B0CF8D599F; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IK_TypeInt_20_1DC03B274E27F40DB8DBB1B9F10F9406;    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Blend_23_0F50A54B41C534EA433E9AA478F0F4A8;         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FS_AttachWallIKDataV2;

}

