#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ClimbLadderIKData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ClimbLadderIKData.S_ClimbLadderIKData
// 0x0040 (0x0040 - 0x0000)
struct FS_ClimbLadderIKData final
{
public:
	struct FVector                                OffsetTranslation_14_5987C9BB4424384AF9603F8A167590BE; // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OffsetRotation_16_20B0690D488FE4F5C00992969D0B9DB1; // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         IK_TypeInt_20_1DC03B274E27F40DB8DBB1B9F10F9406;    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Blend_26_E68877DE4AD1747337B11B96BD591736;         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FS_ClimbLadderIKData;

}

