#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkinnedDecalComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SkinnedDecalComponent_structs.hpp"


namespace SDK::Params
{

// Function SkinnedDecalComponent.SkinnedDecalInstance.GetSampler
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalInstance_GetSampler final
{
public:
	class USkinnedDecalSampler*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalInstance_GetSampler;

// Function SkinnedDecalComponent.SkinnedDecalSampler.FindOrAddSkinnedDecalSampler
// 0x0010 (0x0010 - 0x0000)
struct SkinnedDecalSampler_FindOrAddSkinnedDecalSampler final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkinnedDecalSampler*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_FindOrAddSkinnedDecalSampler;

// Function SkinnedDecalComponent.SkinnedDecalSampler.GetReferenceBoneDecalLocationAndRotation
// 0x0060 (0x0060 - 0x0000)
struct SkinnedDecalSampler_GetReferenceBoneDecalLocationAndRotation final
{
public:
	const class USkeletalMeshComponent*           InComp;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InBoneName;                                        // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocation;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  OutRotator;                                        // 0x0030(0x0020)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_GetReferenceBoneDecalLocationAndRotation;

// Function SkinnedDecalComponent.SkinnedDecalSampler.CloneDecals
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalSampler_CloneDecals final
{
public:
	class USkinnedDecalSampler*                   Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_CloneDecals;

// Function SkinnedDecalComponent.SkinnedDecalSampler.DrawLine
// 0x0038 (0x0038 - 0x0000)
struct SkinnedDecalSampler_DrawLine final
{
public:
	class UCanvas*                                Canvas;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ScreenPositionA;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ScreenPositionB;                                   // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Data;                                              // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_DrawLine;

// Function SkinnedDecalComponent.SkinnedDecalSampler.GetDataTarget
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalSampler_GetDataTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_GetDataTarget;

// Function SkinnedDecalComponent.SkinnedDecalSampler.GetSamplerState
// 0x0078 (0x0078 - 0x0000)
struct SkinnedDecalSampler_GetSamplerState final
{
public:
	struct FSkinnedDecalSamplerState              ReturnValue;                                       // 0x0000(0x0078)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_GetSamplerState;

// Function SkinnedDecalComponent.SkinnedDecalSampler.LoadSampler
// 0x0018 (0x0018 - 0x0000)
struct SkinnedDecalSampler_LoadSampler final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_LoadSampler;

// Function SkinnedDecalComponent.SkinnedDecalSampler.OnFadeoutMaterialFinished
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalSampler_OnFadeoutMaterialFinished final
{
public:
	class UMeshComponent*                         InComp;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_OnFadeoutMaterialFinished;

// Function SkinnedDecalComponent.SkinnedDecalSampler.RemoveDecal
// 0x0004 (0x0004 - 0x0000)
struct SkinnedDecalSampler_RemoveDecal final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_RemoveDecal;

// Function SkinnedDecalComponent.SkinnedDecalSampler.RemoveFadeoutDecal
// 0x0004 (0x0004 - 0x0000)
struct SkinnedDecalSampler_RemoveFadeoutDecal final
{
public:
	float                                         InFadeOutTime;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_RemoveFadeoutDecal;

// Function SkinnedDecalComponent.SkinnedDecalSampler.RemovePureFadeoutOverlayMaterial
// 0x0020 (0x0020 - 0x0000)
struct SkinnedDecalSampler_RemovePureFadeoutOverlayMaterial final
{
public:
	class UMeshComponent*                         InComp;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFadeOutTime;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InFadeOutMat_StartName;                            // 0x000C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InFadeOutMat_IntervalName;                         // 0x0014(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_RemovePureFadeoutOverlayMaterial;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SaveSampler
// 0x0018 (0x0018 - 0x0000)
struct SkinnedDecalSampler_SaveSampler final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SaveSampler;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SetMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct SkinnedDecalSampler_SetMeshComponent final
{
public:
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Child;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SetMeshComponent;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SetPureFadeoutOverlayMaterial
// 0x0010 (0x0010 - 0x0000)
struct SkinnedDecalSampler_SetPureFadeoutOverlayMaterial final
{
public:
	class UMeshComponent*                         InComp;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     InMat;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SetPureFadeoutOverlayMaterial;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SetSamplerState
// 0x0078 (0x0078 - 0x0000)
struct SkinnedDecalSampler_SetSamplerState final
{
public:
	struct FSkinnedDecalSamplerState              State;                                             // 0x0000(0x0078)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SetSamplerState;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SetupComponentMaterials
// 0x0008 (0x0008 - 0x0000)
struct SkinnedDecalSampler_SetupComponentMaterials final
{
public:
	class USkeletalMeshComponent*                 Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SetupComponentMaterials;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SpawnDecal
// 0x0080 (0x0080 - 0x0000)
struct SkinnedDecalSampler_SpawnDecal final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0020(0x0020)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSkinnedDecalCustomData                CustomData;                                        // 0x0040(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0060(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0068(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceSet;                                          // 0x006C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveSampleState;                                  // 0x006D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SpawnDecal;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SpawnDecalFromData
// 0x0098 (0x0098 - 0x0000)
struct SkinnedDecalSampler_SpawnDecalFromData final
{
public:
	struct FSkinnedDecalData                      Data;                                              // 0x0000(0x0098)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SpawnDecalFromData;

// Function SkinnedDecalComponent.SkinnedDecalSampler.SpawnFadeOutDecal
// 0x0070 (0x0070 - 0x0000)
struct SkinnedDecalSampler_SpawnFadeOutDecal final
{
public:
	struct FVector                                LocalLocation;                                     // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  LocalRotation;                                     // 0x0020(0x0020)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSkinnedDecalCustomData                CustomData;                                        // 0x0040(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0060(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0068(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SkinnedDecalSampler_SpawnFadeOutDecal;

}

