#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMExtendedRuntime

#include "Basic.hpp"

#include "SMExtendedRuntime_structs.hpp"


namespace SDK::Params
{

// Function SMExtendedRuntime.SMExtendedGraphPropertyHelpers.BreakTextGraphProperty
// 0x1360 (0x1360 - 0x0000)
struct SMExtendedGraphPropertyHelpers_BreakTextGraphProperty final
{
public:
	struct FSMTextGraphProperty                   GraphProperty;                                     // 0x0000(0x1350)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Result;                                            // 0x1350(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMExtendedGraphPropertyHelpers_BreakTextGraphProperty;

// Function SMExtendedRuntime.SMExtendedGraphPropertyHelpers.ObjectToText
// 0x0020 (0x0020 - 0x0000)
struct SMExtendedGraphPropertyHelpers_ObjectToText final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InFunctionName;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMExtendedGraphPropertyHelpers_ObjectToText;

}

