#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "RigVM_structs.hpp"
#include "NBControlRig_structs.hpp"
#include "PBIK_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Transient.HoudiniEvent_SWC
// 0x0048 (0x0048 - 0x0000)
struct FHoudiniEvent_SWC final
{
public:
	struct FVector3f                              position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impulse;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Velocity;                                          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         POINTID;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LIFE;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniEvent_SWC;

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChaosDestructionEvent_SWC;

// PropertyBag Transient.PropertyBag_37632c90b9deeb82
// 0x1300 (0x1300 - 0x0000)
struct FPropertyBag_37632c90b9deeb82 final
{
public:
	struct FRigPose                               RigVMModel___HierarchyGetPoseItemArray_Pose;       // 0x0000(0x0070)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_Transform;     // 0x0070(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_CachedIndex;   // 0x00D0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_CachedIndex;            // 0x00E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_2_CachedIndex;          // 0x00F0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_6_CachedIndex;   // 0x0100(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_1_Transform;   // 0x0110(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_1_CachedIndex; // 0x0170(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_CachedIndex;          // 0x0180(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_7_CachedIndex;   // 0x0190(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_1_CachedIndex; // 0x01A0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_1_1_CachedIndex; // 0x01B0(0x0010)(Edit)
	struct FVector                                RigVMModel___Add_2_Result;                         // 0x01C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D8[0x8];                                      // 0x01D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_Transform;     // 0x01E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_CachedIndex;   // 0x0240(0x0010)(Edit)
	struct FVector                                RigVMModel___Add_2_A;                              // 0x0250(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_2_Value__IO;     // 0x0270(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_CachedIndex;   // 0x02D0(0x0010)(Edit)
	struct FVector                                RigVMModel___Add_2_2_Result;                       // 0x02E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_2_Transform;   // 0x0300(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_2_CachedIndex; // 0x0360(0x0010)(Edit)
	struct FVector                                RigVMModel___Add_2_2_A;                            // 0x0370(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_2_1_Value__IO;   // 0x0390(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_1_CachedIndex; // 0x03F0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_Transform;     // 0x0400(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_CachedIndex;   // 0x0460(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_Transform;   // 0x0470(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_CachedIndex; // 0x04D0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_1_Transform; // 0x04E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_1_CachedIndex; // 0x0540(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_1_1_Transform; // 0x0550(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_1_1_CachedIndex; // 0x05B0(0x0010)(Edit)
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_1997503883;                      // 0x05C0(0x0050)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_Transform;     // 0x0610(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_CachedIndex;   // 0x0670(0x0010)(Edit)
	struct FVector                                RigVMModel___Subtract_Result;                      // 0x0680(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_A;                           // 0x0698(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_B__IO;                       // 0x06B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_Transform;   // 0x06D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_CachedIndex; // 0x0730(0x0010)(Edit)
	struct FVector                                RigVMModel___Subtract_1_Result;                    // 0x0740(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_1_A;                         // 0x0758(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_1_B__IO;                     // 0x0770(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_206210420;                       // 0x0788(0x0050)(Edit)
	bool                                          RigVMModel___SphereTraceByTraceChannel_2_1_bHit;   // 0x07D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9[0x3];                                      // 0x07D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___SphereTraceByTraceChannel_2_1_Radius; // 0x07DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SphereTraceByTraceChannel_2_1_HitLocation; // 0x07E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SphereTraceByTraceChannel_2_1_HitNormal; // 0x07F8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  RigVMModel___SphereTraceByTraceChannel_2_1_WorkData; // 0x0810(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_SetTransform_8_1_Value__IO;   // 0x0820(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_8_1_CachedIndex; // 0x0880(0x0010)(Edit)
	struct FTransform                             RigVMModel___AimBoneMath_1_1_1_Result;             // 0x0890(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Negate_1_Result;                      // 0x08F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_1_1_1_Primary__IO;        // 0x0908(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimBoneMath_1_1_1_PrimaryCachedSpace; // 0x0950(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___AimBoneMath_1_1_1_SecondaryCachedSpace; // 0x0960(0x0010)(Edit)
	TArray<bool>                                  RigVMModel___AimBoneMath_1_1_1_bIsInitialized;     // 0x0970(0x0010)(Edit)
	struct FQuat                                  RigVMModel___RigUnit_SetRotation_1_1_1_Value;      // 0x0980(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRotation_1_1_1_CachedIndex; // 0x09A0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_2_1_1_CachedIndex; // 0x09B0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_2_1_Transform__IO; // 0x09C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_Result;                           // 0x0A20(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Scale_Result;                         // 0x0A38(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_11_Transform;    // 0x0A50(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_11_CachedIndex;  // 0x0AB0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_4_1_CachedIndex; // 0x0AC0(0x0010)(Edit)
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_1150104011;                      // 0x0AD0(0x0050)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_9_1_1_Transform; // 0x0B20(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_9_1_1_CachedIndex; // 0x0B80(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_CachedIndex;     // 0x0B90(0x0010)(Edit)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0BA0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_1861630451;                      // 0x0BA8(0x0050)(Edit)
	bool                                          RigVMModel___SphereTraceByTraceChannel_2_1_1_bHit; // 0x0BF8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF9[0x3];                                      // 0x0BF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___SphereTraceByTraceChannel_2_1_1_Radius; // 0x0BFC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SphereTraceByTraceChannel_2_1_1_HitLocation; // 0x0C00(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SphereTraceByTraceChannel_2_1_1_HitNormal; // 0x0C18(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  RigVMModel___SphereTraceByTraceChannel_2_1_1_WorkData; // 0x0C30(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_9_1_2_1_Transform; // 0x0C40(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_9_1_2_1_CachedIndex; // 0x0CA0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_SetTransform_8_1_1_1_Value__IO; // 0x0CB0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_8_1_1_1_CachedIndex; // 0x0D10(0x0010)(Edit)
	struct FTransform                             RigVMModel___AimBoneMath_1_1_1_1_1_Result;         // 0x0D20(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_1_1_1_1_1_Primary__IO;    // 0x0D80(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimBoneMath_1_1_1_1_1_PrimaryCachedSpace; // 0x0DC8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___AimBoneMath_1_1_1_1_1_SecondaryCachedSpace; // 0x0DD8(0x0010)(Edit)
	TArray<bool>                                  RigVMModel___AimBoneMath_1_1_1_1_1_bIsInitialized; // 0x0DE8(0x0010)(Edit)
	uint8                                         Pad_DF8[0x8];                                      // 0x0DF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___RigUnit_SetRotation_1_1_1_1_1_Value;  // 0x0E00(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRotation_1_1_1_1_1_CachedIndex; // 0x0E20(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_2_1_1_1_1_CachedIndex; // 0x0E30(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_2_1_1_1_Transform__IO; // 0x0E40(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_2_1_Result;                       // 0x0EA0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Scale_2_1_Result;                     // 0x0EB8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_1_Transform;   // 0x0ED0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_1_CachedIndex; // 0x0F30(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_3_1_1_CachedIndex; // 0x0F40(0x0010)(Edit)
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_208997953;                       // 0x0F50(0x0050)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_9_1_1_1_Transform; // 0x0FA0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_9_1_1_1_CachedIndex; // 0x1000(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_1_CachedIndex;   // 0x1010(0x0010)(Edit)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x1020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1028[0x8];                                     // 0x1028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_6_1_Transform;   // 0x1030(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_6_1_CachedIndex; // 0x1090(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_7_1_Transform;   // 0x10A0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_7_1_CachedIndex; // 0x1100(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_8_1_Transform;   // 0x1110(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_8_1_CachedIndex; // 0x1170(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_Transform;       // 0x1180(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_CachedIndex;     // 0x11E0(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__IO;                 // 0x11F0(0x0010)(Edit)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_EffectorSolverIndices;         // 0x1200(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_1_WorkData;                      // 0x1210(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_7_2_Transform;   // 0x1220(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_7_2_CachedIndex; // 0x1280(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_7_2_1_Transform; // 0x1290(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_7_2_1_CachedIndex; // 0x12F0(0x0010)(Edit)
};
DUMPER7_ASSERTS_FPropertyBag_37632c90b9deeb82;

// PropertyBag Transient.PropertyBag_95dcccf35b1d2780
// 0x0950 (0x0950 - 0x0000)
struct FPropertyBag_95dcccf35b1d2780 final
{
public:
	bool                                          RigVMModel___Branch_1_2_Condition;                 // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigPose                               RigVMModel___HierarchyGetPoseItemArray_1_Pose;     // 0x0008(0x0070)(Edit)
	class FName                                   RigVMModel___Branch_1_2_BlockToRun;                // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___ApplyAimV2_AimDistance;               // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___ApplyAimV2_Pitch;                     // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___ApplyAimV2_Yaw;                       // 0x0089(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___ApplyAimV2_MinHalfCone;               // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___ApplyAimV2_MaxHalfCone;               // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___ApplyAimV2_AimTargetOffset;           // 0x00A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___ApplyAimV2_AimMultiplier;             // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalVariable__ApplyAimV2_TargetBoneName;          // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalVariable__ApplyAimV2_MinConeDegree;           // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalVariable__ApplyAimV2_MaxConeDegree;           // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalVariable__ApplyAimV2_AimStrengthMultiplier;   // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathTransformTransformVector_1_Result; // 0x00E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       ApplyAimV2te_2113837028;                           // 0x00F8(0x0050)(Edit)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ApplyAimV2___ApplyAimV2_GetTransform_1_Transform;  // 0x0150(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ApplyAimV2___ApplyAimV2_GetTransform_1_CachedIndex; // 0x01B0(0x0010)(Edit)
	struct FTransform                             ApplyAimV2___ApplyAimV2_GetTransform_1_1_Transform; // 0x01C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         ApplyAimV2___ApplyAimV2_GetTransform_1_1_Item__IO; // 0x0220(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              ApplyAimV2___ApplyAimV2_GetTransform_1_1_CachedIndex; // 0x0230(0x0010)(Edit)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathTransformTransformVector_1_Location__IO; // 0x0240(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathTransformTransformVector_1_1_Result; // 0x0258(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathTransformTransformVector_1_1_Location__IO; // 0x0270(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_Subtract_Result;           // 0x0288(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariable__ApplyAimV2_BaseVector;              // 0x02A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariable__ApplyAimV2_BaseEndPosition;         // 0x02B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_DebugLineItemSpace_1_1_1_1_A; // 0x02D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_Add_Result;                // 0x02E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ApplyAimV2___ApplyAimV2_From_World_1_1_Global;     // 0x0300(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ApplyAimV2___ApplyAimV2_RigUnit_GetTransform_1_Transform; // 0x0360(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         ApplyAimV2___ApplyAimV2_RigUnit_GetTransform_1_Item__IO; // 0x03C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              ApplyAimV2___ApplyAimV2_RigUnit_GetTransform_1_CachedIndex; // 0x03D0(0x0010)(Edit)
	struct FVector                                ApplyAimV2___ApplyAimV2_Add_A;                     // 0x03E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_Subtract_1_Result;         // 0x03F8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariable__ApplyAimV2_AimVector;               // 0x0410(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariable__ApplyAimV2_AimTargetPosition;       // 0x0428(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_RigVMFunction_AnimEvalRichCurve_Result; // 0x0440(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_RigVMFunction_MathVectorDistance_Result; // 0x0444(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ApplyAimV2___ApplyAimV2_RigUnit_GetTransform_Transform; // 0x0450(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ApplyAimV2___ApplyAimV2_RigUnit_GetTransform_CachedIndex; // 0x04B0(0x0010)(Edit)
	struct FVector                                ApplyAimV2___ApplyAimV2_RigVMFunction_MathVectorDistance_A; // 0x04C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalVariable__ApplyAimV2_FrontCheckRatio;         // 0x04D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyAimV2___ApplyAimV2_Greater_Result;            // 0x04E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ApplyAimV2___ApplyAimV2_Greater_A;                 // 0x04E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ApplyAimV2___ApplyAimV2_Greater_B;                 // 0x04F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ApplyAimV2___ApplyAimV2_Negate_Result;             // 0x04F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       ApplyAimV2te_764963566;                            // 0x0500(0x0050)(Edit)
	double                                        ApplyAimV2___ApplyAimV2_Multiply_Result;           // 0x0550(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ApplyAimV2___ApplyAimV2_Clamp_Result;              // 0x0558(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ApplyAimV2___ApplyAimV2_Degrees_Result;            // 0x0560(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_MathVectorAngle_Result;    // 0x0568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ApplyAimV2___ApplyAimV2_MathVectorAngle_A__IO;     // 0x0570(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathVectorAngle_B__IO;     // 0x0588(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ApplyAimV2___ApplyAimV2_Degrees_Value;             // 0x05A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_DISPATCH_RigDispatch_Print_1_Value; // 0x05A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalVariable__ApplyAimV2_AimBoneName;             // 0x05AC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0xC];                                      // 0x05B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ApplyAimV2___ApplyAimV2_MathQuaternionFromEuler_Result; // 0x05C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathQuaternionFromEuler_Euler__IO; // 0x05E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ApplyAimV2___ApplyAimV2_ModifyTransforms_ItemToModify__IO; // 0x05F8(0x0010)(Edit)
	float                                         ApplyAimV2___ApplyAimV2_ModifyTransforms_Weight;   // 0x0608(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ApplyAimV2___ApplyAimV2_ModifyTransforms_WorkData; // 0x0610(0x0010)(Edit)
	float                                         ApplyAimV2___ApplyAimV2_DISPATCH_RigDispatch_Print_1_1_Value; // 0x0620(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624[0xC];                                      // 0x0624(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ApplyAimV2___ApplyAimV2_MathQuaternionFromEuler_1_Result; // 0x0630(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathQuaternionFromEuler_1_Euler__IO; // 0x0650(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ApplyAimV2___ApplyAimV2_ModifyTransforms_1_ItemToModify__IO; // 0x0668(0x0010)(Edit)
	float                                         ApplyAimV2___ApplyAimV2_ModifyTransforms_1_Weight; // 0x0678(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ApplyAimV2___ApplyAimV2_ModifyTransforms_1_WorkData; // 0x0680(0x0010)(Edit)
	class FName                                   ApplyAimV2___ApplyAimV2_Branch_1_BlockToRun;       // 0x0690(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ApplyAimV2___ApplyAimV2_Branch_BlockToRun;         // 0x0698(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyAimV2___ApplyAimV2_Greater_1_Result;          // 0x06A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ApplyAimV2___ApplyAimV2_Greater_1_A;               // 0x06A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ApplyAimV2___ApplyAimV2_Greater_1_B;               // 0x06B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B8[0x8];                                      // 0x06B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ApplyAimV2___ApplyAimV2_MathQuaternionFromEuler_2_Result; // 0x06C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_AccumulateLerp_2_Result;   // 0x06E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ApplyAimV2___ApplyAimV2_Negate_1_Result;           // 0x06E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       ApplyAimV2te_3049916242;                           // 0x06F0(0x0050)(Edit)
	double                                        ApplyAimV2___ApplyAimV2_Multiply_1_Result;         // 0x0740(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ApplyAimV2___ApplyAimV2_Clamp_1_Result;            // 0x0748(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_AccumulateLerp_2_TargetValue; // 0x0750(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_AccumulateLerp_2_InitialValue; // 0x0754(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ApplyAimV2___ApplyAimV2_AccumulateLerp_2_AccumulatedValue; // 0x0758(0x0010)(Edit)
	TArray<bool>                                  ApplyAimV2___ApplyAimV2_AccumulateLerp_2_bIsInitialized; // 0x0768(0x0010)(Edit)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathQuaternionFromEuler_2_Euler__IO; // 0x0778(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ApplyAimV2___ApplyAimV2_ModifyTransforms_2_ItemToModify__IO; // 0x0790(0x0010)(Edit)
	float                                         ApplyAimV2___ApplyAimV2_ModifyTransforms_2_Weight; // 0x07A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ApplyAimV2___ApplyAimV2_ModifyTransforms_2_WorkData; // 0x07A8(0x0010)(Edit)
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ApplyAimV2___ApplyAimV2_MathQuaternionFromEuler_1_1_Result; // 0x07C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_AccumulateLerp_2_1_Result; // 0x07E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_AccumulateLerp_2_1_TargetValue; // 0x07E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApplyAimV2___ApplyAimV2_AccumulateLerp_2_1_InitialValue; // 0x07E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC[0x4];                                      // 0x07EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ApplyAimV2___ApplyAimV2_AccumulateLerp_2_1_AccumulatedValue; // 0x07F0(0x0010)(Edit)
	TArray<bool>                                  ApplyAimV2___ApplyAimV2_AccumulateLerp_2_1_bIsInitialized; // 0x0800(0x0010)(Edit)
	struct FVector                                ApplyAimV2___ApplyAimV2_MathQuaternionFromEuler_1_1_Euler__IO; // 0x0810(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ApplyAimV2___ApplyAimV2_ModifyTransforms_1_1_ItemToModify__IO; // 0x0828(0x0010)(Edit)
	float                                         ApplyAimV2___ApplyAimV2_ModifyTransforms_1_1_Weight; // 0x0838(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ApplyAimV2___ApplyAimV2_ModifyTransforms_1_1_WorkData; // 0x0840(0x0010)(Edit)
	class FName                                   ApplyAimV2___ApplyAimV2_Branch_1_1_BlockToRun;     // 0x0850(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ApplyAimV2___ApplyAimV2_Branch_2_BlockToRun;       // 0x0858(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Branch_1_1_1_Condition;               // 0x0860(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0xF];                                      // 0x0861(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___From_World_1_1_1_Global;              // 0x0870(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_Transform;   // 0x08D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_CachedIndex; // 0x0930(0x0010)(Edit)
	class FName                                   RigVMModel___Branch_1_1_1_BlockToRun;              // 0x0940(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_95dcccf35b1d2780;

// PropertyBag Transient.PropertyBag_aa26a010423e375
// 0x02B0 (0x02B0 - 0x0000)
struct FPropertyBag_aa26a010423e375 final
{
public:
	class FName                                   RigVMModel___ApplyLookAtIK_LookAtCtrlName__Const;  // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         ApplyLookAtIK___ApplyLookAtIK_RigUnit_SetTransform_Item__Const; // 0x0008(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          ApplyLookAtIK___ApplyLookAtIK_RigUnit_SetTransform_Space__Const; // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyLookAtIK___ApplyLookAtIK_RigUnit_SetTransform_bInitial__Const; // 0x0015(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ApplyLookAtIK___ApplyLookAtIK_RigUnit_SetTransform_Weight__Const; // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyLookAtIK___ApplyLookAtIK_RigUnit_SetTransform_bPropagateToChildren__Const; // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         ApplyLookAtIK___ApplyLookAtIK_AimItem_Item__Const; // 0x0020(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                ApplyLookAtIK___ApplyLookAtIK_AimItem_Primary__Const; // 0x0030(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         ApplyLookAtIK___ApplyLookAtIK_CollectionChainArray_LastItem__Const; // 0x0078(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ApplyLookAtIK___ApplyLookAtIK_MathTransformRotateVector_1_Vector__Const; // 0x0088(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                ApplyLookAtIK___ApplyLookAtIK_AimItem_Secondary__Const; // 0x00A0(0x0048)(Edit, NoDestructor)
	struct FVector                                ApplyLookAtIK___ApplyLookAtIK_MathTransformRotateVector_2_Vector__Const; // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     ApplyLookAtIK___ApplyLookAtIK_AnimEvalRichCurve_1_Curve__Const; // 0x0100(0x0088)(Edit)
	float                                         ApplyLookAtIK___ApplyLookAtIK_AnimEvalRichCurve_1_SourceMinimum__Const; // 0x0188(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         ApplyLookAtIK___ApplyLookAtIK_AimItem_DebugSettings__Const; // 0x0190(0x0070)(Edit, NoDestructor)
	struct FVector                                ApplyLookAtIK___ApplyLookAtIK_DebugLineItemSpace_A__Const; // 0x0200(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyLookAtIK___ApplyLookAtIK_DebugLineItemSpace_B__Const; // 0x0218(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ApplyLookAtIK___ApplyLookAtIK_DebugLineItemSpace_Color__Const; // 0x0230(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ApplyLookAtIK___ApplyLookAtIK_DebugLineItemSpace_WorldOffset__Const; // 0x0240(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         ApplyLookAtIK___ApplyLookAtIK_CollectionChainArray_FirstItem__Const; // 0x02A0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_aa26a010423e375;

// PropertyBag Transient.PropertyBag_c1993e9ec46b3f57
// 0x04B0 (0x04B0 - 0x0000)
struct FPropertyBag_c1993e9ec46b3f57 final
{
public:
	bool                                          RigVMModel___HierarchyGetPoseItemArray_Initial__Const; // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               RigVMModel___HierarchyGetPoseItemArray_ElementType__Const; // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 RigVMModel___HierarchyGetPoseItemArray_ItemsToGet__Const; // 0x0008(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___Set_Transform_Item__Const;            // 0x0018(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_Space__Const;           // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_Item__Const;   // 0x0028(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_Weight__Const;          // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_bPropagateToChildren__Const; // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_2_Item__Const;          // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_6_Item__Const;   // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_Item__Const;          // 0x0054(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_1_Item__Const; // 0x0060(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_7_Item__Const;   // 0x006C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_1_OffsetTransform__Const; // 0x0080(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___OffsetTransformForItem_1_1_OffsetTransform__Const; // 0x00E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_Item__Const;   // 0x0140(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_2_Value__Const;  // 0x0150(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_1_Item__Const; // 0x01B0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x01BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Color__Const; // 0x01C0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Thickness__Const; // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x01D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D8[0x8];                                      // 0x01D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_WorldOffset__Const; // 0x01E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_1_Mode__Const; // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_1_Color__Const; // 0x0244(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_1_1_1_Color__Const; // 0x0254(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Subtract_B__Const;                    // 0x0268(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0280(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0290(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               RigVMModel___SphereTraceByTraceChannel_2_1_TraceChannel__Const; // 0x0294(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_1_1_1_Primary__Const;     // 0x0298(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_1_1_1_Secondary__Const;   // 0x02E0(0x0048)(Edit, NoDestructor)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimBoneMath_1_1_1_DebugSettings__Const; // 0x0330(0x0070)(Edit, NoDestructor)
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_2_1_Color__Const; // 0x03A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Scale_Factor__Const;                  // 0x03B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_8_1_1_1_Item__Const; // 0x03B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_1_1_1_1_1_Primary__Const; // 0x03C0(0x0048)(Edit, NoDestructor)
	class FName                                   RigVMModel___PBIK_1_Root__Const;                   // 0x0408(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__Const;              // 0x0410(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_7_1_Item__Const; // 0x0420(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_8_1_Item__Const; // 0x042C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_BoneSettings__Const;           // 0x0438(0x0010)(Edit)
	TArray<class FName>                           RigVMModel___PBIK_1_ExcludedBones__Const;          // 0x0448(0x0010)(Edit)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_Settings__Const;               // 0x0458(0x0040)(Edit, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_Debug__Const;                  // 0x0498(0x0008)(Edit, NoDestructor)
	struct FLinearColor                           RigVMModel___RigVMFunction_DebugTransformMutableNoSpace_2_2_Color__Const; // 0x04A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
