#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TitleFlow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NeoAudio_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TitleFlow.WBP_TitleFlow_C
// 0x0088 (0x0438 - 0x03B0)
class UWBP_TitleFlow_C final : public UNoceFocusableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TitleFlow_Logo_C*                  WBP_DevTitleFlow_Logo;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InitialSetting_C*                  WBP_InitialSetting;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleFlow_Warning_C*               WBP_TitleFlow_Warning;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ENoceUITitleFlowStep                          CurrentStep;                                       // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNoceFocusableWidget*>           Pages;                                             // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   InitialSettingName;                                // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               InitialSettingSound;                               // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsLocalSettingInitialized;                         // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPSONum;                                         // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   LoadingBarWidgetPath;                              // 0x0400(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UNoceLoadBarWidget*                     LoadBarWidget;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ProgessHandle;                                     // 0x0430(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ShowCommon(bool* NoUse);
	void Completed_B2467B96493AC4315E636BB79DD3FA37(class USaveGame* SaveGame, bool bSuccess);
	void ExecuteUbergraph_WBP_TitleFlow(int32 EntryPoint);
	void OnFadeInCompleted();
	void OnInitialized();
	void OnPageClosed();
	void OnProgressBarClosed();
	void RequestSystemSave();
	void SetAllData(bool* NoUse);
	void ShowLoadingBar();
	void UpdateProgress();
	void WaitOnlineSystemLogin();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TitleFlow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TitleFlow_C")
	}
	static class UWBP_TitleFlow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TitleFlow_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TitleFlow_C;

}

