#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Omamori_List

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Omamori_List.WBP_Omamori_List_C.ExecuteUbergraph_WBP_Omamori_List
// 0x0008 (0x0008 - 0x0000)
struct WBP_Omamori_List_C_ExecuteUbergraph_WBP_Omamori_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Omamori_List_C_ExecuteUbergraph_WBP_Omamori_List;

// Function WBP_Omamori_List.WBP_Omamori_List_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Omamori_List_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Omamori_List_C_PreConstruct;

// Function WBP_Omamori_List.WBP_Omamori_List_C.ShowDisableTip
// 0x0018 (0x0018 - 0x0000)
struct WBP_Omamori_List_C_ShowDisableTip final
{
public:
	bool                                          IsTipEnable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InText;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_Omamori_List_C_ShowDisableTip;

}

