#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InitialSetting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NoceBase_structs.hpp"
#include "GameNoce_classes.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InitialSetting.WBP_InitialSetting_C
// 0x0070 (0x0888 - 0x0818)
class UWBP_InitialSetting_C final : public UNoceOptionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutBlack;                                      // 0x0820(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Group;                                             // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BrightnessSetting_C*               WBP_BrightnessSetting;                             // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleFlow_List_C*                  WBP_TitleFlow_List;                                // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNoceUIInputDirectionHelper*            InputHelper;                                       // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCancel;                                         // 0x0848(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCanceled;                                        // 0x0849(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84A[0x2];                                      // 0x084A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RequestScrollToTopTimer;                           // 0x084C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Category;                                          // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNoceFocusableWidget*>           Pages;                                             // 0x0858(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           ShowWidgetTimer;                                   // 0x0868(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               SelectSound;                                       // 0x0870(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FNeoAudioTriggerIdHandle               ConfirmSound;                                      // 0x0878(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FNeoAudioTriggerIdHandle               CancelSound;                                       // 0x0880(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BP_DisableInputs(bool* NoUse);
	void BP_EnableInputs(bool* NoUse);
	void BP_HideCommon(bool* NoUse);
	void BP_ShowCommon(bool* NoUse);
	bool Cancel();
	bool Confirm();
	void ExecuteUbergraph_WBP_InitialSetting(int32 EntryPoint);
	class UNoceListView* GetListView();
	bool HandleRepeatKeys(const struct FInputEvent& InInputEvent, const struct FKey& InKey);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void OnInitialized();
	void SelectCategoryIndex(bool HasCancel_0, const class FName& CategoryName);
	void ShowBrightness();
	void ShowBrightnessWidget();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InitialSetting_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InitialSetting_C")
	}
	static class UWBP_InitialSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InitialSetting_C>();
	}
};
DUMPER7_ASSERTS_UWBP_InitialSetting_C;

}

