#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavePoint_Ema

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SavePoint_Ema.WBP_SavePoint_Ema_C.UpdateValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePoint_Ema_C_UpdateValue final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithAnimation;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SavePoint_Ema_C_UpdateValue;

// Function WBP_SavePoint_Ema.WBP_SavePoint_Ema_C.Update Text
// 0x0004 (0x0004 - 0x0000)
struct WBP_SavePoint_Ema_C_Update_Text final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SavePoint_Ema_C_Update_Text;

// Function WBP_SavePoint_Ema.WBP_SavePoint_Ema_C.ExecuteUbergraph_WBP_SavePoint_Ema
// 0x0010 (0x0010 - 0x0000)
struct WBP_SavePoint_Ema_C_ExecuteUbergraph_WBP_SavePoint_Ema final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SavePoint_Ema_C_ExecuteUbergraph_WBP_SavePoint_Ema;

}

