#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonAbilityBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommonAbilityBar.WBP_CommonAbilityBar_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_CommonAbilityBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AbilityNameText;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ValueBar;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueText;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   AbilityName;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CommonAbilityBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetFillColor(const struct FLinearColor& InColor);
	void SetTextColor(const struct FSlateColor& InColorAndOpacity);
	void SetValue(double CurrentValue, double MaxValue);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_CommonAbilityBar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_CommonAbilityBar_C")
	}
	static class UWBP_CommonAbilityBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommonAbilityBar_C>();
	}
};
DUMPER7_ASSERTS_UWBP_CommonAbilityBar_C;

}

