#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavePoint

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "NeoAudio_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SavePoint.WBP_SavePoint_C
// 0x0148 (0x07B0 - 0x0668)
class UWBP_SavePoint_C final : public UNoceSavePointWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraSystemWidget*                   NiagaraBlackPoint1;                                // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraBlackPoint2;                                // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FaithValueText_C*                  WBP_FaithValueText;                                // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavePoint_Ema_C*                   WBP_SavePoint_Ema;                                 // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavePoint_Transition_C*            WBP_SavePoint_Transition;                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FNeoAudioTriggerIdHandle               PopWindowConfirmSound;                             // 0x0698(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FNeoAudioTriggerIdHandle               PopWindowCancelSound;                              // 0x06A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGameplayTagContainer                  HideHUDTag;                                        // 0x06A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           CanClaimDLCProgress;                               // 0x06C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNoceConsumableDataRowHandle>   DLCBoosterPackNames;                               // 0x06D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftClassPtr<class UClass>                   PopWindowWidgetPath;                               // 0x06E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UNocePopWindowWidget*                   PopWindowWidget;                                   // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   PickPreviewWidgetPath;                             // 0x0710(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   PopClamedRewardText;                               // 0x0738(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNocePickPreviewWidget*                 PickPreviewWidget;                                 // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENoceUIGetDLCRewardState                      ClaimRewardState;                                  // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClaimedOmamori;                                    // 0x0751(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClaimedBoosterPack;                                // 0x0752(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_753[0x5];                                      // 0x0753(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PopNotEnoughInventoryText;                         // 0x0758(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PopClaimSuccessBothText;                           // 0x0768(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PopClaimSuccessOmamoriText;                        // 0x0778(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PopClaimSuccessBoosterPackText;                    // 0x0788(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          InventoryNotEnough;                                // 0x0798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPreviewEnd;                                      // 0x0799(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79A[0x2];                                      // 0x079A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNeoAudioTriggerIdHandle               Audio_PauseDialogue;                               // 0x079C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FNeoAudioTriggerIdHandle               Audio_ResumeDialogue;                              // 0x07A4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	bool UpdateFaithValue(bool WithAnimation);
	bool UpdateEmaNum(bool WithAnimation);
	void ToClaimRewardBP(bool* NoUse);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ShowPopWindow(const class FText& InText);
	void ShowPickPreview(const ENoceInventoryType InType, const class FName InID);
	void ShowGotRewards();
	bool ShowFaithValue(bool IsShow);
	bool ShowEmaNum(bool IsShow);
	void PlayTransition(bool IsForward, bool* NoUse);
	void OnShowNextPage();
	void OnPreviewEnd(ENoceInventoryType Type, class FName ID);
	void OnPopWindowClosed();
	void OnFadeOutCompleted();
	void OnFadeInCompleted();
	void ExecuteUbergraph_WBP_SavePoint(int32 EntryPoint);
	void Destruct();
	void Construct();
	void ClearResource(bool* NoUse);
	void ClaimBoosterPack();
	bool CheckProgressToClaimDLCReward();
	void CheckDLCProgressToEnableOffering(bool* NoUse);
	bool CanClaimReward();
	bool CanClaimOmamori();
	bool CanClaimBoosterPack();
	void BP_ShowCommon(bool* NoUse);
	void BP_HideCommon(bool* NoUse);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SavePoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SavePoint_C")
	}
	static class UWBP_SavePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SavePoint_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SavePoint_C;

}

