#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TitleFlow_Logo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameNoce_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TitleFlow_Logo.WBP_TitleFlow_Logo_C
// 0x0090 (0x0440 - 0x03B0)
class UWBP_TitleFlow_Logo_C final : public UNoceFocusableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutLogo;                                       // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInLogo;                                        // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInBG;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackBG;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrontBG;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoImage;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               LogoAnimations;                                    // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ShowNextLogoTimer;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        Images;                                            // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        BGImages;                                          // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  NeedBG;                                            // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanSkip;                                           // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstLaunch;                                     // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_HideCommon(bool* NoUse);
	void BP_ShowCommon(bool* NoUse);
	void ExecuteUbergraph_WBP_TitleFlow_Logo(int32 EntryPoint);
	void FadeOutCurrentLogo();
	bool HandleNotRepeatKeys(const struct FInputEvent& InInputEvent, const struct FKey& InKey);
	void OnFadeInBGCompleted();
	void OnFadeInCompleted();
	void OnFadeInLogoCompleted();
	void OnFadeOutLogoCompleted();
	void OnInitialized();
	void PlayFadeInLogo();
	void SetAllData(bool* NoUse);
	void ShowNextLogo();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TitleFlow_Logo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TitleFlow_Logo_C")
	}
	static class UWBP_TitleFlow_Logo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TitleFlow_Logo_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TitleFlow_Logo_C;

}

