#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemShortcut_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ItemShortcut_Item.WBP_ItemShortcut_Item_C.OnDecide
// 0x0018 (0x0018 - 0x0000)
struct WBP_ItemShortcut_Item_C_OnDecide final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANocePlayerState*                       CallFunc_GetNocePlayerState_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUseConsumableType_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ItemShortcut_Item_C_OnDecide;

// Function WBP_ItemShortcut_Item.WBP_ItemShortcut_Item_C.OnFocus
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemShortcut_Item_C_OnFocus final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ItemShortcut_Item_C_OnFocus;

// Function WBP_ItemShortcut_Item.WBP_ItemShortcut_Item_C.OnReset
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemShortcut_Item_C_OnReset final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ItemShortcut_Item_C_OnReset;

// Function WBP_ItemShortcut_Item.WBP_ItemShortcut_Item_C.OnSelect
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemShortcut_Item_C_OnSelect final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ItemShortcut_Item_C_OnSelect;

// Function WBP_ItemShortcut_Item.WBP_ItemShortcut_Item_C.OnUnfocus
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemShortcut_Item_C_OnUnfocus final
{
public:
	bool                                          NoUse;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ItemShortcut_Item_C_OnUnfocus;

// Function WBP_ItemShortcut_Item.WBP_ItemShortcut_Item_C.SetContainer
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemShortcut_Item_C_SetContainer final
{
public:
	class UObject*                                NewContainer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NoUse;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ItemShortcut_Item_C_SetContainer;

}

