#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NoteB_Book

#include "Basic.hpp"

#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NoteB_Book.WBP_NoteB_Book_C
// 0x0138 (0x0438 - 0x0300)
class UWBP_NoteB_Book_C final : public UNoceUserWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AllPageText;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NoteB_Arrow_C*                     ArrowLeft;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NoteB_Arrow_C*                     ArrowRight;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Left;                                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PageCount;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageText;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RenderTarget;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Right;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_NotebookWorld_C*                    NotebookWorld;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasMultipleCategories;                             // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceNotebookType                             CurrentType;                                       // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentPage;                                       // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalPages;                                        // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GuideIndex;                                        // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNoceNotebookCharacterPageData> CharacterPages;                                    // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceNotebookEnemyPageData>     EnemyPages;                                        // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceNotebookInfoPageData>      InfoPages;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceNotebookPuzzlePageData>    PuzzlePages;                                       // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FNoceNotebookTutorialPageData>  TutorialPages;                                     // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Got_IDs;                                           // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           New_IDs;                                           // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class FName RemovedID)> UpdateNewIDs;                              // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FName>                           New_IDs2;                                          // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUserWidget*                            LeftWidget;                                        // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            RightWidget;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PreviousLeftWidget;                                // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PreviousRightWidget;                               // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         BookmarkLimitPerPage;                              // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceTick;                                         // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNocePlayerInventoryComponent*          InventoryComponent;                                // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        TurnPageRepeatTimer;                               // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnPageRepeatTime;                                // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceNotebookBookmarkType                     BookmarkType;                                      // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENoceNotebookBookmarkSocketType               SocketType;                                        // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddBookmarks(ENoceNotebookBookmarkType BookmarkType_0, ENoceNotebookBookmarkSocketType SocketType_0);
	void AddPage(bool IsLeft, const ENoceNotebookType Type, const struct FSoftClassPath& Widget, TArray<class FName>& Contents, int32 TextStartIndex, int32 ImageStartIndex, int32 PageTextureIndex, class FName* FirstContent, TArray<class FName>* NewContents);
	bool CanSelectNext();
	bool CanSelectPrevious();
	void ClearBookmarks();
	void ClearWidget(bool IsLeft);
	void DrawWidgetRT(bool ForceDraw);
	void ExecuteUbergraph_WBP_NoteB_Book(int32 EntryPoint);
	void HideGuide();
	void OnInitialized();
	void OnInputDeviceChanged();
	void OnUpdatePageText(int32 Index_0);
	void RefreshArrowDisable();
	void RefreshCategory(int32 PreviousIndex, int32 NextIndex);
	void RefreshCharaterPage();
	void RefreshEnemyPage();
	void RefreshInfoPage();
	void RefreshPuzzlePage();
	void RefreshTutorialPage();
	void SelectNext();
	void SelectPrevious();
	void SetAllCharacterPages(TArray<struct FNoceNotebookCharacterPageData>& AllPages, TArray<class FName>& GotIDs, TArray<class FName>& NewIDs, int32 DefaultPage, ENoceNotebookBookmarkType InBookmarkType, ENoceNotebookBookmarkSocketType InSocketType);
	void SetAllEnemyPages(TArray<struct FNoceNotebookEnemyPageData>& AllPages, TArray<class FName>& GotIDs, TArray<class FName>& NewIDs, int32 DefaultPage, ENoceNotebookBookmarkType InBookmarkType, ENoceNotebookBookmarkSocketType InSocketType);
	void SetAllInfoPages(TArray<struct FNoceNotebookInfoPageData>& AllPages, TArray<class FName>& GotIDs, TArray<class FName>& NewIDs, int32 DefaultPage, ENoceNotebookBookmarkType InBookmarkType, ENoceNotebookBookmarkSocketType InSocketType);
	void SetAllPuzzlePages(TArray<struct FNoceNotebookPuzzlePageData>& AllPages, TArray<class FName>& GotIDs, TArray<class FName>& NewIDs, int32 DefaultPage, ENoceNotebookBookmarkType InBookmarkType, ENoceNotebookBookmarkSocketType InSocketType);
	void SetAllTutorialPages(TArray<struct FNoceNotebookTutorialPageData>& AllPages, TArray<class FName>& GotIDs, TArray<class FName>& NewIDs, int32 DefaultPage, const bool InNeedBookmark, ENoceNotebookBookmarkType InBookmarkType, ENoceNotebookBookmarkSocketType InSocketType);
	void SetEnable(bool bEnabled);
	bool SetupContentPageData(class FName Name_0, ENoceNotebookType Type, const TArray<class FText>& Texts, const TArray<struct FSoftObjectPath>& Images, const TArray<bool>& Visibles, const TArray<bool>& News, TArray<bool>& News2);
	void SwitchPreviousPages();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateAllPageText(int32 TotalPageNum, ENoceNotebookBookmarkType InBookmarkType, ENoceNotebookBookmarkSocketType InSocketType);
	void UpdateBookmarks();
	void UpdateGuide(class FName CategoryGuide, class FName CategoryPagesGuide);
	void UpdateInput(const struct FInputEvent& InputEvent, const struct FKey& Key, bool* IsTriggered);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_NoteB_Book_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_NoteB_Book_C")
	}
	static class UWBP_NoteB_Book_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NoteB_Book_C>();
	}
};
DUMPER7_ASSERTS_UWBP_NoteB_Book_C;

}

