#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TitleFlow_Warning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NoceBase_structs.hpp"
#include "GameNoce_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TitleFlow_Warning.WBP_TitleFlow_Warning_C
// 0x00D8 (0x0488 - 0x03B0)
class UWBP_TitleFlow_Warning_C final : public UNoceFocusableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutWarning;                                    // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInWarning;                                     // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AutoSaveText;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           AutoSaveWarningVerticalBox;                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraBlackPoint;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PhotoSensibilityWarningVerticalBox;                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningIcon;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningIcon_1;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActiveUser_C*                      WBP_ActiveUser;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AutoSaveIcon_C*                    WBP_AutoSaveIcon;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           WorriedWarningVerticalBox;                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UVerticalBox*>                   Warnings;                                          // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentIndex;                                      // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               WarningAnimations;                                 // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ShowNextWarningTimer;                              // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   PCAutoSaveText;                                    // 0x0440(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PS5AutoSaveText;                                   // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   XSXAutoSaveText;                                   // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanSkip;                                           // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                ShowWarningTime;                                   // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_HideCommon(bool* NoUse);
	void BP_ShowCommon(bool* NoUse);
	void ExecuteUbergraph_WBP_TitleFlow_Warning(int32 EntryPoint);
	void FadeOutCurrentWarning();
	bool HandleNotRepeatKeys(const struct FInputEvent& InInputEvent, const struct FKey& InKey);
	void OnFadeInCompleted();
	void OnFadeInWarningCompleted();
	void OnFadeOutWarningCompleted();
	void OnInitialized();
	void SetAllData(bool* NoUse);
	void ShowNextWarning();
	void UpdateWarningVisibility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TitleFlow_Warning_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TitleFlow_Warning_C")
	}
	static class UWBP_TitleFlow_Warning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TitleFlow_Warning_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TitleFlow_Warning_C;

}

