#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Notebook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameNoce_structs.hpp"
#include "GameNoce_classes.hpp"
#include "NeoAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Notebook.WBP_Notebook_C
// 0x01C0 (0x0570 - 0x03B0)
class UWBP_Notebook_C final : public UNoceFocusableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NoteB_Book_C*                      Book;                                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NoteB_PageTab_C*                   PageTab;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Inventory_Title_C*                 Title;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NoteB_Tab_C*                       WBP_NoteB_Tab;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNoceGeneralHintWidget*                 HintWidget;                                        // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   InitContentID;                                     // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           AllPageIDs;                                        // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           AllNameIDs;                                        // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           CharacterIDs;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           NewCharacterIDs;                                   // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           EnemyIDs;                                          // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           NewEnemyIDs;                                       // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           PuzzleIDs;                                         // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           NewPuzzleIDs;                                      // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           LeftTabIDs;                                        // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FNeoAudioTriggerIdHandle               SwitchTabSound;                                    // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FNeoAudioTriggerIdHandle               SelectSubCategorySound;                            // 0x0480(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class FName>                           TutorialIDs;                                       // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           NewTutorialIDs;                                    // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSoftClassPath                         HintWidgetPath;                                    // 0x04A8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         TabIndex;                                          // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeftTabIndex;                                      // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstOpen;                                       // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           InfoIDs;                                           // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           NewInfoIDs;                                        // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UpdateLeftTabByTopTab;                             // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNocePlayerInventoryComponent*          InventoryComponent;                                // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   FoxManText;                                        // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   KotoText;                                          // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   ChangeFoxManID;                                    // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClearLeftTabNew;                                   // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           NormalTabColor;                                    // 0x0534(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TutorialColor;                                     // 0x0544(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SelectTabColor;                                    // 0x0554(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNoceUIInputDirectionHelper*            InputHelper;                                       // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_DisableInputs(bool* NoUse);
	void BP_EnableInputs(bool* NoUse);
	void BP_HideCommon(bool* NoUse);
	void BP_ShowCommon(bool* NoUse);
	void CheckContents(const class FName& Content, const TArray<class FName>& AllGotContents, const TArray<class FName>& AllNewContents, const TArray<class FName>& CurrentTabContents, const TArray<class FName>& CurrentTabNewContents, bool* Match, bool* New);
	void CheckPageContents(class FName CurrentCategory, class FName PageCategory, TArray<class FName>& PageContents, const TArray<class FName>& AllGotContents, const TArray<class FName>& AllNewContents, const TArray<class FName>& CurrentTabContents, const TArray<class FName>& CurrentTabNewContents, TArray<class FName>& AllCategoryContents, int32 CurrentPageNum, int32 PageIndex, bool* MatchContent, bool* HasContent, bool* NeedBlankPage, bool* HasNew);
	void Construct();
	void ExecuteUbergraph_WBP_Notebook(int32 EntryPoint);
	void Get_Init_ID(const ENoceNotebookType Type, class FName* LeftTabID, class FName* ContentID);
	void GetCurrentCategory(class FName* CurrentCategory);
	bool HandleNotRepeatKeys(const struct FInputEvent& InInputEvent, const struct FKey& InKey);
	bool HandleRepeatKeys(const struct FInputEvent& InInputEvent, const struct FKey& InKey);
	void InitCharacter();
	void InitEnemy();
	void InitIDs(TArray<class FName>& AllNameIDs_0, const TArray<class FName>& HasNameIDs, const ENoceNotebookType Type, class FName* LeftTabID);
	void InitInfo();
	void InitPuzzle();
	void InitTutorial();
	void IsCompletePageContents(TArray<class FName>& AllContents, TArray<class FName>& CurrentContents, const struct FNoceNotebookCategoryData& CategoryData, ENoceNotebookBookmarkType* BookmarkType, ENoceNotebookBookmarkSocketType* SocketType);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void OnInitialized();
	void OnLeftTabRefreshNewIDs(class FName RemovedID);
	void OnLeftTabRefreshSelection(int32 Index_0);
	void OnTopTabRefreshSelection(int32 Index_0);
	void SetAllData(bool* NoUse);
	void SetCharacterPages();
	void SetEnemyPages();
	void SetIDArrays(const ENoceNotebookType Type, TArray<class FName>& AllCategoryIDs, const TArray<class FName>& IDArray, const TArray<class FName>& NewIDArray);
	void SetInfoPages();
	void SetPuzzlePages();
	void SetTutorialPages();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Notebook_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Notebook_C")
	}
	static class UWBP_Notebook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Notebook_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Notebook_C;

}

